// AnimBlueprintGeneratedClass BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C
// Size: 0x5a54 (Inherited: 0xa90)
struct UBoarRidingPlayerLayerAnimBP_C : UFortVehicleLayerAnimInstance_Riding {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa90(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xa98(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xb28(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xb30(0x08)
	struct FAnimNode_Root ; // 0xb38(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xb58(0xc0)
	struct FAnimNode_ModifyBone ; // 0xc18(0x128)
	struct FAnimNode_ModifyBone ; // 0xd40(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xe68(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xe88(0x20)
	struct FAnimNode_ModifyBone ; // 0xea8(0x128)
	struct FAnimNode_ModifyBone ; // 0xfd0(0x128)
	struct FAnimNode_ApplyAdditive ; // 0x10f8(0xc8)
	struct FAnimNode_LegIK ; // 0x11c0(0xf8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x12b8(0xf8)
	struct FAnimNode_BlendSpacePlayer ; // 0x13b0(0x68)
	struct FAnimNode_Root ; // 0x1418(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1438(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x14f8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x15b8(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x16b8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x16d8(0x20)
	struct FAnimNode_BlendListByBool ; // 0x16f8(0x48)
	struct FAnimNode_ModifyBone ; // 0x1740(0x128)
	struct FAnimNode_ModifyBone ; // 0x1868(0x128)
	struct FAnimNode_ModifyBone ; // 0x1990(0x128)
	struct FAnimNode_ModifyBone ; // 0x1ab8(0x128)
	struct FAnimNode_TransitionResult ; // 0x1be0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c08(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c30(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c58(0x28)
	struct FAnimNode_TransitionResult ; // 0x1c80(0x28)
	struct FAnimNode_TransitionResult ; // 0x1ca8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1cd0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1cf8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d20(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d48(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d70(0x28)
	struct FAnimNode_TransitionResult ; // 0x1d98(0x28)
	struct FAnimNode_TransitionResult ; // 0x1dc0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1de8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e10(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e38(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e60(0x28)
	struct FAnimNode_TransitionResult ; // 0x1e88(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1eb0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1ef0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1f30(0x48)
	struct FAnimNode_StateResult ; // 0x1f78(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1f98(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1fd8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2018(0x48)
	struct FAnimNode_StateResult ; // 0x2060(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2080(0x40)
	struct FAnimNode_BlendListByBool ; // 0x20c0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2108(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2148(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2188(0x48)
	struct FAnimNode_StateResult ; // 0x21d0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x21f0(0x40)
	struct FAnimNode_StateResult ; // 0x2230(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x2250(0x68)
	struct FAnimNode_SequencePlayer ; // 0x22b8(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x22f8(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x23c0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2408(0x40)
	struct FAnimNode_StateResult ; // 0x2448(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2468(0x40)
	struct FAnimNode_StateResult ; // 0x24a8(0x20)
	struct FAnimNode_TransitionResult ; // 0x24c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x24f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2518(0x28)
	struct FAnimNode_TransitionResult ; // 0x2540(0x28)
	struct FAnimNode_TransitionResult ; // 0x2568(0x28)
	struct FAnimNode_TransitionResult ; // 0x2590(0x28)
	struct FAnimNode_TransitionResult ; // 0x25b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x25e0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2608(0x40)
	struct FAnimNode_StateResult ; // 0x2648(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2668(0x40)
	struct FAnimNode_StateResult ; // 0x26a8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x26c8(0x40)
	struct FAnimNode_StateResult ; // 0x2708(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2728(0x40)
	struct FAnimNode_StateResult ; // 0x2768(0x20)
	struct FAnimNode_TransitionResult ; // 0x2788(0x28)
	struct FAnimNode_StateMachine ; // 0x27b0(0xc8)
	struct FAnimNode_StateResult ; // 0x2878(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2898(0x40)
	struct FAnimNode_StateResult ; // 0x28d8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x28f8(0x40)
	struct FAnimNode_StateResult ; // 0x2938(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2958(0x40)
	struct FAnimNode_StateResult ; // 0x2998(0x20)
	struct FAnimNode_TransitionResult ; // 0x29b8(0x28)
	struct FAnimNode_StateMachine ; // 0x29e0(0xc8)
	struct FAnimNode_StateResult ; // 0x2aa8(0x20)
	struct FAnimNode_TransitionResult ; // 0x2ac8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2af0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2b18(0x40)
	struct FAnimNode_StateResult ; // 0x2b58(0x20)
	struct FAnimNode_StateResult ; // 0x2b78(0x20)
	struct FAnimNode_StateMachine ; // 0x2b98(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x2c60(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2d28(0x68)
	struct FAnimNode_SequencePlayer ; // 0x2d90(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2dd0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2e10(0x48)
	struct FAnimNode_BlendListByBool ; // 0x2e58(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2ea0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x2f08(0xc8)
	struct FAnimNode_StateResult ; // 0x2fd0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2ff0(0x40)
	struct FAnimNode_StateResult ; // 0x3030(0x20)
	struct FAnimNode_StateMachine ; // 0x3050(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x3118(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x31f8(0x28)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x3220(0x100)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3320(0x110)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3430(0xe0)
	struct FAnimNode_TransitionResult ; // 0x3510(0x28)
	struct FAnimNode_TransitionResult ; // 0x3538(0x28)
	struct FAnimNode_TransitionResult ; // 0x3560(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3588(0x28)
	struct FAnimNode_StateResult ; // 0x35b0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x35d0(0x68)
	struct FAnimNode_StateResult ; // 0x3638(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3658(0x28)
	struct FAnimNode_StateResult ; // 0x3680(0x20)
	struct FAnimNode_StateMachine ; // 0x36a0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x3768(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3868(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3890(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3990(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x39b8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x39e0(0x110)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x3af0(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3bc0(0x110)
	struct FAnimNode_TransitionResult ; // 0x3cd0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3cf8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d20(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d48(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d70(0x28)
	struct FAnimNode_TransitionResult ; // 0x3d98(0x28)
	struct FAnimNode_TransitionResult ; // 0x3dc0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3de8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e10(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e38(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e60(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e88(0x28)
	struct FAnimNode_TransitionResult ; // 0x3eb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3ed8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3f00(0x28)
	struct FAnimNode_TransitionResult ; // 0x3f28(0x28)
	struct FAnimNode_TransitionResult ; // 0x3f50(0x28)
	struct FAnimNode_TransitionResult ; // 0x3f78(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3fa0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3fe0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4020(0x48)
	struct FAnimNode_StateResult ; // 0x4068(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4088(0x40)
	struct FAnimNode_SequencePlayer ; // 0x40c8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4108(0x48)
	struct FAnimNode_StateResult ; // 0x4150(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4170(0x40)
	struct FAnimNode_StateResult ; // 0x41b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x41d0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4210(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4250(0x48)
	struct FAnimNode_StateResult ; // 0x4298(0x20)
	struct FAnimNode_TransitionResult ; // 0x42b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x42e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x4308(0x28)
	struct FAnimNode_TransitionResult ; // 0x4330(0x28)
	struct FAnimNode_TransitionResult ; // 0x4358(0x28)
	struct FAnimNode_TransitionResult ; // 0x4380(0x28)
	struct FAnimNode_TransitionResult ; // 0x43a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x43d0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x43f8(0x40)
	struct FAnimNode_StateResult ; // 0x4438(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4458(0x40)
	struct FAnimNode_StateResult ; // 0x4498(0x20)
	struct FAnimNode_SequencePlayer ; // 0x44b8(0x40)
	struct FAnimNode_StateResult ; // 0x44f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4518(0x40)
	struct FAnimNode_StateResult ; // 0x4558(0x20)
	struct FAnimNode_TransitionResult ; // 0x4578(0x28)
	struct FAnimNode_StateMachine ; // 0x45a0(0xc8)
	struct FAnimNode_StateResult ; // 0x4668(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4688(0x40)
	struct FAnimNode_StateResult ; // 0x46c8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x46e8(0x40)
	struct FAnimNode_StateResult ; // 0x4728(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4748(0x40)
	struct FAnimNode_StateResult ; // 0x4788(0x20)
	struct FAnimNode_TransitionResult ; // 0x47a8(0x28)
	struct FAnimNode_StateMachine ; // 0x47d0(0xc8)
	struct FAnimNode_StateResult ; // 0x4898(0x20)
	struct FAnimNode_SequencePlayer ; // 0x48b8(0x40)
	struct FAnimNode_StateResult ; // 0x48f8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4918(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4958(0x48)
	struct FAnimNode_SequencePlayer ; // 0x49a0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x49e0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4a20(0x48)
	struct FAnimNode_StateResult ; // 0x4a68(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4a88(0x40)
	struct FAnimNode_StateResult ; // 0x4ac8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4ae8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4b28(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4b70(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x4bb0(0x68)
	struct FAnimNode_BlendListByBool ; // 0x4c18(0x48)
	struct FAnimNode_StateResult ; // 0x4c60(0x20)
	struct FAnimNode_StateMachine ; // 0x4c80(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4d48(0x128)
	struct FAnimNode_TransitionResult ; // 0x4e70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4e98(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4ec0(0x40)
	struct FAnimNode_StateResult ; // 0x4f00(0x20)
	struct FAnimNode_RefPose ; // 0x4f20(0x10)
	struct FAnimNode_StateResult ; // 0x4f30(0x20)
	struct FAnimNode_StateMachine ; // 0x4f50(0xc8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x5018(0xd0)
	struct FAnimNode_ApplyAdditive ; // 0x50e8(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x51b0(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5218(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x52e0(0x68)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5348(0x10)
	struct FAnimNode_BlendListByBool ; // 0x5358(0x48)
	struct FAnimNode_BlendListByBool ; // 0x53a0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x53e8(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5450(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x54b8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5500(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5520(0xc8)
	struct FAnimNode_Root ; // 0x55e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x5608(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x56c8(0xc0)
	struct FAnimNode_Root ; // 0x5788(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x57a8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5868(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5928(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x59e8(0x20)
	struct AFortPlayerPawn* FortPlayer; // 0x5a08(0x08)
	struct AFortPawn* WildlifePawn; // 0x5a10(0x08)
	bool State Rule Moving Idle; // 0x5a18(0x01)
	bool Is Jumping; // 0x5a19(0x01)
	bool Is Falling; // 0x5a1a(0x01)
	bool Is Surface Swimming; // 0x5a1b(0x01)
	char pad_5A1C[0x4]; // 0x5a1c(0x04)
	double BodyRoll; // 0x5a20(0x08)
	double BoarSpeed2D; // 0x5a28(0x08)
	bool Is Moving Backwards; // 0x5a30(0x01)
	bool Is Boosting; // 0x5a31(0x01)
	bool Can Transition Fall To Moving; // 0x5a32(0x01)
	bool Can Transition Fall To Idle; // 0x5a33(0x01)
	bool Can Transition Idle To Moving; // 0x5a34(0x01)
	bool Is Turning in Place; // 0x5a35(0x01)
	char pad_5A36[0x2]; // 0x5a36(0x02)
	double Turn in Place Angle Delta; // 0x5a38(0x08)
	bool Should Play Stop Backwards; // 0x5a40(0x01)
	bool Play Land Additive; // 0x5a41(0x01)
	bool Was Turning Right; // 0x5a42(0x01)
	char pad_5A43[0x5]; // 0x5a43(0x05)
	double Backwards Play Rate; // 0x5a48(0x08)
	float SlopeRoll; // 0x5a50(0x04)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink InPoseUpperAndLowerCachePose, struct FPoseLink& VehicleFullBodyOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void GetMainAnimBPData_Boar(struct UObject* AnimInstance); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.GetMainAnimBPData_Boar // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BoarRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_3AC2A6BB409F97D93A87FE8016464FEE(); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BoarRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_3AC2A6BB409F97D93A87FE8016464FEE // (BlueprintEvent) // @ game+0xda071c
	void BlueprintCollectRidableAnimBPData(struct UAnimInstance* RidableAnimInstance); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.BlueprintCollectRidableAnimBPData // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_BoarRidingPlayerLayerAnimBP(int32_t EntryPoint); // Function BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.ExecuteUbergraph_BoarRidingPlayerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xda071c
};

