// AnimBlueprintGeneratedClass F_MED_Prime_Skeleton_AnimBlueprint_A.F_MED_Prime_Skeleton_AnimBlueprint_A_C
// Size: 0x6698 (Inherited: 0x6f0)
struct UF_MED_Prime_Skeleton_AnimBlueprint_A_C : UCustomCharacterPartAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6f0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x6f8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x700(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x708(0x20)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x728(0x1d0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8f8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x918(0x20)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig; // 0x938(0x470)
	struct FAnimNode_Constraint ; // 0xda8(0x108)
	struct FAnimNode_Constraint ; // 0xeb0(0x108)
	struct FAnimNode_Constraint ; // 0xfb8(0x108)
	struct FAnimNode_Constraint ; // 0x10c0(0x108)
	struct FAnimNode_Constraint ; // 0x11c8(0x108)
	struct FAnimNode_Constraint ; // 0x12d0(0x108)
	struct FAnimNode_Constraint ; // 0x13d8(0x108)
	struct FAnimNode_Constraint ; // 0x14e0(0x108)
	struct FAnimNode_ModifyBone ; // 0x15e8(0x128)
	struct FAnimNode_Constraint ; // 0x1710(0x108)
	char pad_1818[0x8]; // 0x1818(0x08)
	struct FAnimNode_RigidBody ; // 0x1820(0x990)
	struct FAnimNode_AnimDynamics ; // 0x21b0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x26c0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x2bd0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x30e0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x35f0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x3b00(0x510)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4010(0x510)
	struct FAnimNode_ModifyBone ; // 0x4520(0x128)
	char pad_4648[0x8]; // 0x4648(0x08)
	struct FAnimNode_RigidBody ; // 0x4650(0x990)
	struct FAnimNode_ModifyBone ; // 0x4fe0(0x128)
	struct FAnimNode_Constraint AnimGraphNode_Constraint; // 0x5108(0x108)
	struct FAnimNode_ModifyBone ; // 0x5210(0x128)
	struct FAnimNode_ModifyBone ; // 0x5338(0x128)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x5460(0x990)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5df0(0x128)
	struct FGravityOverrideParamsStruct Gravity Override Params; // 0x5f18(0x750)
	struct FVector Gravity Override; // 0x6668(0x18)
	double Neck Alpha; // 0x6680(0x08)
	double Head Tilt Alpha; // 0x6688(0x08)
	double Skydive Alpha; // 0x6690(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function F_MED_Prime_Skeleton_AnimBlueprint_A.F_MED_Prime_Skeleton_AnimBlueprint_A_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function F_MED_Prime_Skeleton_AnimBlueprint_A.F_MED_Prime_Skeleton_AnimBlueprint_A_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint_A(int32_t EntryPoint); // Function F_MED_Prime_Skeleton_AnimBlueprint_A.F_MED_Prime_Skeleton_AnimBlueprint_A_C.ExecuteUbergraph_F_MED_Prime_Skeleton_AnimBlueprint_A // (Final|UbergraphFunction|HasDefaults) // @ game+0xda071c
};

