// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// Size: 0x10fd9 (Inherited: 0x1d40)
struct UFortnite_M_Avg_Player_AnimBlueprint_C : UFortPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1d40(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1d48(0x570)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x22b8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x22c0(0x08)
	struct FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x22c8(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x2370(0x08)
	struct FAnimNode_Root ; // 0x2378(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2398(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2458(0xc0)
	struct FAnimNode_Root ; // 0x2518(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2538(0xc0)
	struct FAnimNode_Root ; // 0x25f8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2618(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x26d8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2798(0xc0)
	struct FAnimNode_Root ; // 0x2858(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2878(0xc0)
	struct FAnimNode_Root ; // 0x2938(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2958(0xc0)
	struct FAnimNode_Root ; // 0x2a18(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2a38(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2af8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2bb8(0xc0)
	struct FAnimNode_Root ; // 0x2c78(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2c98(0xc0)
	struct FAnimNode_Root ; // 0x2d58(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2d78(0xc0)
	struct FAnimNode_Root ; // 0x2e38(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2e58(0xc0)
	struct FAnimNode_Root ; // 0x2f18(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2f38(0xc0)
	struct FAnimNode_Root ; // 0x2ff8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3018(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x30d8(0xc0)
	struct FAnimNode_Root ; // 0x3198(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x31b8(0xc0)
	struct FAnimNode_Root ; // 0x3278(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3298(0x40)
	struct FAnimNode_BlendListByBool ; // 0x32d8(0x48)
	struct FAnimNode_RefPose ; // 0x3320(0x10)
	struct FAnimNode_Root ; // 0x3330(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3350(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3390(0x48)
	struct FAnimNode_RefPose ; // 0x33d8(0x10)
	struct FAnimNode_Root ; // 0x33e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3408(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3448(0x48)
	struct FAnimNode_RefPose ; // 0x3490(0x10)
	struct FAnimNode_Root ; // 0x34a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x34c0(0x40)
	struct FAnimNode_Root ; // 0x3500(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3520(0x40)
	struct FAnimNode_Root ; // 0x3560(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3580(0xc0)
	struct FAnimNode_Root ; // 0x3640(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x3660(0xc0)
	struct FAnimNode_Root ; // 0x3720(0x20)
	struct FAnimNode_BlendListByBool ; // 0x3740(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3788(0x40)
	struct FAnimNode_SequencePlayer ; // 0x37c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3808(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3848(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3890(0x40)
	struct FAnimNode_SequencePlayer ; // 0x38d0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3910(0x48)
	struct FAnimNode_RefPose ; // 0x3958(0x10)
	struct FAnimNode_BlendListByBool ; // 0x3968(0x48)
	struct FAnimNode_SequencePlayer ; // 0x39b0(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x39f0(0x48)
	struct FAnimNode_Root ; // 0x3a38(0x20)
	struct FAnimNode_BlendListByBool ; // 0x3a58(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3aa0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3ae0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3b20(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3b60(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3ba8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3be8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3c28(0x48)
	struct FAnimNode_RefPose ; // 0x3c70(0x10)
	struct FAnimNode_BlendListByBool ; // 0x3c80(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3cc8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x3d08(0x48)
	struct FAnimNode_Root ; // 0x3d50(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3d70(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3db0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3df8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3e38(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3e78(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3ec0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3f00(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3f48(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3f88(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3fd0(0x40)
	struct FAnimNode_RefPose ; // 0x4010(0x10)
	struct FAnimNode_BlendListByBool ; // 0x4020(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4068(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x40a8(0x48)
	struct FAnimNode_Root ; // 0x40f0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x4110(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4158(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4198(0x40)
	struct FAnimNode_SequencePlayer ; // 0x41d8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4218(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4260(0x40)
	struct FAnimNode_SequencePlayer ; // 0x42a0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x42e0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4320(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x4368(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x43b0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x43f8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4440(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4480(0x48)
	struct FAnimNode_SequencePlayer ; // 0x44c8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4508(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4550(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x4590(0x48)
	struct FAnimNode_SequencePlayer ; // 0x45d8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4618(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4660(0x40)
	struct FAnimNode_BlendListByBool ; // 0x46a0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x46e8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x4728(0x48)
	struct FAnimNode_BlendListByBool ; // 0x4770(0x48)
	struct FAnimNode_SequencePlayer ; // 0x47b8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x47f8(0x40)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4838(0x100)
	struct FAnimNode_BlendListByEnum ; // 0x4938(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4980(0x40)
	struct FAnimNode_BlendListByBool ; // 0x49c0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4a08(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4a48(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4a88(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4ac8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4b10(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4b50(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4b98(0x40)
	struct FAnimNode_Root ; // 0x4bd8(0x20)
	struct FAnimNode_Root ; // 0x4bf8(0x20)
	struct FAnimNode_Root ; // 0x4c18(0x20)
	struct FAnimNode_Root ; // 0x4c38(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4c58(0xc0)
	struct FAnimNode_Root ; // 0x4d18(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4d38(0xc0)
	struct FAnimNode_BlendListByEnum ; // 0x4df8(0x48)
	struct FAnimNode_Root ; // 0x4e40(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4e60(0xc0)
	struct FAnimNode_Root ; // 0x4f20(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4f40(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5000(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x50c0(0xc0)
	struct FAnimNode_Root ; // 0x5180(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x51a0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5260(0xc0)
	struct FAnimNode_Root ; // 0x5320(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x5340(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5400(0xc0)
	struct FAnimNode_Root ; // 0x54c0(0x20)
	struct FAnimNode_TransitionResult ; // 0x54e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x5508(0x28)
	struct FAnimNode_TransitionResult ; // 0x5530(0x28)
	struct FAnimNode_TransitionResult ; // 0x5558(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x5580(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x55e8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5650(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x5698(0x48)
	struct FAnimNode_BlendListByBool ; // 0x56e0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5728(0x68)
	struct FAnimNode_StateResult ; // 0x5790(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x57b0(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5818(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5860(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x58c8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5930(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5978(0x68)
	struct FAnimNode_BlendListByBool ; // 0x59e0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5a28(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x5a90(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5ad8(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5b40(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5ba8(0x48)
	struct FAnimNode_StateResult ; // 0x5bf0(0x20)
	struct FAnimNode_TransitionResult ; // 0x5c10(0x28)
	struct FAnimNode_StateMachine ; // 0x5c38(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x5d00(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x5d68(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5dd0(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x5e18(0x48)
	struct FAnimNode_BlendListByBool ; // 0x5e60(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5ea8(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5f10(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x5f58(0x68)
	struct FAnimNode_BlendListByBool ; // 0x5fc0(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x6008(0x68)
	struct FAnimNode_BlendListByBool ; // 0x6070(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x60b8(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x6120(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x6168(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x61d0(0x68)
	struct FAnimNode_BlendListByBool ; // 0x6238(0x48)
	struct FAnimNode_StateResult ; // 0x6280(0x20)
	struct FAnimNode_StateMachine ; // 0x62a0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x6368(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0x6468(0xc8)
	struct FAnimNode_RefPose ; // 0x6530(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x6540(0xe0)
	struct FAnimNode_RefPose ; // 0x6620(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x6630(0xe0)
	struct FAnimNode_RefPose ; // 0x6710(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x6720(0xe0)
	struct FAnimNode_TransitionResult ; // 0x6800(0x28)
	struct FAnimNode_TransitionResult ; // 0x6828(0x28)
	struct FAnimNode_TransitionResult ; // 0x6850(0x28)
	struct FAnimNode_TransitionResult ; // 0x6878(0x28)
	struct FAnimNode_TransitionResult ; // 0x68a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x68c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x68f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x6918(0x28)
	struct FAnimNode_TransitionResult ; // 0x6940(0x28)
	struct FAnimNode_TransitionResult ; // 0x6968(0x28)
	struct FAnimNode_TransitionResult ; // 0x6990(0x28)
	struct FAnimNode_TransitionResult ; // 0x69b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x69e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a08(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a30(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a58(0x28)
	struct FAnimNode_TransitionResult ; // 0x6a80(0x28)
	struct FAnimNode_TransitionResult ; // 0x6aa8(0x28)
	struct FAnimNode_TransitionResult ; // 0x6ad0(0x28)
	struct FAnimNode_SequencePlayer ; // 0x6af8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6b38(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6b78(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6bb8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6bf8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6c38(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6c78(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x6cb8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x6d00(0x40)
	struct FAnimNode_StateResult ; // 0x6d40(0x20)
	struct FAnimNode_UseCachedPose ; // 0x6d60(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x6d88(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x6dd0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x6eb0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6ef0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6f30(0x40)
	struct FAnimNode_SequencePlayer ; // 0x6f70(0x40)
	struct FAnimNode_StateResult ; // 0x6fb0(0x20)
	struct FAnimNode_UseCachedPose ; // 0x6fd0(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x6ff8(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x7040(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x7120(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7160(0x40)
	struct FAnimNode_SequencePlayer ; // 0x71a0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x71e0(0x40)
	struct FAnimNode_StateResult ; // 0x7220(0x20)
	struct FAnimNode_UseCachedPose ; // 0x7240(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x7268(0x48)
	struct FAnimNode_SequencePlayer ; // 0x72b0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x72f0(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x7338(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x7418(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7458(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7498(0x40)
	struct FAnimNode_SequencePlayer ; // 0x74d8(0x40)
	struct FAnimNode_StateResult ; // 0x7518(0x20)
	struct FAnimNode_UseCachedPose ; // 0x7538(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x7560(0x48)
	struct FAnimNode_TwoWayBlend ; // 0x75a8(0xc0)
	struct FAnimNode_SequencePlayer ; // 0x7668(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0x76a8(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x7788(0x40)
	struct FAnimNode_SequencePlayer ; // 0x77c8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7808(0x40)
	struct FAnimNode_SequencePlayer ; // 0x7848(0x40)
	struct FAnimNode_StateResult ; // 0x7888(0x20)
	struct FAnimNode_TwoWayBlend ; // 0x78a8(0xc0)
	struct FAnimNode_SequencePlayer ; // 0x7968(0x40)
	struct FAnimNode_SequencePlayer ; // 0x79a8(0x40)
	struct FAnimNode_StateResult ; // 0x79e8(0x20)
	struct FAnimNode_StateMachine ; // 0x7a08(0xc8)
	struct FAnimNode_TwoWayBlend ; // 0x7ad0(0xc0)
	struct FAnimNode_RefPose ; // 0x7b90(0x10)
	struct FAnimNode_SequencePlayer ; // 0x7ba0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x7be0(0x48)
	struct FAnimNode_LinkedAnimLayer ; // 0x7c28(0xc8)
	struct FAnimNode_StateResult ; // 0x7cf0(0x20)
	struct FAnimNode_UseCachedPose ; // 0x7d10(0x28)
	struct FAnimNode_StateResult ; // 0x7d38(0x20)
	struct FAnimNode_StateMachine ; // 0x7d58(0xc8)
	struct FAnimNode_StateResult ; // 0x7e20(0x20)
	struct FAnimNode_StateMachine ; // 0x7e40(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x7f08(0x100)
	struct FAnimNode_Root ; // 0x8008(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x8028(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x80e8(0xc0)
	struct FAnimNode_RotateRootBone ; // 0x81a8(0xa8)
	struct FAnimNode_BlendListByBool ; // 0x8250(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x8298(0x100)
	struct FAnimNode_UseCachedPose ; // 0x8398(0x28)
	struct FAnimNode_UseCachedPose ; // 0x83c0(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x83e8(0xe0)
	struct FAnimNode_Root ; // 0x84c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x84e8(0xc0)
	struct FAnimNode_Slot ; // 0x85a8(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x85f0(0x100)
	struct FAnimNode_Slot ; // 0x86f0(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x8738(0x100)
	struct FAnimNode_UseCachedPose ; // 0x8838(0x28)
	struct FAnimNode_BlendListByBool ; // 0x8860(0x48)
	struct FAnimNode_UseCachedPose ; // 0x88a8(0x28)
	struct FAnimNode_Slot ; // 0x88d0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x8918(0x28)
	struct FAnimNode_UseCachedPose ; // 0x8940(0x28)
	struct FAnimNode_UseCachedPose ; // 0x8968(0x28)
	struct FAnimNode_UseCachedPose ; // 0x8990(0x28)
	struct FAnimNode_SequencePlayer ; // 0x89b8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x89f8(0x40)
	struct FAnimNode_SequencePlayer ; // 0x8a38(0x40)
	struct FAnimNode_BlendListByBool ; // 0x8a78(0x48)
	struct FAnimNode_BlendListByBool ; // 0x8ac0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x8b08(0x40)
	struct FAnimNode_SequencePlayer ; // 0x8b48(0x40)
	struct FAnimNode_BlendListByBool ; // 0x8b88(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x8bd0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x8c98(0xc8)
	struct FAnimNode_Slot ; // 0x8d60(0x48)
	struct FAnimNode_BlendListByEnum ; // 0x8da8(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x8df0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x8ed0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0x8f10(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x8fd8(0xe0)
	struct FAnimNode_StateResult ; // 0x90b8(0x20)
	struct FAnimNode_StateMachine ; // 0x90d8(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x91a0(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x91c8(0x100)
	struct FAnimNode_Root ; // 0x92c8(0x20)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x92e8(0x110)
	struct FAnimNode_BlendListByBool ; // 0x93f8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x9440(0x48)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x9488(0x110)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x9598(0x110)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x96a8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x9768(0x100)
	struct FAnimNode_UseCachedPose ; // 0x9868(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9890(0x28)
	struct FAnimNode_UseCachedPose ; // 0x98b8(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x98e0(0x20)
	struct FAnimNode_Slot ; // 0x9900(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x9948(0x100)
	struct FAnimNode_TransitionResult ; // 0x9a48(0x28)
	struct FAnimNode_TransitionResult ; // 0x9a70(0x28)
	struct FAnimNode_TransitionResult ; // 0x9a98(0x28)
	struct FAnimNode_TransitionResult ; // 0x9ac0(0x28)
	struct FAnimNode_TransitionResult ; // 0x9ae8(0x28)
	struct FAnimNode_TransitionResult ; // 0x9b10(0x28)
	struct FAnimNode_TransitionResult ; // 0x9b38(0x28)
	struct FAnimNode_TransitionResult ; // 0x9b60(0x28)
	struct FAnimNode_TransitionResult ; // 0x9b88(0x28)
	struct FAnimNode_TransitionResult ; // 0x9bb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x9bd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x9c00(0x28)
	struct FAnimNode_TransitionResult ; // 0x9c28(0x28)
	struct FAnimNode_TransitionResult ; // 0x9c50(0x28)
	struct FAnimNode_TransitionResult ; // 0x9c78(0x28)
	struct FAnimNode_TransitionResult ; // 0x9ca0(0x28)
	struct FAnimNode_TransitionResult ; // 0x9cc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x9cf0(0x28)
	struct FAnimNode_TransitionResult ; // 0x9d18(0x28)
	struct FAnimNode_UseCachedPose ; // 0x9d40(0x28)
	struct FAnimNode_StateResult ; // 0x9d68(0x20)
	struct FAnimNode_UseCachedPose ; // 0x9d88(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0x9db0(0xb8)
	struct FAnimNode_StateResult ; // 0x9e68(0x20)
	struct FAnimNode_TransitionResult ; // 0x9e88(0x28)
	struct FAnimNode_StateMachine ; // 0x9eb0(0xc8)
	struct FAnimNode_StateResult ; // 0x9f78(0x20)
	struct FAnimNode_TransitionResult ; // 0x9f98(0x28)
	struct FAnimNode_SequencePlayer ; // 0x9fc0(0x40)
	struct FAnimNode_StateResult ; // 0xa000(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa020(0x40)
	struct FAnimNode_StateResult ; // 0xa060(0x20)
	struct FAnimNode_StateMachine ; // 0xa080(0xc8)
	struct FAnimNode_StateResult ; // 0xa148(0x20)
	struct FAnimNode_TransitionResult ; // 0xa168(0x28)
	struct FAnimNode_SequencePlayer ; // 0xa190(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xa1d0(0x48)
	struct FAnimNode_SequencePlayer ; // 0xa218(0x40)
	struct FAnimNode_StateResult ; // 0xa258(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa278(0x40)
	struct FAnimNode_StateResult ; // 0xa2b8(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0xa2d8(0xb8)
	struct FAnimNode_StateResult ; // 0xa390(0x20)
	struct FAnimNode_SequencePlayer ; // 0xa3b0(0x40)
	struct FAnimNode_StateResult ; // 0xa3f0(0x20)
	struct FAnimNode_LinkedAnimGraph ; // 0xa410(0xb8)
	struct FAnimNode_StateResult ; // 0xa4c8(0x20)
	struct FAnimNode_StateMachine ; // 0xa4e8(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xa5b0(0xa8)
	struct FAnimNode_LayeredBoneBlend ; // 0xa658(0xe0)
	struct FAnimNode_RefPose ; // 0xa738(0x10)
	struct FAnimNode_LinkedAnimGraph ; // 0xa748(0xb8)
	struct FAnimNode_UseCachedPose ; // 0xa800(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xa828(0x100)
	struct FAnimNode_UseCachedPose ; // 0xa928(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0xa950(0x68)
	struct FAnimNode_SaveCachedPose ; // 0xa9b8(0x100)
	struct FAnimNode_UseCachedPose ; // 0xaab8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xaae0(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0xabe0(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0xaca8(0xc8)
	struct FAnimNode_Slot ; // 0xad70(0x48)
	struct FAnimNode_SaveCachedPose ; // 0xadb8(0x100)
	struct FAnimNode_LayeredBoneBlend ; // 0xaeb8(0xe0)
	struct FAnimNode_RefPose ; // 0xaf98(0x10)
	struct FAnimNode_TransitionResult ; // 0xafa8(0x28)
	struct FAnimNode_TransitionResult ; // 0xafd0(0x28)
	struct FAnimNode_TransitionResult ; // 0xaff8(0x28)
	struct FAnimNode_TransitionResult ; // 0xb020(0x28)
	struct FAnimNode_TransitionResult ; // 0xb048(0x28)
	struct FAnimNode_TransitionResult ; // 0xb070(0x28)
	struct FAnimNode_SequencePlayer ; // 0xb098(0x40)
	struct FAnimNode_StateResult ; // 0xb0d8(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xb0f8(0xc8)
	struct FAnimNode_RefPose ; // 0xb1c0(0x10)
	struct FAnimNode_StateResult ; // 0xb1d0(0x20)
	struct FAnimNode_UseCachedPose ; // 0xb1f0(0x28)
	struct FAnimNode_UseCachedPose ; // 0xb218(0x28)
	struct FAnimNode_BlendListByBool ; // 0xb240(0x48)
	struct FAnimNode_Slot ; // 0xb288(0x48)
	struct FAnimNode_StateResult ; // 0xb2d0(0x20)
	struct FAnimNode_StateMachine ; // 0xb2f0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xb3b8(0x100)
	struct FAnimNode_LinkedAnimLayer ; // 0xb4b8(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xb580(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xb648(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xb670(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xb738(0x100)
	struct FAnimNode_SaveCachedPose ; // 0xb838(0x100)
	struct FAnimNode_UseCachedPose ; // 0xb938(0x28)
	struct FAnimNode_UseCachedPose ; // 0xb960(0x28)
	struct FAnimNode_Slot ; // 0xb988(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xb9d0(0xe0)
	struct FAnimNode_LinkedAnimLayer ; // 0xbab0(0xc8)
	struct FAnimNode_BlendListByBool ; // 0xbb78(0x48)
	struct FAnimNode_BlendListByBool ; // 0xbbc0(0x48)
	struct FAnimNode_Slot ; // 0xbc08(0x48)
	struct FAnimNode_UseCachedPose ; // 0xbc50(0x28)
	struct FAnimNode_Slot ; // 0xbc78(0x48)
	struct FAnimNode_UseCachedPose ; // 0xbcc0(0x28)
	struct FAnimNode_BlendListByBool ; // 0xbce8(0x48)
	struct FAnimNode_Slot ; // 0xbd30(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xbd78(0x20)
	struct FAnimNode_Slot ; // 0xbd98(0x48)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0xbde0(0x110)
	struct FAnimNode_Slot ; // 0xbef0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xbf38(0x20)
	struct FAnimNode_StateResult ; // 0xbf58(0x20)
	struct FAnimNode_StateMachine ; // 0xbf78(0xc8)
	struct FAnimNode_SequencePlayer ; // 0xc040(0x40)
	struct FAnimNode_BlendListByBool ; // 0xc080(0x48)
	struct FAnimNode_SequencePlayer ; // 0xc0c8(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0xc108(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xc1e8(0x40)
	struct FAnimNode_StateResult ; // 0xc228(0x20)
	struct FAnimNode_StateMachine ; // 0xc248(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xc310(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xc3d8(0x28)
	struct FAnimNode_UseCachedPose ; // 0xc400(0x28)
	struct FAnimNode_UseCachedPose ; // 0xc428(0x28)
	struct FAnimNode_BlendListByBool ; // 0xc450(0x48)
	struct FAnimNode_LinkedAnimGraph ; // 0xc498(0xb8)
	struct FAnimNode_LinkedAnimGraph ; // 0xc550(0xb8)
	struct FAnimNode_UseCachedPose ; // 0xc608(0x28)
	struct FAnimNode_TransitionResult ; // 0xc630(0x28)
	struct FAnimNode_TransitionResult ; // 0xc658(0x28)
	struct FAnimNode_TransitionResult ; // 0xc680(0x28)
	struct FAnimNode_TransitionResult ; // 0xc6a8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc6d0(0x28)
	struct FAnimNode_TransitionResult ; // 0xc6f8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc720(0x28)
	struct FAnimNode_TransitionResult ; // 0xc748(0x28)
	struct FAnimNode_TransitionResult ; // 0xc770(0x28)
	struct FAnimNode_TransitionResult ; // 0xc798(0x28)
	struct FAnimNode_TransitionResult ; // 0xc7c0(0x28)
	struct FAnimNode_TransitionResult ; // 0xc7e8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc810(0x28)
	struct FAnimNode_TransitionResult ; // 0xc838(0x28)
	struct FAnimNode_TransitionResult ; // 0xc860(0x28)
	struct FAnimNode_TransitionResult ; // 0xc888(0x28)
	struct FAnimNode_TransitionResult ; // 0xc8b0(0x28)
	struct FAnimNode_TransitionResult ; // 0xc8d8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc900(0x28)
	struct FAnimNode_TransitionResult ; // 0xc928(0x28)
	struct FAnimNode_TransitionResult ; // 0xc950(0x28)
	struct FAnimNode_TransitionResult ; // 0xc978(0x28)
	struct FAnimNode_TransitionResult ; // 0xc9a0(0x28)
	struct FAnimNode_TransitionResult ; // 0xc9c8(0x28)
	struct FAnimNode_TransitionResult ; // 0xc9f0(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xca18(0xc8)
	struct FAnimNode_StateResult ; // 0xcae0(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xcb00(0xc8)
	struct FAnimNode_StateResult ; // 0xcbc8(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xcbe8(0xc8)
	struct FAnimNode_StateResult ; // 0xccb0(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xccd0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0xcd98(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0xcdd8(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xceb8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcef8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcf38(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xcf78(0x48)
	struct FAnimNode_SequencePlayer ; // 0xcfc0(0x40)
	struct FAnimNode_TwoWayBlend ; // 0xd000(0xc0)
	struct FAnimNode_RefPose ; // 0xd0c0(0x10)
	struct FAnimNode_BlendListByBool ; // 0xd0d0(0x48)
	struct FAnimNode_StateResult ; // 0xd118(0x20)
	struct FAnimNode_StateMachine ; // 0xd138(0xc8)
	struct FAnimNode_StateResult ; // 0xd200(0x20)
	struct FAnimNode_TransitionResult ; // 0xd220(0x28)
	struct FAnimNode_TransitionResult ; // 0xd248(0x28)
	struct FAnimNode_BlendListByEnum ; // 0xd270(0x48)
	struct FAnimNode_SequencePlayer ; // 0xd2b8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd2f8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd338(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd378(0x40)
	struct FAnimNode_BlendListByBool ; // 0xd3b8(0x48)
	struct FAnimNode_BlendListByBool ; // 0xd400(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xd448(0x68)
	struct FAnimNode_ApplyAdditive ; // 0xd4b0(0xc8)
	struct FAnimNode_StateResult ; // 0xd578(0x20)
	struct FAnimNode_BlendListByEnum ; // 0xd598(0x48)
	struct FAnimNode_SequencePlayer ; // 0xd5e0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd620(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd660(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd6a0(0x40)
	struct FAnimNode_BlendListByBool ; // 0xd6e0(0x48)
	struct FAnimNode_BlendListByBool ; // 0xd728(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xd770(0x68)
	struct FAnimNode_ApplyAdditive ; // 0xd7d8(0xc8)
	struct FAnimNode_StateResult ; // 0xd8a0(0x20)
	struct FAnimNode_StateMachine ; // 0xd8c0(0xc8)
	struct FAnimNode_StateResult ; // 0xd988(0x20)
	struct FAnimNode_RefPose ; // 0xd9a8(0x10)
	struct FAnimNode_BlendListByBool ; // 0xd9b8(0x48)
	struct FAnimNode_TransitionResult ; // 0xda00(0x28)
	struct FAnimNode_TransitionResult ; // 0xda28(0x28)
	struct FAnimNode_TransitionResult ; // 0xda50(0x28)
	struct FAnimNode_TransitionResult ; // 0xda78(0x28)
	struct FAnimNode_TransitionResult ; // 0xdaa0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdac8(0x28)
	struct FAnimNode_TransitionResult ; // 0xdaf0(0x28)
	struct FAnimNode_RefPose ; // 0xdb18(0x10)
	struct FAnimNode_StateResult ; // 0xdb28(0x20)
	struct FAnimNode_TransitionResult ; // 0xdb48(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0xdb70(0xc8)
	struct FAnimNode_StateResult ; // 0xdc38(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0xdc58(0xc8)
	struct FAnimNode_StateResult ; // 0xdd20(0x20)
	struct FAnimNode_StateMachine ; // 0xdd40(0xc8)
	struct FAnimNode_StateResult ; // 0xde08(0x20)
	struct FAnimNode_TransitionResult ; // 0xde28(0x28)
	struct FAnimNode_TransitionResult ; // 0xde50(0x28)
	struct FAnimNode_TransitionResult ; // 0xde78(0x28)
	struct FAnimNode_TransitionResult ; // 0xdea0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdec8(0x28)
	struct FAnimNode_TransitionResult ; // 0xdef0(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf18(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf40(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf68(0x28)
	struct FAnimNode_TransitionResult ; // 0xdf90(0x28)
	struct FAnimNode_TransitionResult ; // 0xdfb8(0x28)
	struct FAnimNode_TransitionResult ; // 0xdfe0(0x28)
	struct FAnimNode_RefPose ; // 0xe008(0x10)
	struct FAnimNode_TwoWayBlend ; // 0xe018(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0xe0d8(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0xe1a0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xe280(0x40)
	struct FAnimNode_UseCachedPose ; // 0xe2c0(0x28)
	struct FAnimNode_ApplyAdditive ; // 0xe2e8(0xc8)
	struct FAnimNode_StateResult ; // 0xe3b0(0x20)
	struct FAnimNode_RefPose ; // 0xe3d0(0x10)
	struct FAnimNode_TwoWayBlend ; // 0xe3e0(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0xe4a0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0xe568(0x40)
	struct FAnimNode_LayeredBoneBlend ; // 0xe5a8(0xe0)
	struct FAnimNode_UseCachedPose ; // 0xe688(0x28)
	struct FAnimNode_ApplyAdditive ; // 0xe6b0(0xc8)
	struct FAnimNode_StateResult ; // 0xe778(0x20)
	struct FAnimNode_RefPose ; // 0xe798(0x10)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xe7a8(0xc0)
	struct FAnimNode_LinkedAnimLayer ; // 0xe868(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xe930(0xe0)
	struct FAnimNode_SequencePlayer ; // 0xea10(0x40)
	struct FAnimNode_UseCachedPose ; // 0xea50(0x28)
	struct FAnimNode_ApplyAdditive ; // 0xea78(0xc8)
	struct FAnimNode_StateResult ; // 0xeb40(0x20)
	struct FAnimNode_StateMachine ; // 0xeb60(0xc8)
	struct FAnimNode_StateResult ; // 0xec28(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xec48(0x28)
	struct FAnimNode_StateMachine ; // 0xec70(0xc8)
	struct FAnimNode_StateResult ; // 0xed38(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0xed58(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xedc0(0x68)
	struct FAnimNode_BlendListByBool ; // 0xee28(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0xee70(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0xeed8(0x68)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xef40(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xef88(0x68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xeff0(0x40)
	struct FAnimNode_ApplyAdditive ; // 0xf030(0xc8)
	struct FAnimNode_StateResult ; // 0xf0f8(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xf118(0x10)
	struct FAnimNode_StateResult ; // 0xf128(0x20)
	struct FAnimNode_StateMachine ; // 0xf148(0xc8)
	struct FAnimNode_LinkedAnimGraph ; // 0xf210(0xb8)
	struct FAnimNode_BlendListByBool ; // 0xf2c8(0x48)
	struct FAnimNode_UseCachedPose ; // 0xf310(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf338(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf360(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xf388(0x100)
	struct FAnimNode_LinkedAnimGraph ; // 0xf488(0xb8)
	struct FAnimNode_UseCachedPose ; // 0xf540(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf568(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0xf590(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xf658(0xc8)
	struct FAnimNode_UseCachedPose ; // 0xf720(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf748(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf770(0x28)
	struct FAnimNode_ApplyAdditive ; // 0xf798(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0xf860(0x100)
	struct FAnimNode_SaveCachedPose ; // 0xf960(0x100)
	struct FAnimNode_SaveCachedPose ; // 0xfa60(0x100)
	struct FFortAnimNode_ScaleCharacterBones FortAnimGraphNode_ScaleCharacterBones; // 0xfb60(0xd8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xfc38(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xfd38(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfd58(0x20)
	struct FAnimNode_UseCachedPose ; // 0xfd78(0x28)
	struct FAnimNode_LinkedAnimGraph ; // 0xfda0(0xb8)
	struct FAnimNode_LinkedAnimLayer ; // 0xfe58(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xff20(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0xffe8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x100b0(0x48)
	struct FAnimNode_BlendListByBool ; // 0x100f8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x10140(0x48)
	struct FAnimNode_LinkedAnimLayer ; // 0x10188(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x10250(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x10318(0x100)
	struct FAnimNode_UseCachedPose ; // 0x10418(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x10440(0x100)
	struct FAnimNode_UseCachedPose ; // 0x10540(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10568(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x10590(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x10658(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x10720(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10748(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10770(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x10798(0xc8)
	struct FAnimNode_RefPose ; // 0x10860(0x10)
	struct FAnimNode_UseCachedPose ; // 0x10870(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10898(0x28)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x108c0(0x10)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x108d0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x10998(0x28)
	struct FAnimNode_UseCachedPose ; // 0x109c0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x109e8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10a10(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10a38(0x28)
	struct FAnimNode_UseCachedPose ; // 0x10a60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x10a88(0x28)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x10ab0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x10af8(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x10b18(0xc8)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x10be0(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x10c98(0x48)
	bool __CustomProperty_ParaGlide_TriggerAnim_EE06BC0D4AF7A3598BB824A5286F89C8; // 0x10ce0(0x01)
	char pad_10CE1[0x3]; // 0x10ce1(0x03)
	struct FName __CustomProperty_EmoteAnimOffsetCurveName_D066576F42932FCE06C5E8B658C15225; // 0x10ce4(0x04)
	struct FVector __CustomProperty_LeftHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x10ce8(0x18)
	struct FVector __CustomProperty_RightHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x10d00(0x18)
	bool __CustomProperty_IsHidingInProp_D066576F42932FCE06C5E8B658C15225; // 0x10d18(0x01)
	char pad_10D19[0x3]; // 0x10d19(0x03)
	struct FFortAnimInput_AdjustedAim __CustomProperty_InputParam_72CED7AF4FEDEFE487025CB4B92A64EE; // 0x10d1c(0x23c)
	struct FMulticastInlineDelegate MenuScreenDispatcher; // 0x10f58(0x10)
	double StartAnimBlendTime; // 0x10f68(0x08)
	double PivotAnimBlendTime; // 0x10f70(0x08)
	double CrouchPlayRate; // 0x10f78(0x08)
	bool IsSnowman; // 0x10f80(0x01)
	bool ShouldTrigerGrappleMontage; // 0x10f81(0x01)
	char pad_10F82[0x6]; // 0x10f82(0x06)
	struct FMulticastInlineDelegate Indigo_Boost; // 0x10f88(0x10)
	bool ParaGlide_UseAltGliderCam; // 0x10f98(0x01)
	char pad_10F99[0x7]; // 0x10f99(0x07)
	struct FVector LeftHandOverride; // 0x10fa0(0x18)
	struct FVector RightHandOverride; // 0x10fb8(0x18)
	bool ParaGlide_TriggerAnim; // 0x10fd0(0x01)
	char pad_10FD1[0x3]; // 0x10fd1(0x03)
	struct FName EmoteAnimOffsetCurveName; // 0x10fd4(0x04)
	bool ExitLandingState; // 0x10fd8(0x01)

	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
