// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C
// Size: 0x2018 (Inherited: 0x690)
struct UFortnite_M_Avg_Player_ZipLine_AnimBlueprint_C : UFortZiplineAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x690(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x698(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x728(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x730(0x08)
	struct FAnimNode_Root ; // 0x738(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x758(0xc0)
	struct FAnimNode_Root ; // 0x818(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x838(0xc0)
	struct FAnimNode_Root ; // 0x8f8(0x20)
	struct FAnimNode_Root ; // 0x918(0x20)
	struct FAnimNode_Root ; // 0x938(0x20)
	struct FAnimNode_Root ; // 0x958(0x20)
	struct FAnimNode_Root ; // 0x978(0x20)
	struct FAnimNode_Root ; // 0x998(0x20)
	struct FAnimNode_BlendListByBool ; // 0x9b8(0x48)
	struct FAnimNode_BlendListByBool ; // 0xa00(0x48)
	struct FAnimNode_SequencePlayer ; // 0xa48(0x40)
	struct FAnimNode_SequencePlayer ; // 0xa88(0x40)
	struct FAnimNode_SequencePlayer ; // 0xac8(0x40)
	struct FAnimNode_SequencePlayer ; // 0xb08(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xb48(0x48)
	struct FAnimNode_Root ; // 0xb90(0x20)
	struct FAnimNode_BlendListByBool ; // 0xbb0(0x48)
	struct FAnimNode_BlendListByBool ; // 0xbf8(0x48)
	struct FAnimNode_SequencePlayer ; // 0xc40(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc80(0x40)
	struct FAnimNode_SequencePlayer ; // 0xcc0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd00(0x40)
	struct FAnimNode_BlendListByEnum ; // 0xd40(0x48)
	struct FAnimNode_Root ; // 0xd88(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xda8(0xc0)
	struct FAnimNode_Root ; // 0xe68(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xe88(0xc0)
	struct FAnimNode_Root ; // 0xf48(0x20)
	struct FAnimNode_Root ; // 0xf68(0x20)
	struct FAnimNode_Root ; // 0xf88(0x20)
	struct FAnimNode_Root ; // 0xfa8(0x20)
	struct FAnimNode_Root ; // 0xfc8(0x20)
	struct FAnimNode_Root ; // 0xfe8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1008(0xc0)
	struct FAnimNode_Root ; // 0x10c8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x10e8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x11a8(0xc0)
	struct FAnimNode_Root ; // 0x1268(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1288(0xc0)
	struct FAnimNode_Root ; // 0x1348(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1368(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1428(0x20)
	struct FAnimNode_TransitionResult ; // 0x1448(0x28)
	struct FAnimNode_TransitionResult ; // 0x1470(0x28)
	struct FAnimNode_TransitionResult ; // 0x1498(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14c0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x14e8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1510(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1558(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1598(0x40)
	struct FAnimNode_SequencePlayer ; // 0x15d8(0x40)
	struct FAnimNode_BlendListByEnum ; // 0x1618(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1660(0x40)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x16a0(0xe0)
	struct FAnimNode_SequencePlayer ; // 0x1780(0x40)
	struct FAnimNode_SequencePlayer ; // 0x17c0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1800(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1840(0x40)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1880(0x48)
	struct FAnimNode_StateResult ; // 0x18c8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x18e8(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x1910(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1978(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x1a40(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1b08(0x40)
	struct FAnimNode_StateResult ; // 0x1b48(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x1b68(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1c30(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1c98(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1d60(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1d80(0xc8)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x1e48(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1f10(0x100)
	double PivotAnimBlendTime; // 0x2010(0x08)

	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFullBodySprint(struct FPoseLink InPoseSprint, struct FPoseLink& ItemFullBodySprint); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFullBodySprint // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemCrouchTurningAdditive(struct FPoseLink& ItemCrouchTurningAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemCrouchTurningAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemSlopeSliding(struct FPoseLink& ItemSlopeSliding); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSlopeSliding // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFlyModeStartAdditive(struct FPoseLink& ItemFlyModeStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFlyModeStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemFlyModeLoopAdditive(struct FPoseLink& ItemFlyModeLoopAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFlyModeLoopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemJogStartAdditive(struct FPoseLink InPoseJogStartAdditive, struct FPoseLink& ItemJogStartAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogStartAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemJogStopAdditive(struct FPoseLink InPoseJogStopAdditive, struct FPoseLink& ItemJogStopAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogStopAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemJogPrePivotAdditive(struct FPoseLink InPosePrePivotAdditive, struct FPoseLink& ItemJogPrePivotAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogPrePivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemJogPostPivotAdditive(struct FPoseLink InPosePostPivotAdditive, struct FPoseLink& ItemJogPostPivotAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemJogPostPivotAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemLowerBodyLeanAdditive(struct FPoseLink InPoseLowerBodyLeanAdditive, struct FPoseLink& ItemLowerBodyLeanAdditive); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyLeanAdditive // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemLowerBodyJogStart(struct FPoseLink InPoseLowerBodyJogStart, struct FPoseLink& ItemLowerBodyJogStart); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogStart // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemLowerBodyJogStop(struct FPoseLink InPoseLowerBodyJogStop, struct FPoseLink& ItemLowerBodyJogStop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogStop // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemLowerBodyJogPrePivot(struct FPoseLink InPoseLowerBodyJogPrePivot, struct FPoseLink& ItemLowerBodyJogPrePivot); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogPrePivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemLowerBodyJogPostPivot(struct FPoseLink InPoseLowerBodyJogPostPivot, struct FPoseLink& ItemLowerBodyJogPostPivot); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemLowerBodyJogPostPivot // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_Fortnite_M_Avg_Player_ZipLine_AnimBlueprint(int32_t EntryPoint); // Function Fortnite_M_Avg_Player_ZipLine_AnimBlueprint.Fortnite_M_Avg_Player_ZipLine_AnimBlueprint_C.ExecuteUbergraph_Fortnite_M_Avg_Player_ZipLine_AnimBlueprint // (Final|UbergraphFunction) // @ game+0xda071c
};

