// ScriptStruct Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x05 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char ; // 0x02(0x01)
	char ; // 0x03(0x01)
	bool ; // 0x04(0x01)
};

// ScriptStruct Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x168 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<float> ; // 0x08(0x10)
	struct TArray<float> ; // 0x18(0x10)
	struct TArray<int32_t> ; // 0x28(0x10)
	struct UBlendProfile* ; // 0x38(0x08)
	struct UCurveFloat* ; // 0x40(0x08)
	enum class EAlphaBlendOption ; // 0x48(0x01)
	enum class EBlendListTransitionType ; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
	struct TArray<float> ; // 0x50(0x10)
	struct UAnimSequenceBase* ; // 0x60(0x08)
	bool ; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float ; // 0x6c(0x04)
	struct FInputScaleBiasClampConstants ; // 0x70(0x2c)
	float ; // 0x9c(0x04)
	struct UAnimSequenceBase* ; // 0xa0(0x08)
	bool ; // 0xa8(0x01)
	enum class EAnimSyncMethod ; // 0xa9(0x01)
	enum class EAnimGroupRole ; // 0xaa(0x01)
	char pad_AB[0x5]; // 0xab(0x05)
	struct FAnimNodeFunctionRef ; // 0xb0(0x18)
	struct FName ; // 0xc8(0x04)
	struct FName ; // 0xcc(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xd0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x150(0x18)
};

