// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C
// Size: 0x1b88 (Inherited: 0x6a0)
struct UFortnite_M_Avg_Player_Sprint_AnimBP_C : UFortSprintAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6a0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6a8(0x90)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x738(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x740(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x748(0x20)
	struct FAnimNode_TransitionResult ; // 0x768(0x28)
	struct FAnimNode_TransitionResult ; // 0x790(0x28)
	struct FAnimNode_TransitionResult ; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x808(0x28)
	struct FAnimNode_TransitionResult ; // 0x830(0x28)
	struct FAnimNode_TransitionResult ; // 0x858(0x28)
	struct FAnimNode_TransitionResult ; // 0x880(0x28)
	struct FAnimNode_TransitionResult ; // 0x8a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x8d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x8f8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x920(0x40)
	struct FAnimNode_StateResult ; // 0x960(0x20)
	struct FAnimNode_SequencePlayer ; // 0x980(0x40)
	struct FAnimNode_BlendListByBool ; // 0x9c0(0x48)
	struct FAnimNode_SequencePlayer ; // 0xa08(0x40)
	struct FAnimNode_StateResult ; // 0xa48(0x20)
	struct FAnimNode_BlendListByBool ; // 0xa68(0x48)
	struct FAnimNode_SequencePlayer ; // 0xab0(0x40)
	struct FAnimNode_SequencePlayer ; // 0xaf0(0x40)
	struct FAnimNode_StateResult ; // 0xb30(0x20)
	struct FAnimNode_StateMachine ; // 0xb50(0xc8)
	struct FAnimNode_StateResult ; // 0xc18(0x20)
	struct FAnimNode_SequencePlayer ; // 0xc38(0x40)
	struct FAnimNode_SequencePlayer ; // 0xc78(0x40)
	struct FAnimNode_BlendListByBool ; // 0xcb8(0x48)
	struct FAnimNode_StateResult ; // 0xd00(0x20)
	struct FAnimNode_SequencePlayer ; // 0xd20(0x40)
	struct FAnimNode_SequencePlayer ; // 0xd60(0x40)
	struct FAnimNode_BlendListByBool ; // 0xda0(0x48)
	struct FAnimNode_StateResult ; // 0xde8(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe08(0x28)
	struct FAnimNode_StateMachine ; // 0xe30(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xef8(0xa8)
	struct FAnimNode_BlendSpacePlayer ; // 0xfa0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1008(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x10d0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1198(0x40)
	struct FAnimNode_BlendListByBool ; // 0x11d8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1220(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1260(0x40)
	struct FAnimNode_SequencePlayer ; // 0x12a0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x12e0(0x48)
	struct FAnimNode_ApplyAdditive ; // 0x1328(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x13f0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14b8(0x40)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x14f8(0xc8)
	struct FAnimNode_Slot ; // 0x15c0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1608(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x1630(0xe0)
	struct FAnimNode_BlendSpacePlayer ; // 0x1710(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1778(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17e0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1828(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1850(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1878(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18c0(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19a0(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x19c0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1a88(0x100)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP(int32_t EntryPoint); // Function Fortnite_M_Avg_Player_Sprint_AnimBP.Fortnite_M_Avg_Player_Sprint_AnimBP_C.ExecuteUbergraph_Fortnite_M_Avg_Player_Sprint_AnimBP // (Final|UbergraphFunction) // @ game+0xda071c
};

