// Class FortniteUI.FortHUDElementWidget
// Size: 0x320 (Inherited: 0x2e0)
struct UFortHUDElementWidget : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct FGameplayTag ElementTag; // 0x2e8(0x04)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct FGameplayTagContainer HUDElementTag; // 0x2f0(0x20)
	enum class ESlateVisibility HiddenVisibility; // 0x310(0x01)
	char pad_311[0x7]; // 0x311(0x07)
	struct UTutorialHighlight* TutorialHighlight; // 0x318(0x08)

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility); // Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	bool HasAnyTags(struct FGameplayTagContainer& InTags); // Function FortniteUI.FortHUDElementWidget.HasAnyTags // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b441bc
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags); // Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged // (RequiredAPI|Native|Protected|HasOutParms) // @ game+0x9b44040
	void AppendHUDElementTags(struct FGameplayTagContainer& AdditionalTags); // Function FortniteUI.FortHUDElementWidget.AppendHUDElementTags // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9b43ebc
};

// Class FortniteUI.FortHoldableButton
// Size: 0x10b0 (Inherited: 0x1020)
struct UFortHoldableButton : UCommonButtonBase {
	bool bIsHoldableButton; // 0x1020(0x01)
	bool bBindHoldToAction; // 0x1021(0x01)
	bool bIgnoreLongPress; // 0x1022(0x01)
	char pad_1023[0x1]; // 0x1023(0x01)
	float HoldTime; // 0x1024(0x04)
	float StartingHoldPercentage; // 0x1028(0x04)
	float QualifyingHoldTime; // 0x102c(0x04)
	bool bHoldCancelledFromMovement; // 0x1030(0x01)
	char pad_1031[0x7]; // 0x1031(0x07)
	struct UCommonTextStyle* HoldPromptTextStyle; // 0x1038(0x08)
	char pad_1040[0x70]; // 0x1040(0x70)

	void SetEnableButtonHold(bool bInEnableButtonHold); // Function FortniteUI.FortHoldableButton.SetEnableButtonHold // (Final|Native|Public|BlueprintCallable) // @ game+0x9b400e0
	void OnHoldRequiredChanged(bool bHoldRequired); // Function FortniteUI.FortHoldableButton.OnHoldRequiredChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	bool GetIsHoldRequired(); // Function FortniteUI.FortHoldableButton.GetIsHoldRequired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b3f980
	struct UCommonTextStyle* GetHoldPromptTextStyle(); // Function FortniteUI.FortHoldableButton.GetHoldPromptTextStyle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b3f4d0
	void BP_OnHoldStarted(float HoldPercentage, bool bInUseSecondaryHoldAnimation); // Function FortniteUI.FortHoldableButton.BP_OnHoldStarted // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHoldReset(); // Function FortniteUI.FortHoldableButton.BP_OnHoldReset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHoldIncreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnHoldIncreased // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHoldEnded(float HoldPercentage, bool bInUseSecondaryHoldAnimation); // Function FortniteUI.FortHoldableButton.BP_OnHoldEnded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHoldDecreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnHoldDecreased // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHoldCompleted(); // Function FortniteUI.FortHoldableButton.BP_OnHoldCompleted // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnActionProgressIncreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnActionProgressIncreased // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnActionProgressDecreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnActionProgressDecreased // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortActivatablePanel
// Size: 0x568 (Inherited: 0x530)
struct UFortActivatablePanel : UCommonActivatablePanelLegacy {
	char pad_530[0x8]; // 0x530(0x08)
	bool bIsPushedOnToContentPanelStack; // 0x538(0x01)
	bool bIsAlreadyOnContentPanelStack; // 0x539(0x01)
	enum class EInputPriority InputPriority; // 0x53a(0x01)
	bool bIsClosableByPlayerInput; // 0x53b(0x01)
	struct FPrimaryContentSetup PrimaryContentSetup; // 0x53c(0x03)
	char pad_53F[0x29]; // 0x53f(0x29)

	void RestoreScrollWidget(struct UWidget* FallbackWidget); // Function FortniteUI.FortActivatablePanel.RestoreScrollWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x9b1ca80
	void RestoreCenterWidget(struct UWidget* FallbackWidget); // Function FortniteUI.FortActivatablePanel.RestoreCenterWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x9b1ca00
	void AsyncPlaySound2D(struct UObject* WorldContextObject, struct TSoftObjectPtr<USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x9b1bcf8
};

// Class FortniteUI.HUDWidgetBehavior
// Size: 0xb0 (Inherited: 0x28)
struct UHUDWidgetBehavior : UObject {
	struct FText HUDLayoutToolName; // 0x28(0x18)
	struct TArray<struct UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x40(0x10)
	struct TMap<struct FGameplayTag, struct FString> CustomPropertyDefaultOverrides; // 0x50(0x50)
	struct TArray<struct UFortMobileHUDWidgetBehaviorExtension*> BehaviorExtensions; // 0xa0(0x10)
};

// Class FortniteUI.FortMobileActionButtonBehavior
// Size: 0x110 (Inherited: 0xb0)
struct UFortMobileActionButtonBehavior : UHUDWidgetBehavior {
	struct TArray<struct FName> ActionNames; // 0xb0(0x10)
	struct UPaperSprite* Sprite; // 0xc0(0x08)
	struct FGameplayTag HUDLayoutToolSaveTag_Legacy; // 0xc8(0x04)
	char pad_CC[0x14]; // 0xcc(0x14)
	struct TArray<struct UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents; // 0xe0(0x10)
	struct TArray<struct UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides; // 0xf0(0x10)
	int32_t ForcedZOrder; // 0x100(0x04)
	char pad_104[0xc]; // 0x104(0x0c)
};

// Class FortniteUI.FortUIGameFeatureAction
// Size: 0x28 (Inherited: 0x28)
struct UFortUIGameFeatureAction : UGameFeatureAction {
};

// Class FortniteUI.FortGlobalSeasonResourceWidget
// Size: 0x2e0 (Inherited: 0x2e0)
struct UFortGlobalSeasonResourceWidget : UCommonUserWidget {
};

// Class FortniteUI.FortItemPreviewScreen
// Size: 0x6b8 (Inherited: 0x568)
struct UFortItemPreviewScreen : UFortActivatablePanel {
	char pad_568[0x10]; // 0x568(0x10)
	struct FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x578(0x10)
	struct FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x588(0x10)
	struct FDataTableRowHandle ItemViewZoomOutInputAction; // 0x598(0x10)
	struct FDataTableRowHandle ItemViewZoomInInputAction; // 0x5a8(0x10)
	struct FDataTableRowHandle ItemViewRotateInputAction; // 0x5b8(0x10)
	struct UWidgetAnimation* AnimationToHideItemInfo; // 0x5c8(0x08)
	bool bAutoShowDetails; // 0x5d0(0x01)
	bool bItemDetailsHidden; // 0x5d1(0x01)
	char pad_5D2[0x2]; // 0x5d2(0x02)
	float HideItemInfoHeaderDurationSecs; // 0x5d4(0x04)
	char pad_5D8[0x8]; // 0x5d8(0x08)
	bool bAllowItemRotation; // 0x5e0(0x01)
	bool bAllowItemZooming; // 0x5e1(0x01)
	enum class EFrontEndCamera FrontEndCamera; // 0x5e2(0x01)
	char pad_5E3[0x1]; // 0x5e3(0x01)
	struct FGameplayTag PreviewSceneChangerTag; // 0x5e4(0x04)
	struct FGameplayTag PreviewSceneChangerOverrideTag; // 0x5e8(0x04)
	char pad_5EC[0x4]; // 0x5ec(0x04)
	struct AFortItemPreviewSceneChanger* PreviewSceneChanger; // 0x5f0(0x08)
	struct UFortItemView* ItemViewObject; // 0x5f8(0x08)
	float CameraEntryTransitionDuration; // 0x600(0x04)
	char pad_604[0x4]; // 0x604(0x04)
	struct UCurveFloat* CameraEntryTransitionCurve; // 0x608(0x08)
	char pad_610[0x80]; // 0x610(0x80)
	struct UWidget* Widget_CameraFrame; // 0x690(0x08)
	struct UCommonButtonLegacy* Button_PreviewAction; // 0x698(0x08)
	struct UCommonButtonBase* Button_Camera; // 0x6a0(0x08)
	struct UCommonActivatableWidget* OverrideFocusWidget; // 0x6a8(0x08)
	struct UFortItemDownloadIndicator* ItemDownloadIndicator; // 0x6b0(0x08)

	void ShowItemDetails(); // Function FortniteUI.FortItemPreviewScreen.ShowItemDetails // (Final|Native|Public|BlueprintCallable) // @ game+0x9b539c4
	void OnPreviewActionButtonUpdated(struct FText& RowDisplayName); // Function FortniteUI.FortItemPreviewScreen.OnPreviewActionButtonUpdated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void HideItemDetails(); // Function FortniteUI.FortItemPreviewScreen.HideItemDetails // (Final|Native|Public|BlueprintCallable) // @ game+0x9b526fc
};

// Class FortniteUI.BattlePassScreenBase
// Size: 0x888 (Inherited: 0x6b8)
struct UBattlePassScreenBase : UFortItemPreviewScreen {
	struct FDataTableRowHandle RefundGiftToken; // 0x6b8(0x10)
	char pad_6C8[0x8]; // 0x6c8(0x08)
	struct TSoftClassPtr<UObject> SeasonLevelPurchaseScreenClass; // 0x6d0(0x28)
	struct TSoftClassPtr<UObject> SeasonAboutScreenClass; // 0x6f8(0x28)
	struct FGameplayTagContainer WrapPreviewExcludedTags; // 0x720(0x20)
	enum class EBattlePassView CurrentView; // 0x740(0x01)
	char pad_741[0x7]; // 0x741(0x07)
	struct UAthenaSeasonItemDefinition* SeasonData; // 0x748(0x08)
	struct AFortItemPreviewWorld* CachedVaultWorld; // 0x750(0x08)
	struct UFortAccountItemDefinition* LastViewedItem; // 0x758(0x08)
	char pad_760[0xd4]; // 0x760(0xd4)
	bool bShouldShowAboutModalInNewSeason; // 0x834(0x01)
	char pad_835[0x1b]; // 0x835(0x1b)
	struct TSoftClassPtr<UObject> SeasonMovieWidgetClass; // 0x850(0x28)
	struct UFortStreamMediaSource* VideoStream_Source; // 0x878(0x08)
	struct UCommonTextBlock* Text_DebugPreviewDetails; // 0x880(0x08)

	bool ShouldPlayBPVideo(bool bAllowUpdate); // Function FortniteUI.BattlePassScreenBase.ShouldPlayBPVideo // (Final|Native|Public|BlueprintCallable) // @ game+0x67ac6b0
	void OnViewReward(struct FFortRarityItemData Rarity, bool bNoReward, struct UFortItemDefinition* RewardItem); // Function FortniteUI.BattlePassScreenBase.OnViewReward // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnVariantUpdate(int32_t CurrentIndex, int32_t TotalNumVariants); // Function FortniteUI.BattlePassScreenBase.OnVariantUpdate // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSetPurchasedAnnualPass(bool bIsPurchased); // Function FortniteUI.BattlePassScreenBase.OnSetPurchasedAnnualPass // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSetDifferentBPText(); // Function FortniteUI.BattlePassScreenBase.OnSetDifferentBPText // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnRequestViewRewardComplete(); // Function FortniteUI.BattlePassScreenBase.OnRequestViewRewardComplete // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnRequestViewReward(); // Function FortniteUI.BattlePassScreenBase.OnRequestViewReward // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnNoCurrentSeason(); // Function FortniteUI.BattlePassScreenBase.OnNoCurrentSeason // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBattlePassViewChanged(enum class EBattlePassView NewView); // Function FortniteUI.BattlePassScreenBase.OnBattlePassViewChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	int32_t GetNumberOfRewardsToPurchase(); // Function FortniteUI.BattlePassScreenBase.GetNumberOfRewardsToPurchase // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b1185c
};

// Class FortniteUI.FortActorIndicatorWidget
// Size: 0x3c0 (Inherited: 0x320)
struct UFortActorIndicatorWidget : UFortHUDElementWidget {
	char pad_320[0x8]; // 0x320(0x08)
	struct AActor* IndicatedActor; // 0x328(0x08)
	struct UPrimitiveComponent* IndicatedActorComponent; // 0x330(0x08)
	struct FVector RelativeLocation; // 0x338(0x18)
	float MaxDistance; // 0x350(0x04)
	bool bClampOnScreen; // 0x354(0x01)
	bool bShowClampToScreenArrow; // 0x355(0x01)
	char pad_356[0x2]; // 0x356(0x02)
	struct FElevationArrowData ElevationArrowData; // 0x358(0x1c)
	bool bUseScreenSpacePosition; // 0x374(0x01)
	char pad_375[0x3]; // 0x375(0x03)
	struct FVector2D ScreenSpaceRelativeOffset; // 0x378(0x10)
	int32_t ScreenPriority; // 0x388(0x04)
	char pad_38C[0x34]; // 0x38c(0x34)

	void SetIndicatedActor(struct AActor* NewIndicatorActor); // Function FortniteUI.FortActorIndicatorWidget.SetIndicatedActor // (Native|Public|BlueprintCallable) // @ game+0x20caeb8
	void OnTargetActorChanged(struct AActor* TargetedActor); // Function FortniteUI.FortActorIndicatorWidget.OnTargetActorChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	bool IsIndicatingActor(struct AActor* OtherActor); // Function FortniteUI.FortActorIndicatorWidget.IsIndicatingActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b1ded8
	void Init(struct AActor* TargetedActor); // Function FortniteUI.FortActorIndicatorWidget.Init // (Native|Public|BlueprintCallable) // @ game+0x9b1ddd8
	void Deinit(); // Function FortniteUI.FortActorIndicatorWidget.Deinit // (Native|Public|BlueprintCallable) // @ game+0x9b1d2e4
};

// Class FortniteUI.FortRadialSlot
// Size: 0x10c0 (Inherited: 0x1070)
struct UFortRadialSlot : UCommonButtonLegacy {
	char pad_1070[0x10]; // 0x1070(0x10)
	struct UCommonLazyImage* Image_Icon; // 0x1080(0x08)
	struct UCommonTextBlock* Text_Main; // 0x1088(0x08)
	struct UWidget* Overlay_EquippedItem; // 0x1090(0x08)
	struct TSoftObjectPtr<UTexture2D> LockedTexture; // 0x1098(0x28)
};

// Class FortniteUI.FortRadialPickerEntry
// Size: 0x10d0 (Inherited: 0x10c0)
struct UFortRadialPickerEntry : UFortRadialSlot {
	struct UHorizontalBox* HorizontalBox_EntryName; // 0x10c0(0x08)
	char pad_10C8[0x8]; // 0x10c8(0x08)

	void OnAvailabilityChanged(bool bIsAvailable); // Function FortniteUI.FortRadialPickerEntry.OnAvailabilityChanged // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortAthenaVehicleDashboardWidget
// Size: 0x488 (Inherited: 0x320)
struct UFortAthenaVehicleDashboardWidget : UFortHUDElementWidget {
	char pad_320[0xe4]; // 0x320(0xe4)
	bool bIsWidgetShowing; // 0x404(0x01)
	char pad_405[0x3]; // 0x405(0x03)
	struct AFortAthenaVehicle* CurrentVehicleActor; // 0x408(0x08)
	float CurrentSpeed; // 0x410(0x04)
	float TargetFuelPercent; // 0x414(0x04)
	float DisplayedFuelPercent; // 0x418(0x04)
	float FillBlendSpeed; // 0x41c(0x04)
	float SpeedTextMaxInterpolationRate; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FGameplayTagContainer WidgetTagsToHideWhenVisible; // 0x428(0x20)
	char pad_448[0x4]; // 0x448(0x04)
	float HUDTopSpeed; // 0x44c(0x04)
	enum class EHorizontalAlignment MobileFuelGaugeHorizontalAlignment; // 0x450(0x01)
	enum class EVerticalAlignment MobileFuelGaugeVerticalAlignment; // 0x451(0x01)
	char pad_452[0x2]; // 0x452(0x02)
	struct FMargin MobileFuelGaugePadding; // 0x454(0x10)
	char pad_464[0x4]; // 0x464(0x04)
	struct UCommonNumericTextBlock* NumericText_Speed; // 0x468(0x08)
	struct UOverlay* Overlay_Gauge; // 0x470(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void UpdateSpeedometer(float NormalizedSpeed, float RawSpeed); // Function FortniteUI.FortAthenaVehicleDashboardWidget.UpdateSpeedometer // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void ShowNoFuelMessage(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.ShowNoFuelMessage // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void SetVehicleUsesRechargableBoost(bool bUsesRechargeableBoost); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetVehicleUsesRechargableBoost // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetVehicleHasInfiniteFuel // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void SetupVehicleFuelWidget(struct AActor* NewVehicle, bool bRequestShowWidget); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetupVehicleFuelWidget // (RequiredAPI|Native|Public) // @ game+0x9b222f8
	void OnWidgetVisibilityChanged(bool bNewVisibility); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnWidgetVisibilityChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnUpdateRechargeableBoostPercent(float BoostPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnUpdateRechargeableBoostPercent // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnUpdateBoostChargePercent(float BoostPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnUpdateBoostChargePercent // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnRPMChanged(float NormalizedRPM); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnRPMChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnRechargableBoostFilled(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnRechargableBoostFilled // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerFacingNameUpdated(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnPlayerFacingNameUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOutOfFuel(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnOutOfFuel // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnLowFuel(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnLowFuel // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnFuelValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBoostStarted(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostStarted // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBoostFinished(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostFinished // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBoostChargeFilled(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostChargeFilled // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnAddedFuel(float NewFuelPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnAddedFuel // (Final|Native|Public) // @ game+0x9b2221c
	struct AFortAthenaVehicle* GetVehicle(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.GetVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b22204
	float GetHUDTopSpeed(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.GetHUDTopSpeed // (RequiredAPI|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b221d8
	void BP_HandleExtensionWidgetCreated(struct UUserWidget* Widget, enum class EUIExtensionSlot SlotType); // Function FortniteUI.FortAthenaVehicleDashboardWidget.BP_HandleExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.PostGamePlacementOverlay
// Size: 0x340 (Inherited: 0x320)
struct UPostGamePlacementOverlay : UFortHUDElementWidget {
	struct AFortGameplayMutator* MutatorClassToWaitFor; // 0x320(0x08)
	char pad_328[0x18]; // 0x328(0x18)

	void ShowWinningPlacement(); // Function FortniteUI.PostGamePlacementOverlay.ShowWinningPlacement // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void ShowTiePlacement(); // Function FortniteUI.PostGamePlacementOverlay.ShowTiePlacement // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void ShowLosingPlacement(); // Function FortniteUI.PostGamePlacementOverlay.ShowLosingPlacement // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void LocalPlacementChanged(); // Function FortniteUI.PostGamePlacementOverlay.LocalPlacementChanged // (Final|Native|Protected) // @ game+0x9b98228
	bool GetShouldShow(); // Function FortniteUI.PostGamePlacementOverlay.GetShouldShow // (RequiredAPI|Native|Public) // @ game+0x6932740
};

// Class FortniteUI.FortWeaponReticleExtensionWidgetBase
// Size: 0x330 (Inherited: 0x320)
struct UFortWeaponReticleExtensionWidgetBase : UFortHUDElementWidget {
	struct AFortWeapon* CachedAssociatedWeapon; // 0x320(0x08)
	char pad_328[0x8]; // 0x328(0x08)

	void OnWeaponSingleFire(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponSingleFire // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnWeaponReloadCancelled(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponReloadCancelled // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnTargetingChanged(bool bIsADS); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFullyExitVehicle(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnFullyExitVehicle // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleTargetingChanged(bool bNewIsADS); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleTargetingChanged // (Final|Native|Protected) // @ game+0x9b917f8
	void HandleFullyExitVehicle(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleFullyExitVehicle // (Final|Native|Private) // @ game+0x9b91640
	void HandleEnterVehiclePassenger(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleEnterVehiclePassenger // (Final|Native|Private) // @ game+0x9b91624
	void HandleEnterVehicleDriver(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleEnterVehicleDriver // (Final|Native|Private) // @ game+0x9b91608
	bool GetIsADS(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.GetIsADS // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b915dc
	struct AFortWeapon* GetEquippedWeapon(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.GetEquippedWeapon // (Final|RequiredAPI|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b915b8
};

// Class FortniteUI.FortMobileHUDWidgetBehaviorExtension
// Size: 0x40 (Inherited: 0x28)
struct UFortMobileHUDWidgetBehaviorExtension : UObject {
	struct TArray<struct UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x28(0x10)
	struct UHUDWidgetBehavior* OwnerWidgetBehavior; // 0x38(0x08)
};

// Class FortniteUI.FortMobileActionButtonBehaviorExtension
// Size: 0x70 (Inherited: 0x40)
struct UFortMobileActionButtonBehaviorExtension : UFortMobileHUDWidgetBehaviorExtension {
	struct TArray<struct FName> ActionNames; // 0x40(0x10)
	struct TArray<struct UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents; // 0x50(0x10)
	struct TArray<struct UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides; // 0x60(0x10)
};

// Class FortniteUI.AthenaQuickBarSlotButtonBase
// Size: 0x1030 (Inherited: 0x1020)
struct UAthenaQuickBarSlotButtonBase : UCommonButtonBase {
	enum class EFortQuickBars QuickbarIndex; // 0x1020(0x01)
	char pad_1021[0x3]; // 0x1021(0x03)
	int32_t SlotIndex; // 0x1024(0x04)
	struct UAthenaItemIcon* ItemIcon; // 0x1028(0x08)

	void OnSlottedItemChanged(struct UFortItem* SlottedItem); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnSlottedItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerDeactivated(); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerActivated(); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnOwnerActivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleQuickbarContentsChanged(enum class EFortQuickBars InQuickBarIndex, struct TArray<int32_t>& ChangedSlots); // Function FortniteUI.AthenaQuickBarSlotButtonBase.HandleQuickbarContentsChanged // (Final|Native|Private|HasOutParms) // @ game+0x9b05548
	void HandleInventoryItemSelected(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaQuickBarSlotButtonBase.HandleInventoryItemSelected // (Final|Native|Private) // @ game+0x9b054a0
};

// Class FortniteUI.AthenaQuickBarSlotExtensionWidgetBase
// Size: 0x2e8 (Inherited: 0x2e0)
struct UAthenaQuickBarSlotExtensionWidgetBase : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void OnOwnerUnhovered(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerUnhovered // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerSelected(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerSelected // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerHovered(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerHovered // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerDeselected(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerDeselected // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerDeactivated(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOwnerActivated(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerActivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnItemChanged(struct UFortItem* Item); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortGameSettingRegistryExtension
// Size: 0x28 (Inherited: 0x28)
struct UFortGameSettingRegistryExtension : UFortGameSettingRegistryExtensionBase {
};

// Class FortniteUI.CMSBackgroundWidget
// Size: 0x438 (Inherited: 0x3f8)
struct UCMSBackgroundWidget : UCommonActivatableWidget {
	char pad_3F8[0x18]; // 0x3f8(0x18)
	float OlderBackgroundStreamoutSeconds; // 0x410(0x04)
	bool bDeactivateOnClose; // 0x414(0x01)
	char pad_415[0x3]; // 0x415(0x03)
	struct UImage* Image_Background; // 0x418(0x08)
	struct UCommonButtonBase* Button_Close; // 0x420(0x08)
	struct UCommonButtonBase* Button_MobileClose; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)

	void OnStartingDownloadBackground(); // Function FortniteUI.CMSBackgroundWidget.OnStartingDownloadBackground // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDownloadBackgroundComplete(struct UTexture2D* NewBackground); // Function FortniteUI.CMSBackgroundWidget.OnDownloadBackgroundComplete // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortStandaloneFrontend
// Size: 0x620 (Inherited: 0x3f8)
struct UFortStandaloneFrontend : UCommonActivatableWidget {
	char pad_3F8[0x10]; // 0x3f8(0x10)
	bool bCosmeticRefreshOnClose; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	float DelayCloseActionTimeSeconds; // 0x40c(0x04)
	struct UFortPocketLevel* PocketLevel; // 0x410(0x08)
	struct UPocketLevelInstance* PocketLevelInstance; // 0x418(0x08)
	struct FVector CameraLevelLocation; // 0x420(0x18)
	struct FDataTableRowHandle BackActionRowHandle; // 0x438(0x10)
	struct UCommonWidgetSwitcherLegacy* Switcher_TabContent; // 0x448(0x08)
	struct UWidget* Content_LoadingIndicator; // 0x450(0x08)
	char pad_458[0x10]; // 0x458(0x10)
	bool bCloseOnDelayEnd; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct FFortAthenaLoadout InitialLoadoutData; // 0x470(0x168)
	struct UCommonButtonBase* Button_CloseMobile; // 0x5d8(0x08)
	struct FMulticastInlineDelegate OnMenuClosed; // 0x5e0(0x10)
	char pad_5F0[0x10]; // 0x5f0(0x10)
	struct FPrimaryContentSetup PrimaryContentSetup; // 0x600(0x03)
	char pad_603[0x1d]; // 0x603(0x1d)

	void TriggerIncrementalGC(); // Function FortniteUI.FortStandaloneFrontend.TriggerIncrementalGC // (Final|Native|Static|Protected|BlueprintCallable) // @ game+0x9b76828
	void OnLoadingIndicatorShown(bool bShown); // Function FortniteUI.FortStandaloneFrontend.OnLoadingIndicatorShown // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnCameraLevelLoaded(); // Function FortniteUI.FortStandaloneFrontend.OnCameraLevelLoaded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBeginLoadingCameraLevel(); // Function FortniteUI.FortStandaloneFrontend.OnBeginLoadingCameraLevel // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleCloseRefreshComplete(struct AFortPlayerPawn* FortPawn); // Function FortniteUI.FortStandaloneFrontend.HandleCloseRefreshComplete // (Final|Native|Private) // @ game+0x9b75ae0
	void HandleCloseAction(); // Function FortniteUI.FortStandaloneFrontend.HandleCloseAction // (Final|RequiredAPI|Native|Protected|BlueprintCallable) // @ game+0x9b75acc
};

// Class FortniteUI.FortActivityView
// Size: 0x448 (Inherited: 0x3f8)
struct UFortActivityView : UCommonActivatableWidget {
	char pad_3F8[0x50]; // 0x3f8(0x50)

	void BP_OnPartySizeChanged(int32_t PartySize); // Function FortniteUI.FortActivityView.BP_OnPartySizeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnLocalPlayerPromotedToLeader(); // Function FortniteUI.FortActivityView.BP_OnLocalPlayerPromotedToLeader // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnLocalPlayerDemoted(); // Function FortniteUI.FortActivityView.BP_OnLocalPlayerDemoted // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortTabButton
// Size: 0x1050 (Inherited: 0x1020)
struct UFortTabButton : UCommonButtonBase {
	char pad_1020[0x8]; // 0x1020(0x08)
	struct UCommonLazyImage* LazyImage_Icon; // 0x1028(0x08)
	struct UCommonTextBlock* Text_Title; // 0x1030(0x08)
	struct FVector2D ImageSize_Mobile; // 0x1038(0x10)
	char pad_1048[0x8]; // 0x1048(0x08)

	void SetTabLabelInfo_Implementation(struct FFortTabButtonLabelInfo& TabLabelInfo); // Function FortniteUI.FortTabButton.SetTabLabelInfo_Implementation // (RequiredAPI|Native|Protected|HasOutParms) // @ game+0x9b7fdf4
};

// Class FortniteUI.FortMobileHUDElement
// Size: 0x348 (Inherited: 0x320)
struct UFortMobileHUDElement : UFortHUDElementWidget {
	struct FGameplayTag SizePropertyTag; // 0x320(0x04)
	char pad_324[0x14]; // 0x324(0x14)
	int32_t ForcedZOrder; // 0x338(0x04)
	char pad_33C[0x4]; // 0x33c(0x04)
	struct UScaleBox* ScaleBox_HUDWidgetScale; // 0x340(0x08)
};

// Class FortniteUI.BacchusHUDElement
// Size: 0x368 (Inherited: 0x348)
struct UBacchusHUDElement : UFortMobileHUDElement {
	bool bHideWhenNotUsingTouch; // 0x348(0x01)
	bool bUpdatesWithHUDState; // 0x349(0x01)
	bool bAlwaysShow; // 0x34a(0x01)
	enum class EBacchusHUDStateType OnInBuildMode; // 0x34b(0x01)
	enum class EBacchusHUDStateType OnInCombatMode; // 0x34c(0x01)
	enum class EBacchusHUDStateType OnInEditMode; // 0x34d(0x01)
	enum class EBacchusHUDStateType OnInCreativeMode; // 0x34e(0x01)
	enum class EBacchusHUDStateType OnInBattleLabMode; // 0x34f(0x01)
	enum class EBacchusHUDStateType isFreeFalling; // 0x350(0x01)
	enum class EBacchusHUDStateType IsGliding; // 0x351(0x01)
	enum class EBacchusHUDStateType CanOpenChute; // 0x352(0x01)
	enum class EBacchusHUDStateType InLockedBus; // 0x353(0x01)
	enum class EBacchusHUDStateType InUnlockedBus; // 0x354(0x01)
	enum class EBacchusHUDStateType OnTargeting; // 0x355(0x01)
	enum class EBacchusHUDStateType OnUsingScopeTargeting; // 0x356(0x01)
	enum class EBacchusHUDStateType OnCanTarget; // 0x357(0x01)
	enum class EBacchusHUDStateType OnCanUseScopeTargeting; // 0x358(0x01)
	enum class EBacchusHUDStateType OnCrouching; // 0x359(0x01)
	enum class EBacchusHUDStateType OnCanUseSecondaryAbility; // 0x35a(0x01)
	enum class EBacchusHUDStateType OnDBNO; // 0x35b(0x01)
	enum class EBacchusHUDStateType OnCarryingDBNO; // 0x35c(0x01)
	enum class EBacchusHUDStateType OnCarryingHeldObject; // 0x35d(0x01)
	enum class EBacchusHUDStateType OnImprovedDBNO; // 0x35e(0x01)
	enum class EBacchusHUDStateType OnControllingRCPawn; // 0x35f(0x01)
	enum class EBacchusHUDStateType OnInVehicle; // 0x360(0x01)
	enum class EBacchusHUDStateType OnDrivingVehicle; // 0x361(0x01)
	enum class EBacchusHUDStateType OnZiplining; // 0x362(0x01)
	char pad_363[0x5]; // 0x363(0x05)

	void ShowHighlight(bool Show); // Function FortniteUI.BacchusHUDElement.ShowHighlight // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnHUDStateUpdate(struct FFortHUDState& NewState); // Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x9b0f200
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType); // Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged // (Final|Native|Protected) // @ game+0x9b0ec10
};

// Class FortniteUI.BacchusButton
// Size: 0x3e0 (Inherited: 0x368)
struct UBacchusButton : UBacchusHUDElement {
	struct UPaperSprite* DefaultIcon; // 0x368(0x08)
	struct FLinearColor PressedColor; // 0x370(0x10)
	struct FLinearColor UnpressedColor; // 0x380(0x10)
	enum class EButtonClickMethod ClickMethod; // 0x390(0x01)
	enum class EButtonTouchMethod TouchMethod; // 0x391(0x01)
	char pad_392[0x2]; // 0x392(0x02)
	float ButtonSize; // 0x394(0x04)
	float ButtonDisplayScale; // 0x398(0x04)
	bool ShowRadialProgress; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	struct FGameplayTag ListenedGamePlayTag; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct UImage* Image_Background; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct USizeBox* SizeBox_ButtonSize; // 0x3b8(0x08)
	struct USizeBox* SizeBox_ImageSize; // 0x3c0(0x08)
	struct UImage* Image_Icon; // 0x3c8(0x08)
	struct URadialBacchusButtonBase* RadialButton_ButtonCooldown; // 0x3d0(0x08)
	struct UButton* Button_InternalButton; // 0x3d8(0x08)

	void SetIconPressed(bool bIsPressed); // Function FortniteUI.BacchusButton.SetIconPressed // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b0f91c
	void SetDefaultIcon(struct UPaperSprite* Icon); // Function FortniteUI.BacchusButton.SetDefaultIcon // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b0f8a0
	void SetButtonSprite(struct UPaperSprite* NewSprite); // Function FortniteUI.BacchusButton.SetButtonSprite // (RequiredAPI|Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x9b0f81c
	void SetButtonSize(float NewButtonSize); // Function FortniteUI.BacchusButton.SetButtonSize // (RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x9b0f794
	void SetButtonDisplayScale(float NewDisplayScale); // Function FortniteUI.BacchusButton.SetButtonDisplayScale // (RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x9b0f70c
	void OnClicked(); // Function FortniteUI.BacchusButton.OnClicked // (RequiredAPI|Native|Event|Protected|BlueprintEvent) // @ game+0x74b4f00
	void HandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.BacchusButton.HandleCursorModeChanged // (Final|Native|Private) // @ game+0x9b0e540
};

// Class FortniteUI.BacchusActionButton
// Size: 0x428 (Inherited: 0x3e0)
struct UBacchusActionButton : UBacchusButton {
	struct TArray<struct FBacchusActionIconMapping> ActionMapping; // 0x3e0(0x10)
	struct FName TempActionMapping; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	struct TArray<struct FGameplayTag> ItemsAllowingClickThrough; // 0x3f8(0x10)
	bool bCapturesInput; // 0x408(0x01)
	char pad_409[0x1f]; // 0x409(0x1f)

	void OnCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.BacchusActionButton.OnCursorModeChanged // (Final|Native|Protected) // @ game+0x27add34
	void AddActionMappings(struct TArray<struct FBacchusActionIconMapping> NewActionMappings); // Function FortniteUI.BacchusActionButton.AddActionMappings // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b0e25c
};

// Class FortniteUI.FortUIGameFeatureAction_PostFrontendFlowActions
// Size: 0x30 (Inherited: 0x28)
struct UFortUIGameFeatureAction_PostFrontendFlowActions : UFortUIGameFeatureAction {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class FortniteUI.FortMainMenuButton
// Size: 0x11a0 (Inherited: 0x1070)
struct UFortMainMenuButton : UCommonButtonLegacy {
	struct FText DefaultText; // 0x1070(0x18)
	char pad_1088[0x8]; // 0x1088(0x08)
	struct FSlateBrush DefaultBrush; // 0x1090(0xc0)
	int32_t NormalButtonHeight; // 0x1150(0x04)
	int32_t MobileButtonHeight; // 0x1154(0x04)
	struct FMargin TextPadding; // 0x1158(0x10)
	struct FMargin ContentPadding; // 0x1168(0x10)
	struct UCommonButtonStyle* MobileStyle; // 0x1178(0x08)
	struct UCommonTextBlock* Text_Content; // 0x1180(0x08)
	struct UImage* Image_Icon; // 0x1188(0x08)
	struct UBorder* ContentBorder; // 0x1190(0x08)
	char pad_1198[0x8]; // 0x1198(0x08)

	void SetText(struct FText& InText); // Function FortniteUI.FortMainMenuButton.SetText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x5066c60
};

// Class FortniteUI.FortMainMenuButtonExtension
// Size: 0x11a0 (Inherited: 0x11a0)
struct UFortMainMenuButtonExtension : UFortMainMenuButton {
	struct UCommonActivatableWidget* SidebarPanelToActivate; // 0x1198(0x08)
};

// Class FortniteUI.FortSettingDetailExtension
// Size: 0x2c0 (Inherited: 0x2b8)
struct UFortSettingDetailExtension : UUserWidget {
	struct UFortSetting* Setting; // 0x2b8(0x08)

	bool UseSplitDisabledOptionsVisual(); // Function FortniteUI.FortSettingDetailExtension.UseSplitDisabledOptionsVisual // (Final|Native|Public|BlueprintCallable) // @ game+0x222eeb8
	void OnSettingValueChanged(struct UFortSetting* InSetting); // Function FortniteUI.FortSettingDetailExtension.OnSettingValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSettingAssigned(struct UFortSetting* InSetting); // Function FortniteUI.FortSettingDetailExtension.OnSettingAssigned // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	struct FText GetOptionsDisabledText(struct TArray<struct FText>& Reasons); // Function FortniteUI.FortSettingDetailExtension.GetOptionsDisabledText // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b69dcc
};

// Class FortniteUI.FortPortalHUDDetails
// Size: 0x3f8 (Inherited: 0x3c0)
struct UFortPortalHUDDetails : UFortActorIndicatorWidget {
	char pad_3C0[0x8]; // 0x3c0(0x08)
	struct UAthenaMarkerPointer* MarkerPointer; // 0x3c8(0x08)
	char pad_3D0[0x20]; // 0x3d0(0x20)
	struct UCommonActivatableWidgetSwitcher* MobileInfo_Matchmaking_Switcher; // 0x3f0(0x08)

	void SetCachedWorldPos(struct FVector InWorldPos); // Function FortniteUI.FortPortalHUDDetails.SetCachedWorldPos // (Final|RequiredAPI|Native|Protected|HasDefaults|BlueprintCallable) // @ game+0x9b61f54
	void SetActiveMatchmakingTextIndex(int32_t newIndex); // Function FortniteUI.FortPortalHUDDetails.SetActiveMatchmakingTextIndex // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b61ed0
	void SetActiveContextInfo(struct UFortInteractContextInfo* ActiveContextInfo); // Function FortniteUI.FortPortalHUDDetails.SetActiveContextInfo // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b61e50
	void HandleMatchmakingComplete(bool Success); // Function FortniteUI.FortPortalHUDDetails.HandleMatchmakingComplete // (Final|Native|Protected) // @ game+0x9b61bc8
	struct UFortInteractContextInfo* GetActiveContextInfo(); // Function FortniteUI.FortPortalHUDDetails.GetActiveContextInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x9b61b50
	void ClearCachedWorldPos(); // Function FortniteUI.FortPortalHUDDetails.ClearCachedWorldPos // (Final|RequiredAPI|Native|Protected|BlueprintCallable) // @ game+0x9b61b38
};

// Class FortniteUI.FortPopupMenu
// Size: 0x550 (Inherited: 0x548)
struct UFortPopupMenu : UCommonPopupMenuLegacy {
	char pad_548[0x8]; // 0x548(0x08)
};

// Class FortniteUI.FortItemPickerBase
// Size: 0x420 (Inherited: 0x2e0)
struct UFortItemPickerBase : UCommonUserWidget {
	struct FMulticastInlineDelegate OnSelectionChangedEvent; // 0x2e0(0x10)
	char pad_2F0[0x18]; // 0x2f0(0x18)
	struct FMulticastInlineDelegate OnSelectionCommittedEvent; // 0x308(0x10)
	char pad_318[0x48]; // 0x318(0x48)
	struct FMulticastInlineDelegate OnItemHoveredEvent; // 0x360(0x10)
	char pad_370[0x18]; // 0x370(0x18)
	struct FMulticastInlineDelegate OnItemUnhovered; // 0x388(0x10)
	char pad_398[0x18]; // 0x398(0x18)
	struct UFortItemTileView* PickerTileView; // 0x3b0(0x08)
	struct UListView* ItemListViewWidget; // 0x3b8(0x08)
	char pad_3C0[0x10]; // 0x3c0(0x10)
	bool bConfirmSelectionIfAlreadySelectedAfterOneClick; // 0x3d0(0x01)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	struct UObject* CurrentSelectedItem; // 0x3d8(0x08)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x3e0(0x10)
	char pad_3F0[0x30]; // 0x3f0(0x30)

	bool TryCommitSelectedItem(); // Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b518e8
	void SetSelectedItem(struct UFortItem* ItemToSelect); // Function FortniteUI.FortItemPickerBase.SetSelectedItem // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b51800
	bool SetSelectedIndex(int32_t Index); // Function FortniteUI.FortItemPickerBase.SetSelectedIndex // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b51774
	void OnItemSelectionScriptDelegate__DelegateSignature(struct UFortItem* SelectedItem); // DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionScriptDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	bool IsNullItemExplicitlySelected(); // Function FortniteUI.FortItemPickerBase.IsNullItemExplicitlySelected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b515d0
	struct UFortItem* GetSelectedItem(); // Function FortniteUI.FortItemPickerBase.GetSelectedItem // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b51124
	struct TScriptInterface<IFortItemListViewInterface> GetListViewInterface(); // Function FortniteUI.FortItemPickerBase.GetListViewInterface // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b510bc
	int32_t GetIndexForItem(struct UFortItem* Item); // Function FortniteUI.FortItemPickerBase.GetIndexForItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b50fdc
	void ClearSelection(); // Function FortniteUI.FortItemPickerBase.ClearSelection // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b50f94
	void CenterSelectedItemTileWidget(); // Function FortniteUI.FortItemPickerBase.CenterSelectedItemTileWidget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b50f28
	bool CanItemBeComitted(struct UFortItem* ItemToCommit); // Function FortniteUI.FortItemPickerBase.CanItemBeComitted // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b50e98
};

// Class FortniteUI.FortMtxStoreRootBase
// Size: 0x5f0 (Inherited: 0x568)
struct UFortMtxStoreRootBase : UFortActivatablePanel {
	char pad_568[0x8]; // 0x568(0x08)
	struct UFortMtxStoreSelectionPopup* MtxStoreSelectionWidget; // 0x570(0x08)
	struct UFortMtxStoreSelectionPopup* MtxStoreSelectionClass; // 0x578(0x08)
	char pad_580[0x10]; // 0x580(0x10)
	struct TArray<struct UFortStoreFrontOfferInfo*> AcquisitionOfferData; // 0x590(0x10)
	char pad_5A0[0x18]; // 0x5a0(0x18)
	struct TArray<struct FString> StorefrontNames; // 0x5b8(0x10)
	char pad_5C8[0x28]; // 0x5c8(0x28)

	void SetStorefrontNames(struct TArray<struct FString>& InStorefrontNames); // Function FortniteUI.FortMtxStoreRootBase.SetStorefrontNames // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9b5c158
	void PushStoreSelection(); // Function FortniteUI.FortMtxStoreRootBase.PushStoreSelection // (Final|Native|Protected) // @ game+0x21ce454
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, struct FText& CurrencyMessageLocText); // Function FortniteUI.FortMtxStoreRootBase.OnUpdateOtherPlatformMTXMessage // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnStartReadingOffers(); // Function FortniteUI.FortMtxStoreRootBase.OnStartReadingOffers // (Native|Event|Protected|BlueprintEvent) // @ game+0x67d1e30
	void OnPurchasingDisabled(); // Function FortniteUI.FortMtxStoreRootBase.OnPurchasingDisabled // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnOffersGenerated(); // Function FortniteUI.FortMtxStoreRootBase.OnOffersGenerated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void NoOffersAvailable(); // Function FortniteUI.FortMtxStoreRootBase.NoOffersAvailable // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	struct TArray<struct FString> GetStorefrontNames(); // Function FortniteUI.FortMtxStoreRootBase.GetStorefrontNames // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b5b388
	struct FMtxBreakdown GetMtxBreakdown(); // Function FortniteUI.FortMtxStoreRootBase.GetMtxBreakdown // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b5b220
	void GenerateOfferWidget(struct UFortStoreFrontOfferInfo* OfferData); // Function FortniteUI.FortMtxStoreRootBase.GenerateOfferWidget // (Native|Event|Protected|BlueprintEvent) // @ game+0x693444c
	void ClearOfferWidgets(); // Function FortniteUI.FortMtxStoreRootBase.ClearOfferWidgets // (Native|Event|Protected|BlueprintEvent) // @ game+0x642f33c
	bool AreOffersLoaded(); // Function FortniteUI.FortMtxStoreRootBase.AreOffersLoaded // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b5b15c
};

// Class FortniteUI.FortActivatablePanelWithItemPreview
// Size: 0x6b0 (Inherited: 0x568)
struct UFortActivatablePanelWithItemPreview : UFortActivatablePanel {
	char pad_568[0x8]; // 0x568(0x08)
	struct UFortItemView* ItemViewObject; // 0x570(0x08)
	struct FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x578(0x10)
	struct FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x588(0x10)
	struct FDataTableRowHandle ItemViewZoomOutInputAction; // 0x598(0x10)
	struct FDataTableRowHandle ItemViewZoomInInputAction; // 0x5a8(0x10)
	struct FDataTableRowHandle ItemViewRotateInputAction; // 0x5b8(0x10)
	char pad_5C8[0xb0]; // 0x5c8(0xb0)
	bool AllowItemRotation; // 0x678(0x01)
	bool AllowItemZooming; // 0x679(0x01)
	bool AutomaticallyRegisterCameraView; // 0x67a(0x01)
	bool OverrideFixedCameras; // 0x67b(0x01)
	char pad_67C[0x4]; // 0x67c(0x04)
	struct UDataTable* ActionDataTable; // 0x680(0x08)
	struct UWidgetAnimation* AnimationToHideItemInfo; // 0x688(0x08)
	bool bAutoShowDetails; // 0x690(0x01)
	bool bItemDetailsHidden; // 0x691(0x01)
	char pad_692[0x2]; // 0x692(0x02)
	float HideItemInfoHeaderDurationSecs; // 0x694(0x04)
	char pad_698[0x18]; // 0x698(0x18)

	void ShowItemDetails(); // Function FortniteUI.FortActivatablePanelWithItemPreview.ShowItemDetails // (Final|Native|Private|BlueprintCallable) // @ game+0x9b1cb00
	void OnVaultItemsViewed(struct TArray<struct UFortItem*>& Items); // Function FortniteUI.FortActivatablePanelWithItemPreview.OnVaultItemsViewed // (Final|Native|Private|HasOutParms) // @ game+0x9b1c964
	void OnItemPreviewChanged(struct AActor* NewPrefab, struct UFortItem* NewItem); // Function FortniteUI.FortActivatablePanelWithItemPreview.OnItemPreviewChanged // (Final|Native|Protected) // @ game+0x9b1c88c
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c7fc
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c76c
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c6dc
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c64c
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c5bc
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c52c
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c49c
	void (bool& bPassThrough); // Function FortniteUI.FortActivatablePanelWithItemPreview. // (Final|Native|Protected|HasOutParms) // @ game+0x9b1c40c
	void HideItemDetails(); // Function FortniteUI.FortActivatablePanelWithItemPreview.HideItemDetails // (Final|Native|Private|BlueprintCallable) // @ game+0x9b1c19c
	struct UWidget* GetWidgetForFramingViewedItem(); // Function FortniteUI.FortActivatablePanelWithItemPreview.GetWidgetForFramingViewedItem // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortStoreFrontOfferDetailsWidgetBase
// Size: 0x828 (Inherited: 0x6b0)
struct UFortStoreFrontOfferDetailsWidgetBase : UFortActivatablePanelWithItemPreview {
	char pad_6B0[0x48]; // 0x6b0(0x48)
	struct FDataTableRowHandle EnterViewModeInputActionRowHandle; // 0x6f8(0x10)
	bool IsInItemViewMode; // 0x708(0x01)
	bool ShouldAllowItemViewModeAction; // 0x709(0x01)
	bool bImmediatelyPurchased; // 0x70a(0x01)
	char pad_70B[0x5]; // 0x70b(0x05)
	struct TArray<struct UFortStoreFrontOfferInfo*> PagedItems; // 0x710(0x10)
	struct UFortStoreFrontOfferInfo* OfferData; // 0x720(0x08)
	struct UFortVariantPicker* Picker_VariantSelector; // 0x728(0x08)
	struct UCommonTextBlock* TextUndoAvailability; // 0x730(0x08)
	struct UCommonTextBlock* Text_UndoBottomBarWarning; // 0x738(0x08)
	struct UCommonButtonLegacy* Button_Undo; // 0x740(0x08)
	struct UCommonTextBlock* Text_CosmeticWarning; // 0x748(0x08)
	char pad_750[0x40]; // 0x750(0x40)
	struct UFortPurchaseOverlayModal* PurchaseModalClass; // 0x790(0x08)
	char pad_798[0x30]; // 0x798(0x30)
	struct UFortItem* ItemToRepresent; // 0x7c8(0x08)
	struct UFortItemDefinition* SecondaryItemDefinition; // 0x7d0(0x08)
	float TimeBetweenVariantsRestart; // 0x7d8(0x04)
	float TimeBetweenVariants; // 0x7dc(0x04)
	char pad_7E0[0x9]; // 0x7e0(0x09)
	bool bShowRefundWarningWhileMatchmaking; // 0x7e9(0x01)
	bool bShowRefundWarningWhileInZone; // 0x7ea(0x01)
	char pad_7EB[0x3d]; // 0x7eb(0x3d)

	void UpdateItemViewModeBP(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.UpdateItemViewModeBP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void ShowVaultItemFromItemReward(struct UFortAthenaReward* InItemReward); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowVaultItemFromItemReward // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b7a9ac
	void ShowVaultItem(struct UFortItem* InItemToRepresent); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowVaultItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b7a92c
	void ShowUndoInBottomBar(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowUndoInBottomBar // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ShowReloadMtx(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowReloadMtx // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b7a918
	void ShowPurchasedOverlayWidget(int32_t QuantityPurchased, struct TArray<struct FPurchasedItemInfo> PurchasedItems, bool bShowAsRefund, struct FString OfferId); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowPurchasedOverlayWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b7a608
	void ShowItemPresentationScreen(struct TArray<struct FPurchasedItemInfo>& PurchasedItems); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShowItemPresentationScreen // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x9b7a56c
	bool ShouldHavePurchaseConfirmation(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShouldHavePurchaseConfirmation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9afef48
	bool ShouldDisplayOfferPurchasedOverlay(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ShouldDisplayOfferPurchasedOverlay // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b7a514
	void SetupOffer(struct UFortStoreFrontOfferInfo* InOfferData); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetupOffer // (Final|Native|Public|BlueprintCallable) // @ game+0x9b7a494
	void SetStoreRoot(struct UFortMtxStoreRootBase* InStoreRoot); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetStoreRoot // (Final|Native|Public|BlueprintCallable) // @ game+0x9b7a38c
	void SetShouldAllowItemViewModeAction(bool Value); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetShouldAllowItemViewModeAction // (Final|Native|Public|BlueprintCallable) // @ game+0x9b7a28c
	void SetSecondaryItem(struct UFortItemDefinition* ItemDefinition); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetSecondaryItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b7a20c
	void SetPagedItems(struct TArray<struct UFortStoreFrontOfferInfo*>& InPagedItems); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetPagedItems // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9b7a16c
	void SetItemRewardSecondaryItem(struct UFortItemDefinition* ItemDef, struct TArray<struct FFortItemQuantityPair> AllItemQuantityPairs, struct UFortAthenaReward* RewardWidget); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetItemRewardSecondaryItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b79f6c
	void SetIsInItemViewMode(bool Value); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SetIsInItemViewMode // (Final|Native|Public|BlueprintCallable) // @ game+0x9b79ee4
	void SendUndoMtxReturnedAnalytic(struct FString Interaction, struct FString PurchaseId, int32_t MtxReturned); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendUndoMtxReturnedAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9b79a10
	void SendShopInteractionAnalytic(struct FString Interaction, float HoldTime); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendShopInteractionAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9b79878
	void SendSeasonPassInteractionAnalytic(struct FString Interaction); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendSeasonPassInteractionAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9b796cc
	void SendReloadMtxPurchaseSKUAnalytic(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendReloadMtxPurchaseSKUAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9b796b8
	void SendRealMoneyStoreInteractionAnalytic(struct FString Interaction); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendRealMoneyStoreInteractionAnalytic // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9b79564
	void SendRealMoneyPurchase(int32_t PriceIndex, int32_t Quantity); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendRealMoneyPurchase // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b794a4
	void SendingToMainStore(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.SendingToMainStore // (Final|Native|Public|BlueprintCallable) // @ game+0x9b79cbc
	void RequestExternalPurchase(int32_t PriceIndex, int32_t Quantity); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RequestExternalPurchase // (Final|Native|Public|BlueprintCallable) // @ game+0x9b793e4
	void RegisterItemRewardInteraction(struct UFortAthenaReward* InItemReward); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RegisterItemRewardInteraction // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b7932c
	void RefreshUndoState(struct UFortStoreFrontOfferInfo* OfferPurchased); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RefreshUndoState // (Final|Native|Public|BlueprintCallable) // @ game+0x9b792ac
	void RefreshOfferInfo(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.RefreshOfferInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9b79298
	void PurchaseOffer(struct FDelegate& Callback, int32_t Quantity, float HoldTime); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.PurchaseOffer // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x9b79170
	void PurchaseAmountRight(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.PurchaseAmountRight // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void PurchaseAmountLeft(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.PurchaseAmountLeft // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnVariantChanged(struct FGameplayTag VariantChannel, struct FGameplayTag VariantTag, struct FString VariantCustomData, bool IsOwned); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnVariantChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnUpdateStatus(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnUpdateStatus // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnUpdateItemRestrictionCallout(bool bShouldShow, struct FText& RestrictionText); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnUpdateItemRestrictionCallout // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnPurchasingStarted(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnPurchasingStarted // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnEnterViewModeActionCommitted(bool& PassThrough); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.OnEnterViewModeActionCommitted // (Final|Native|Protected|HasOutParms) // @ game+0x9b790ec
	bool IsReloadMtxEnabled(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.IsReloadMtxEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b78ff0
	void HideUndoInBottomBar(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HideUndoInBottomBar // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void HandleVaultItemsViewed(struct TArray<struct UFortItem*>& ItemsShown); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleVaultItemsViewed // (Final|Native|Protected|HasOutParms) // @ game+0x9b78e50
	void HandleRealMoneyPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo>& PurchasedItems); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleRealMoneyPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0x9b78d5c
	void HandleGiftingItemPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo>& PurchasedItems, struct FString OfferId); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleGiftingItemPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0x9b78a1c
	void HandleCurrentlyViewedAccountInfoChanged(struct FFortPublicAccountInfo NewInfo); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleCurrentlyViewedAccountInfoChanged // (Final|Native|Protected) // @ game+0x9b78950
	void HandleBattlePassPurchaseComplete(bool bSuccess); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.HandleBattlePassPurchaseComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x9b788c0
	int32_t GetPriceIndexToShow(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.GetPriceIndexToShow // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b78884
	struct UFortStoreFrontOfferInfo* GetOfferInfoById(struct FString OfferId); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.GetOfferInfoById // (Final|Native|Public|BlueprintCallable) // @ game+0x9b780d8
	struct UFortStoreFrontOfferInfo* GetOfferInfo(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.GetOfferInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b780c0
	bool FindItemQuantityPair(struct UFortItemDefinition* ItemDefinition, struct TArray<struct FFortItemQuantityPair>& InItemQuantityPairs, struct FFortItemQuantityPair& OutItemQuantity); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.FindItemQuantityPair // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9b77a70
	void DeactivateUndoButton(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.DeactivateUndoButton // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b778a0
	void ConfirmUndo(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.ConfirmUndo // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b77500
	void BP_OnOfferSet(); // Function FortniteUI.FortStoreFrontOfferDetailsWidgetBase.BP_OnOfferSet // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortUserWidget
// Size: 0x2c8 (Inherited: 0x2b8)
struct UFortUserWidget : UUserWidget {
	char pad_2B8[0x8]; // 0x2b8(0x08)
	bool bConsumePointerInput; // 0x2c0(0x01)
	char pad_2C1[0x7]; // 0x2c1(0x07)
};

// Class FortniteUI.FortBangWrapper_NUI
// Size: 0x2f8 (Inherited: 0x2e0)
struct UFortBangWrapper_NUI : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)
	enum class EFortBangType BangType; // 0x2e8(0x01)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	struct FName TutorialNameID; // 0x2ec(0x04)
	struct UNamedSlot* ContentSlot; // 0x2f0(0x08)

	void UnregisterTutorialNameID(); // Function FortniteUI.FortBangWrapper_NUI.UnregisterTutorialNameID // (Final|Native|Public|BlueprintCallable) // @ game+0x9b24658
	void SetTutorialNameID(struct FName InTutorialNameID); // Function FortniteUI.FortBangWrapper_NUI.SetTutorialNameID // (Final|Native|Public|BlueprintCallable) // @ game+0x9b245cc
	void SetBangType(enum class EFortBangType NewBangType); // Function FortniteUI.FortBangWrapper_NUI.SetBangType // (Final|Native|Public|BlueprintCallable) // @ game+0x9b239d4
	void SetBangStateBP(bool bEnabled, int32_t Count); // Function FortniteUI.FortBangWrapper_NUI.SetBangStateBP // (Final|Native|Public|BlueprintCallable) // @ game+0x22f26a4
	void OnTutorialCalloutFinished(); // Function FortniteUI.FortBangWrapper_NUI.OnTutorialCalloutFinished // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnStopCallout(); // Function FortniteUI.FortBangWrapper_NUI.OnStopCallout // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnStartCallout(struct FName TutorialObjectiveName, enum class ETutorialType TutorialType); // Function FortniteUI.FortBangWrapper_NUI.OnStartCallout // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBangStateChanged(bool bEnabled, int32_t Count); // Function FortniteUI.FortBangWrapper_NUI.OnBangStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void AsyncPlaySound2D(struct UObject* WorldContextObject, struct TSoftObjectPtr<USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Function FortniteUI.FortBangWrapper_NUI.AsyncPlaySound2D // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x9b22688
};

// Class FortniteUI.FortRootViewportLayout
// Size: 0x408 (Inherited: 0x2e0)
struct UFortRootViewportLayout : UCommonUserWidget {
	char pad_2E0[0x20]; // 0x2e0(0x20)
	struct UFortWebPurchaseScreen* WebPurchaseScreenWidgetClass; // 0x300(0x08)
	struct UFortWebPurchaseScreen* WebPurchaseWidget_RuntimeSpawned; // 0x308(0x08)
	struct UFortUINotificationManager* NotificationManager; // 0x310(0x08)
	struct TArray<struct FFortDialogDescription_NUI> ConfirmationQueue; // 0x318(0x10)
	char pad_328[0x10]; // 0x328(0x10)
	struct UFortUIStateWidget_NUI* CurrentLegacyStateWidget; // 0x338(0x08)
	char pad_340[0x8]; // 0x340(0x08)
	struct UFortLetoLayoutBorder* LetoLayoutBorderClass; // 0x348(0x08)
	struct TArray<struct FPluginUIStateWidgetEntry> PluginUIStateWidgetEntries; // 0x350(0x10)
	char pad_360[0x60]; // 0x360(0x60)
	struct UFortUIStateWidgetBase* CurrentStateWidget; // 0x3c0(0x08)
	struct UCommonActivatableWidgetQueue* WidgetQueue_ModalContent; // 0x3c8(0x08)
	struct UAthenaProgressModal* AthenaProgressModal; // 0x3d0(0x08)
	struct UFortConfirmationWindow* ConfirmationWindow_ConfirmationWidget; // 0x3d8(0x08)
	struct UFortErrorWindow* ErrorWindow_Errors; // 0x3e0(0x08)
	struct UAthenaProgressModal* ProgressModal_ControllerDisconnected; // 0x3e8(0x08)
	struct UFortRestartClientModal* RestartModal; // 0x3f0(0x08)
	struct UFortPinModal* PinModal; // 0x3f8(0x08)
	struct UFortToastDisplayArea* ToastDisplayArea_ToastHandler; // 0x400(0x08)

	void PurchasingWidgetDisplayCallback(struct UWidget* WebWidget, struct FString OfferId); // Function FortniteUI.FortRootViewportLayout.PurchasingWidgetDisplayCallback // (Final|Native|Protected) // @ game+0x9b67414
	void PurchasingWidgetDismissedCallback(); // Function FortniteUI.FortRootViewportLayout.PurchasingWidgetDismissedCallback // (Final|Native|Protected) // @ game+0x9b67400
	void HandleControllerConnectionChanged(bool bConnected); // Function FortniteUI.FortRootViewportLayout.HandleControllerConnectionChanged // (Final|Native|Private) // @ game+0x9b66f38
};

// Class FortniteUI.FortItemDetailElementWidget
// Size: 0x338 (Inherited: 0x2e0)
struct UFortItemDetailElementWidget : UCommonUserWidget {
	struct TWeakObjectPtr<struct UFortItem> ItemToDetail; // 0x2e0(0x08)
	struct TWeakObjectPtr<struct UFortItem> ItemToCompareWith; // 0x2e8(0x08)
	bool bShouldPreviewUpgradingItem; // 0x2f0(0x01)
	char pad_2F1[0x3]; // 0x2f1(0x03)
	int32_t UpgradeLevelDelta; // 0x2f4(0x04)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x2f8(0x10)
	enum class EFortItemInspectionMode CurrentInspectMode; // 0x308(0x01)
	char pad_309[0x3]; // 0x309(0x03)
	int32_t QuantityOverride; // 0x30c(0x04)
	bool bIsUpdatingSuspended; // 0x310(0x01)
	char pad_311[0x27]; // 0x311(0x27)

	void HandleUpgradeLevelDeltaChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleUpgradeLevelDeltaChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleShouldPreviewUpgradingItemChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleShouldPreviewUpgradingItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleQuantityOverrideChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleQuantityOverrideChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandlePreDifferentItemToDetailSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePreDifferentItemToDetailSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandlePreDifferentItemToCompareWithSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePreDifferentItemToCompareWithSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandlePostDifferentItemToDetailSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePostDifferentItemToDetailSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandlePostDifferentItemToCompareWithSet(); // Function FortniteUI.FortItemDetailElementWidget.HandlePostDifferentItemToCompareWithSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleItemToDetailChangedBP(); // Function FortniteUI.FortItemDetailElementWidget.HandleItemToDetailChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleItemToCompareWithChangedBP(); // Function FortniteUI.FortItemDetailElementWidget.HandleItemToCompareWithChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleInspectModeChanged(); // Function FortniteUI.FortItemDetailElementWidget.HandleInspectModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortItemDetailsHostPanel
// Size: 0x3b8 (Inherited: 0x2e0)
struct UFortItemDetailsHostPanel : UCommonUserWidget {
	struct FMulticastInlineDelegate OnItemChanged; // 0x2e0(0x10)
	struct TWeakObjectPtr<struct UFortItem> ItemToDetail; // 0x2f0(0x08)
	char pad_2F8[0x10]; // 0x2f8(0x10)
	struct TWeakObjectPtr<struct UFortItem> ItemToCompareWith; // 0x308(0x08)
	char pad_310[0x10]; // 0x310(0x10)
	bool bShouldPreviewUpgradingItem; // 0x320(0x01)
	char pad_321[0x3]; // 0x321(0x03)
	int32_t UpgradeLevelDelta; // 0x324(0x04)
	struct UScrollBox* ScrollBox; // 0x328(0x08)
	struct UNamedSlot* DetailsContainerSlotWidget; // 0x330(0x08)
	struct UCommonBorder* HighRarityBorder; // 0x338(0x08)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x340(0x10)
	enum class EFortItemInspectionMode CurrentInspectMode; // 0x350(0x01)
	char pad_351[0x27]; // 0x351(0x27)
	int32_t QuantityOverride; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct UFortTooltipLoadingWrapper* ItemToDetailLoadingWrapper; // 0x380(0x08)
	struct UFortTooltipLoadingWrapper* ItemToCompareLoadingWrapper; // 0x388(0x08)
	struct UCommonLoadGuard* ItemToDetailLoadGuard; // 0x390(0x08)
	struct UCommonLoadGuard* ItemToCompareLoadGuard; // 0x398(0x08)
	struct UCommonBorder* Border_Details; // 0x3a0(0x08)
	bool bAsyncLoadTooltipData; // 0x3a8(0x01)
	bool bIsUpdatingSuspended; // 0x3a9(0x01)
	char pad_3AA[0xe]; // 0x3aa(0x0e)

	void ShouldPreviewUpgradingItem(bool Value); // Function FortniteUI.FortItemDetailsHostPanel.ShouldPreviewUpgradingItem // (Final|Native|Public|BlueprintCallable) // @ game+0x9b4c42c
	void SetUpgradeLevelDelta(int32_t InDelta); // Function FortniteUI.FortItemDetailsHostPanel.SetUpgradeLevelDelta // (Final|Native|Public|BlueprintCallable) // @ game+0x9b4c3ac
	void SetScrollWidget(); // Function FortniteUI.FortItemDetailsHostPanel.SetScrollWidget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b4c260
	void SetQuantityOverride(int32_t QuantityOverride); // Function FortniteUI.FortItemDetailsHostPanel.SetQuantityOverride // (Final|Native|Public|BlueprintCallable) // @ game+0x9b4c1e0
	void SetItemViewContext(struct TScriptInterface<IFortItemViewContextInterface>& ItemViewContext); // Function FortniteUI.FortItemDetailsHostPanel.SetItemViewContext // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9b4bfb8
	void SetItemToDetail(struct UFortItem* ItemToDetail); // Function FortniteUI.FortItemDetailsHostPanel.SetItemToDetail // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x1c9b208
	void SetItemToCompareWith(struct UFortItem* ItemToCompareWith); // Function FortniteUI.FortItemDetailsHostPanel.SetItemToCompareWith // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9b4bf38
	void SetIsUpdatingSuspended(bool bValue); // Function FortniteUI.FortItemDetailsHostPanel.SetIsUpdatingSuspended // (Final|Native|Public|BlueprintCallable) // @ game+0x9b4bbbc
	void SetInspectMode(enum class EFortItemInspectionMode InspectMode); // Function FortniteUI.FortItemDetailsHostPanel.SetInspectMode // (Final|Native|Public|BlueprintCallable) // @ game+0x9b4bb3c
	void OnItemChangedDelegate__DelegateSignature(); // DelegateFunction FortniteUI.FortItemDetailsHostPanel.OnItemChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void HandleUpgradeLevelDeltaChangedBP(); // Function FortniteUI.FortItemDetailsHostPanel.HandleUpgradeLevelDeltaChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleShouldPreviewUpgradingItemChangedBP(); // Function FortniteUI.FortItemDetailsHostPanel.HandleShouldPreviewUpgradingItemChangedBP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleQuantityOverrideChanged(); // Function FortniteUI.FortItemDetailsHostPanel.HandleQuantityOverrideChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleItemToDetailTooltipAssetsLoading(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToDetailTooltipAssetsLoading // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleItemToDetailTooltipAssetsLoaded(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToDetailTooltipAssetsLoaded // (Final|Native|Private) // @ game+0x74b486c
	void HandleItemToDetailChangedBP(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToDetailChangedBP // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void HandleItemToCompareTooltipAssetsLoading(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToCompareTooltipAssetsLoading // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleItemToCompareTooltipAssetsLoaded(); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemToCompareTooltipAssetsLoaded // (Final|Native|Private) // @ game+0x9b4b624
	void HandleItemRefundComplete(bool bWasSuccessful, struct FString ConvertedItemInstanceId, struct TArray<struct FFortItemInstanceQuantityPair>& ItemsQuantities); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemRefundComplete // (Final|Native|Private|HasOutParms) // @ game+0x9b4b428
	void HandleItemRarityUpgradeComplete(bool bWasSuccessful, struct FString ConvertedItemInstanceId, struct TArray<struct FFortItemInstanceQuantityPair>& ItemsQuantities); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemRarityUpgradeComplete // (Final|Native|Private|HasOutParms) // @ game+0x9b4b428
	void HandleItemEvolutionComplete(bool bWasSuccessful, struct FString ConvertedItemInstanceId, struct TArray<struct FFortItemInstanceQuantityPair>& ItemsQuantities); // Function FortniteUI.FortItemDetailsHostPanel.HandleItemEvolutionComplete // (Final|Native|Private|HasOutParms) // @ game+0x9b4b428
	void HandleInspectModeChanged(); // Function FortniteUI.FortItemDetailsHostPanel.HandleInspectModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleDifferentItemToDetailSet(); // Function FortniteUI.FortItemDetailsHostPanel.HandleDifferentItemToDetailSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleDifferentItemToCompareSet(); // Function FortniteUI.FortItemDetailsHostPanel.HandleDifferentItemToCompareSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortItemTileButton
// Size: 0x10b0 (Inherited: 0x1070)
struct UFortItemTileButton : UCommonButtonLegacy {
	char pad_1070[0x10]; // 0x1070(0x10)
	struct UFortMultiSizeItemCard* ItemWidget; // 0x1080(0x08)
	struct TWeakObjectPtr<struct UFortItem> Item; // 0x1088(0x08)
	enum class EFortItemCardSize ItemCardSize; // 0x1090(0x01)
	bool IsRewardCard; // 0x1091(0x01)
	char pad_1092[0x6]; // 0x1092(0x06)
	struct TScriptInterface<IFortItemViewContextInterface> ItemViewContext; // 0x1098(0x10)
	char pad_10A8[0x8]; // 0x10a8(0x08)

	void OnTileSizeOverrideCheck(enum class EFortItemCardSize SizeIn, enum class EFortItemCardSize& SizeOut); // Function FortniteUI.FortItemTileButton.OnTileSizeOverrideCheck // (Event|Protected|HasOutParms|BlueprintEvent|Const) // @ game+0xda071c
};

// Class FortniteUI.FortUIStateWidgetBase
// Size: 0x410 (Inherited: 0x3f8)
struct UFortUIStateWidgetBase : UCommonActivatableWidget {
	char pad_3F8[0x10]; // 0x3f8(0x10)
	struct UCommonActivatableWidgetStack* WidgetStack_PrimaryContent; // 0x408(0x08)
};

// Class FortniteUI.FortCreativeContentBrowserTabPanelBase
// Size: 0x440 (Inherited: 0x3f8)
struct UFortCreativeContentBrowserTabPanelBase : UCommonActivatableWidget {
	struct FMulticastInlineDelegate OnSelectionChanged; // 0x3f8(0x10)
	char pad_408[0x4]; // 0x408(0x04)
	struct FName TabName; // 0x40c(0x04)
	struct FText TabLabel; // 0x410(0x18)
	struct TArray<struct FName> LastFilters; // 0x428(0x10)
	char pad_438[0x8]; // 0x438(0x08)

	void SelectTab(); // Function FortniteUI.FortCreativeContentBrowserTabPanelBase.SelectTab // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	int32_t GetSelectedItemIndex(); // Function FortniteUI.FortCreativeContentBrowserTabPanelBase.GetSelectedItemIndex // (Native|Public|BlueprintCallable) // @ game+0x9b27d98
	enum class EFortCreativeItemType GetItemType(); // Function FortniteUI.FortCreativeContentBrowserTabPanelBase.GetItemType // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9b27a18
};

// Class FortniteUI.CreativeContentBrowserTab_CreationCondition
// Size: 0x28 (Inherited: 0x28)
struct UCreativeContentBrowserTab_CreationCondition : UObject {
};

// Class FortniteUI.AthenaAboutModal
// Size: 0x520 (Inherited: 0x3f8)
struct UAthenaAboutModal : UCommonActivatableWidget {
	struct FMulticastInlineDelegate BP_OnAboutModalClosed; // 0x3f8(0x10)
	bool bForceShowPage; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct FText Title; // 0x410(0x18)
	struct TArray<struct FText> Entries; // 0x428(0x10)
	struct TSoftObjectPtr<UObject> HeroImage; // 0x438(0x28)
	struct TSoftClassPtr<UObject> SeasonMovieWidgetClass; // 0x460(0x28)
	struct UFortStreamMediaSource* VideoStream_Source; // 0x488(0x08)
	struct UScrollBox* ScrollBox_Content; // 0x490(0x08)
	struct UFortLazyImage* Image_Item; // 0x498(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x4a0(0x08)
	struct UCommonButtonLegacy* Button_Close_Mobile; // 0x4a8(0x08)
	struct UCommonButtonLegacy* Button_BPSTrailer; // 0x4b0(0x08)
	struct UCommonButtonLegacy* Button_BPSTrailer_Mobile; // 0x4b8(0x08)
	struct UCommonButtonLegacy* Button_BPSHowTo; // 0x4c0(0x08)
	struct UCommonButtonLegacy* Button_BPSHowTo_Mobile; // 0x4c8(0x08)
	char pad_4D0[0x50]; // 0x4d0(0x50)

	void OnSetContent(struct FText& InTitle, struct TArray<struct FText>& InEntries); // Function FortniteUI.AthenaAboutModal.OnSetContent // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnAboutModalClosedDynamic__DelegateSignature(); // DelegateFunction FortniteUI.AthenaAboutModal.OnAboutModalClosedDynamic__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void CloseModal(); // Function FortniteUI.AthenaAboutModal.CloseModal // (Final|Native|Protected|BlueprintCallable) // @ game+0x9aeb360
};

// Class FortniteUI.ActivityBrowserBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActivityBrowserBlueprintLibrary : UBlueprintFunctionLibrary {

	bool IsSubModeSelectVisualsEnabled(); // Function FortniteUI.ActivityBrowserBlueprintLibrary.IsSubModeSelectVisualsEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x9aec7dc
};

// Class FortniteUI.AlternativeCarryPickupButton
// Size: 0x430 (Inherited: 0x428)
struct UAlternativeCarryPickupButton : UBacchusActionButton {
	char pad_428[0x8]; // 0x428(0x08)
};

// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
// Size: 0x558 (Inherited: 0x538)
struct UAthenaLoadingScreenPreviewPanelBase : UAthenaLoadingScreenPreviewPanel {
	struct UNativeWidgetHost* LoadingScreenSlot; // 0x538(0x08)
	char pad_540[0x8]; // 0x540(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x548(0x08)
	struct UCommonButtonLegacy* Button_CloseMobile; // 0x550(0x08)
};

// Class FortniteUI.ApolloIntroLoadingPanel
// Size: 0x560 (Inherited: 0x558)
struct UApolloIntroLoadingPanel : UAthenaLoadingScreenPreviewPanelBase {
	struct UFortPlaylistAthena* ApolloIntroPlaylist; // 0x558(0x08)
};

// Class FortniteUI.ApolloIntroShimBase
// Size: 0x2b8 (Inherited: 0x2b8)
struct UApolloIntroShimBase : UUserWidget {

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.ApolloIntroShimBase.HandleGamePhaseChanged // (Final|Native|Private) // @ game+0x9aeb9b8
};

// Class FortniteUI.LTMWidgetBase
// Size: 0x378 (Inherited: 0x320)
struct ULTMWidgetBase : UFortHUDElementWidget {
	char pad_320[0x40]; // 0x320(0x40)
	struct AFortGameplayMutator* MutatorClassToWaitFor; // 0x360(0x08)
	struct AFortGameplayMutator* CachedGameplayMutator; // 0x368(0x08)
	char pad_370[0x1]; // 0x370(0x01)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x371(0x02)
	char pad_373[0x5]; // 0x373(0x05)

	void SetPlayerPortrait(struct AFortPlayerStateAthena* Player, struct UFortLazyImage* PortraitImage); // Function FortniteUI.LTMWidgetBase.SetPlayerPortrait // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9b96b68
	void OnStompFailed(); // Function FortniteUI.LTMWidgetBase.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnStompedByOtherWidget(); // Function FortniteUI.LTMWidgetBase.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnMutatorAvailable_BP(struct AFortGameplayMutator* MutatorActor); // Function FortniteUI.LTMWidgetBase.OnMutatorAvailable_BP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnHandleSpectatingChanged(struct AFortPlayerStateZone* SpectatingTarget); // Function FortniteUI.LTMWidgetBase.OnHandleSpectatingChanged // (RequiredAPI|Native|Protected) // @ game+0x9b961f8
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase); // Function FortniteUI.LTMWidgetBase.OnGamePhaseChanged // (RequiredAPI|Native|Protected) // @ game+0x9b96174
	void K2_OnBecomeInactive(); // Function FortniteUI.LTMWidgetBase.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void K2_OnBecomeActive(); // Function FortniteUI.LTMWidgetBase.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	bool K2_HasActiveContent(); // Function FortniteUI.LTMWidgetBase.K2_HasActiveContent // (Event|Protected|BlueprintEvent|Const) // @ game+0xda071c
	char GetViewingTeam(); // Function FortniteUI.LTMWidgetBase.GetViewingTeam // (Final|RequiredAPI|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b95c60
	struct AFortPlayerStateAthena* GetViewingPlayerState(); // Function FortniteUI.LTMWidgetBase.GetViewingPlayerState // (RequiredAPI|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9b95c38
};

// Class FortniteUI.AshtonWidgetBase
// Size: 0x390 (Inherited: 0x378)
struct UAshtonWidgetBase : ULTMWidgetBase {
	struct AFortAthenaMutator_Ashton* AshtonMutatorRef; // 0x378(0x08)
	char pad_380[0x10]; // 0x380(0x10)

	void UpdateAllUI(bool bFirstUpdate); // Function FortniteUI.AshtonWidgetBase.UpdateAllUI // (Final|Native|Protected) // @ game+0x9aecad4
	void OnVillainRespawnsRemainingChanged(); // Function FortniteUI.AshtonWidgetBase.OnVillainRespawnsRemainingChanged // (Final|Native|Protected) // @ game+0x9aec820
	void OnVillainRespawnCountChanged(int32_t NumRespawnsLeft, float RespawnPercentLeft); // Function FortniteUI.AshtonWidgetBase.OnVillainRespawnCountChanged // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnStoneListChanged(); // Function FortniteUI.AshtonWidgetBase.OnStoneListChanged // (Final|Native|Protected) // @ game+0x9aec80c
	void OnStoneChanged(enum class EAshtonStoneType StoneType, enum class EAshtonStoneStateType StoneState); // Function FortniteUI.AshtonWidgetBase.OnStoneChanged // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnOpenWidget(); // Function FortniteUI.AshtonWidgetBase.OnOpenWidget // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnCloseWidget(); // Function FortniteUI.AshtonWidgetBase.OnCloseWidget // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaAccoladeWrapper
// Size: 0x48 (Inherited: 0x28)
struct UAthenaAccoladeWrapper : UObject {
	struct FAthenaAccolades AccoladeData; // 0x28(0x20)
};

// Class FortniteUI.AthenaAccoladeListEntryWidget
// Size: 0x2e8 (Inherited: 0x2e0)
struct UAthenaAccoladeListEntryWidget : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void SetTitle(struct FText& TitleText); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetTitle // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void SetSource(struct FText& SourceText); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetSource // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void SetIcon(struct UFortAccoladeItemDefinition* ItemDef); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetIcon // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void SetCount(int32_t Count); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetCount // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaAccoladeListWidget
// Size: 0xb80 (Inherited: 0xb80)
struct UAthenaAccoladeListWidget : UCommonListView {

	void PopulateWidget(); // Function FortniteUI.AthenaAccoladeListWidget.PopulateWidget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x9aec834
};

// Class FortniteUI.AthenaAccountContext
// Size: 0x30 (Inherited: 0x30)
struct UAthenaAccountContext : UBlueprintContextBase {

	void SimulateBattleBookPurchase(int32_t NumLevelsToPurchase, int32_t& BonusLevelsGranted, bool& bOverLimit); // Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9aec958
	bool ShouldReplaceBattleStarsWithAlternateReward(); // Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aec8c8
	bool IsAtMaxBattlePassTier(); // Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aec76c
	struct FText GetCurrentSeasonNumberAsText(bool bFullText); // Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumberAsText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aeb6b0
	int32_t GetCurrentSeasonNumber(); // Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aeb660
	struct UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition(); // Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition // (Final|Native|Public|BlueprintCallable) // @ game+0x9aeb61c
	struct FText GetCurrentChapterNumberAsText(bool bFullText); // Function FortniteUI.AthenaAccountContext.GetCurrentChapterNumberAsText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aeb524
	struct FText GetCurrentChapterAndSeasonText(); // Function FortniteUI.AthenaAccountContext.GetCurrentChapterAndSeasonText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aeb44c
	void GetBattleBookPurchaseLimit(int32_t& MaxNumLevelsPossibleToPurchase, int32_t& BonusLevelsGranted); // Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9aeb374
};

// Class FortniteUI.FortAerialFeedback
// Size: 0x350 (Inherited: 0x320)
struct UFortAerialFeedback : UFortHUDElementWidget {
	struct UFortKeybindWidget* KeyBind; // 0x320(0x08)
	struct UCommonTextBlock* Text_Feedback; // 0x328(0x08)
	char pad_330[0x20]; // 0x330(0x20)
};

// Class FortniteUI.AthenaAerialFeedback
// Size: 0x390 (Inherited: 0x350)
struct UAthenaAerialFeedback : UFortAerialFeedback {
	struct FGameplayTagContainer GliderRedeployTags; // 0x350(0x20)
	struct FGameplayTag AirbagDeployTag; // 0x370(0x04)
	char pad_374[0x4]; // 0x374(0x04)
	struct UFortItemDefinition* AirbagItemDefinition; // 0x378(0x08)
	char pad_380[0x10]; // 0x380(0x10)

	void HandleSkydiveLeaderChanged(bool bEnabled, bool bLocal, struct AFortPlayerState* LeaderPlayerState); // Function FortniteUI.AthenaAerialFeedback.HandleSkydiveLeaderChanged // (Final|Native|Private) // @ game+0x9aebef4
	void HandleKeybindsChanged(); // Function FortniteUI.AthenaAerialFeedback.HandleKeybindsChanged // (Final|Native|Private) // @ game+0x9aebb88
	void HandleBalloonMovementChanged(bool bUsingBalloonMovement); // Function FortniteUI.AthenaAerialFeedback.HandleBalloonMovementChanged // (Final|Native|Private) // @ game+0x9aeb7a8
};

// Class FortniteUI.AthenaAerialVOMute
// Size: 0x330 (Inherited: 0x320)
struct UAthenaAerialVOMute : UFortHUDElementWidget {
	struct UFortKeybindWidget* KeyBind; // 0x320(0x08)
	struct UCommonTextBlock* Text_Feedback; // 0x328(0x08)

	void OnVOMuteStateChanged(bool bIsMuted); // Function FortniteUI.AthenaAerialVOMute.OnVOMuteStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleQuestVOPlayStateChanged(bool bIsPlaying); // Function FortniteUI.AthenaAerialVOMute.HandleQuestVOPlayStateChanged // (Final|Native|Private) // @ game+0x9aebdf8
	void HandleQuestVOMuteStateChanged(bool bIsMuted); // Function FortniteUI.AthenaAerialVOMute.HandleQuestVOMuteStateChanged // (Final|Native|Private) // @ game+0x9aebdf8
	void HandleKeybindsChanged(); // Function FortniteUI.AthenaAerialVOMute.HandleKeybindsChanged // (Final|Native|Private) // @ game+0x9aebb9c
};

// Class FortniteUI.AthenaAIKillsBase
// Size: 0x338 (Inherited: 0x320)
struct UAthenaAIKillsBase : UFortHUDElementWidget {
	struct UTextBlock* KillsText; // 0x320(0x08)
	struct UObject* KillsSource; // 0x328(0x08)
	bool bCustomKillSource; // 0x330(0x01)
	char pad_331[0x7]; // 0x331(0x07)

	void SetKillsSourcePlayerState(struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x9aec848
	void SetKillsSourcePlayerController(struct AFortPlayerControllerAthena* InPlayerController); // Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController // (Final|Native|Public|BlueprintCallable) // @ game+0x9aec848
};

// Class FortniteUI.AthenaAvailableSquadSlotsListBase
// Size: 0x340 (Inherited: 0x320)
struct UAthenaAvailableSquadSlotsListBase : UFortHUDElementWidget {
	int32_t MaxNumberOfAvailableSquadSlots; // 0x320(0x04)
	bool bAlwaysDisplayTopEntryAsDetailed; // 0x324(0x01)
	char pad_325[0xb]; // 0x325(0x0b)
	struct UDynamicEntryBox* EntryBox_AvailableSlotsList; // 0x330(0x08)
	struct UAthenaPlayerViewModel* CachedPlayerVM; // 0x338(0x08)

	void UpdateSquadFromMinigameOptionChange(); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateSquadFromMinigameOptionChange // (Final|Native|Private) // @ game+0x9aed0bc
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnMinigameVolumeChanged // (Final|Native|Private) // @ game+0x9aecc18
	void UpdateIsTeamMiniGameOnGameStateChanged(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnGameStateChanged // (Final|Native|Private) // @ game+0x9aecb54
	void HandleSquadMemberDisconnected(struct AFortPlayerStateAthena* Player); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleSquadMemberDisconnected // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl& UniqueId); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerUniqueIdReplicated // (Final|Native|Private|HasOutParms) // @ game+0x9aebd38
	void HandlePlayerExitVolume(struct APlayerState* ClientPlayerState, struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerExitVolume // (Final|Native|Private) // @ game+0x9aebc74
	void HandlePlayerEnterVolume(struct APlayerState* ClientPlayerState, struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerEnterVolume // (Final|Native|Private) // @ game+0x9aebbb0
	void HandleGameMemberChanged(char InSquadId, char InTeamIndex, struct AFortPlayerStateAthena* ChangedPS); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleGameMemberChanged // (Final|Native|Private) // @ game+0x9aeb8c0
};

// Class FortniteUI.AthenaAvailableSquadSlotsListEntryBase
// Size: 0x328 (Inherited: 0x320)
struct UAthenaAvailableSquadSlotsListEntryBase : UFortHUDElementWidget {
	enum class EAvailableSquadSlotsListEntryState CurrentEntryState; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)

	void BP_OnEntryStateUpdated(enum class EAvailableSquadSlotsListEntryState NewEntryState); // Function FortniteUI.AthenaAvailableSquadSlotsListEntryBase.BP_OnEntryStateUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBattleMapClickHandler
// Size: 0x2c0 (Inherited: 0x2b8)
struct UAthenaBattleMapClickHandler : UUserWidget {
	char pad_2B8[0x8]; // 0x2b8(0x08)

	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* BattleMapPawn); // Function FortniteUI.AthenaBattleMapClickHandler.HandleToggledBattleMapLive // (Final|Native|Protected) // @ game+0x9aec310
};

// Class FortniteUI.AthenaBattleMapNodeTooltip
// Size: 0x320 (Inherited: 0x2e0)
struct UAthenaBattleMapNodeTooltip : UCommonUserWidget {
	struct UCommonTextBlock* TextBlock_NodeTitle; // 0x2e0(0x08)
	struct UCommonTextBlock* TextBlock_NodeDescription; // 0x2e8(0x08)
	struct UCommonTextBlock* TextBlock_NodeTime; // 0x2f0(0x08)
	struct UWidget* Widget_Selection; // 0x2f8(0x08)
	struct UWidget* Widget_Scrubbing; // 0x300(0x08)
	struct UWidget* Widget_ScrubbingGamepad; // 0x308(0x08)
	char pad_310[0x10]; // 0x310(0x10)

	void OnReplayLevelStreamingChanged(bool bStreaming); // Function FortniteUI.AthenaBattleMapNodeTooltip.OnReplayLevelStreamingChanged // (Final|Native|Protected) // @ game+0x1b24f14
	void HandleUnhoveredNode(struct ABattleMapNode* Node, enum class BattleMapHoveredReason Reason); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleUnhoveredNode // (Final|Native|Protected) // @ game+0x9aec498
	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* BattleMapPawn); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleToggledBattleMapLive // (Final|Native|Protected) // @ game+0x9aec398
	void HandleTimelineModeChanged(bool bEnabled); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleTimelineModeChanged // (Final|Native|Protected) // @ game+0x9aec0f8
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleInputMethodChanged // (Final|Native|Protected) // @ game+0x9aebb04
	void HandleHoveredNode(struct ABattleMapNode* Node, enum class BattleMapHoveredReason Reason); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleHoveredNode // (Final|Native|Protected) // @ game+0x9aeba40
	void HandleCameraTypeChanged(struct AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleCameraTypeChanged // (Final|Native|Protected) // @ game+0x1b245f8
};

// Class FortniteUI.AthenaBattleMapTimelineWidget
// Size: 0x628 (Inherited: 0x568)
struct UAthenaBattleMapTimelineWidget : UFortActivatablePanel {
	struct UCommonButtonLegacy* Button_Forward; // 0x568(0x08)
	struct UCommonButtonLegacy* Button_Backward; // 0x570(0x08)
	float ForwardButtonPositionAlpha; // 0x578(0x04)
	float BackwardButtonPositionAlpha; // 0x57c(0x04)
	struct FDataTableRowHandle ForwardDataTableRow; // 0x580(0x10)
	struct FDataTableRowHandle BackwardDataTableRow; // 0x590(0x10)
	struct FDataTableRowHandle StopDataTableRow; // 0x5a0(0x10)
	struct FDataTableRowHandle ScrubToDataTableRow; // 0x5b0(0x10)
	struct FDataTableRowHandle ExitBattleMapDataTableRow; // 0x5c0(0x10)
	struct FDataTableRowHandle ZoomInDataTableRow; // 0x5d0(0x10)
	struct FDataTableRowHandle ZoomOutDataTableRow; // 0x5e0(0x10)
	char pad_5F0[0x38]; // 0x5f0(0x38)

	void OnReplayLevelStreamingChanged(bool bStreaming); // Function FortniteUI.AthenaBattleMapTimelineWidget.OnReplayLevelStreamingChanged // (Final|Native|Private) // @ game+0x1b25a68
	void HandleZoomOutPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomOutPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aec6e8
	void HandleZoomOutHeld(float HeldPercent); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomOutHeld // (Final|Native|Private) // @ game+0x9aec664
	void HandleZoomInPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomInPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aec5e0
	void HandleZoomInHeld(float HeldPercent); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomInHeld // (Final|Native|Private) // @ game+0x9aec55c
	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* BattleMapPawn); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleToggledBattleMapLive // (Final|Native|Private) // @ game+0x9aec418
	void HandleTimelineStopPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineStopPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aec284
	void HandleTimelineScrubToPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineScrubToPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aec1f8
	void HandleTimelineModeChanged(bool bEnabled); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineModeChanged // (Final|Native|Private) // @ game+0x9aec178
	void HandleTimelineForwardPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineForwardPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aec06c
	void HandleTimelineBackwardPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineBackwardPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aebfe0
	void HandleSelectedNode(struct ABattleMapNode* InSelectedNode); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleSelectedNode // (Final|Native|Private) // @ game+0x9aebe74
	void HandleExitBattleMapPressed(bool& bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleExitBattleMapPressed // (Final|Native|Private|HasOutParms) // @ game+0x9aeb83c
	void HandleCameraTypeChanged(struct AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleCameraTypeChanged // (Final|Native|Private) // @ game+0x1b24660
};

// Class FortniteUI.AthenaBattlePassItemTracker
// Size: 0x2f0 (Inherited: 0x2e0)
struct UAthenaBattlePassItemTracker : UCommonUserWidget {
	struct UCommonTextBlock* Text_Category; // 0x2e0(0x08)
	struct UCommonNumericTextBlock* Text_Counter; // 0x2e8(0x08)

	void OnInterpStarted(); // Function FortniteUI.AthenaBattlePassItemTracker.OnInterpStarted // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnInterpEnded(struct UCommonNumericTextBlock* NumericTextBlock, bool HadCompleted); // Function FortniteUI.AthenaBattlePassItemTracker.OnInterpEnded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBattlePassTracker
// Size: 0x3d0 (Inherited: 0x2e0)
struct UAthenaBattlePassTracker : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct FText OutfitsText; // 0x2e8(0x18)
	struct FText VBucksText; // 0x300(0x18)
	struct FText EmotesText; // 0x318(0x18)
	struct FText MoreRewardsText; // 0x330(0x18)
	struct FText BuyBattlePassTextFormat; // 0x348(0x18)
	char pad_360[0x40]; // 0x360(0x40)
	struct UCommonRichTextBlock* RichText_PaidItemsCollected; // 0x3a0(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_01; // 0x3a8(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_02; // 0x3b0(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_03; // 0x3b8(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_04; // 0x3c0(0x08)
	struct UBattlePassScreenPurchaseButton* Button_PurchaseBattlePass; // 0x3c8(0x08)

	void HandlePassPurchaseFlowStarted(); // Function FortniteUI.AthenaBattlePassTracker.HandlePassPurchaseFlowStarted // (Final|Native|Private) // @ game+0x9aee1f0
};

// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
// Size: 0x348 (Inherited: 0x320)
struct UAthenaBroadcastFollowedPlayerInfoBase : UFortHUDElementWidget {
	struct UAthenaSpectatorPlayerWidgetBase* PlayerWidget; // 0x320(0x08)
	struct UAthenaSpectatorHitPointBarBase* HitPointBar_Health; // 0x328(0x08)
	struct UAthenaSpectatorHitPointBarBase* HitPointBar_Shield; // 0x330(0x08)
	struct UAthenaSpectatorHitPointBarBase* HitPointBar_Vehicle; // 0x338(0x08)
	char pad_340[0x8]; // 0x340(0x08)

	void OnVehicleStateChanged(struct AActor* NewVehicle, struct AActor* OldVehicle); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnVehicleStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPipModeChanged(bool bPipModeEnabled); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnPipModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFollowedPlayerChanged(struct AFortPlayerControllerSpectating* SpectatingPC, struct AFortPlayerState* FollowedPlayerState); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnFollowedPlayerChanged // (Final|Native|Private) // @ game+0x19b878c
	void OnEliminatedStateChanged(struct UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnEliminatedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	struct UAthenaRemotePlayerViewData* GetFollowedPlayerData(); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.GetFollowedPlayerData // (Final|Native|Protected|BlueprintCallable) // @ game+0x234f67c
};

// Class FortniteUI.AthenaGamePhaseWidgetBase
// Size: 0x340 (Inherited: 0x320)
struct UAthenaGamePhaseWidgetBase : UFortHUDElementWidget {
	struct UMaterialInterface* StormComingFontMaterial; // 0x320(0x08)
	float StormComingWarningTime; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct UTextBlock* TimeText; // 0x330(0x08)
	char pad_338[0x8]; // 0x338(0x08)

	void OnGameStateSet(struct AFortGameState* InGameState); // Function FortniteUI.AthenaGamePhaseWidgetBase.OnGameStateSet // (Final|Native|Protected) // @ game+0x9af6e50
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaGamePhaseWidgetBase.OnGamePhaseStepChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaGamePhaseWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0x176518c
	void HandleCountdownUpdate(int32_t TimeRemaining); // Function FortniteUI.AthenaGamePhaseWidgetBase.HandleCountdownUpdate // (Final|Native|Protected) // @ game+0x9af6198
};

// Class FortniteUI.AthenaBroadcastGamePhaseWidget
// Size: 0x348 (Inherited: 0x340)
struct UAthenaBroadcastGamePhaseWidget : UAthenaGamePhaseWidgetBase {
	struct AFortMinigame* MinigameOverride; // 0x340(0x08)

	void SetMinigameOverride(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaBroadcastGamePhaseWidget.SetMinigameOverride // (Final|Native|Public|BlueprintCallable) // @ game+0x9aef210
};

// Class FortniteUI.AthenaHUDBase
// Size: 0x5f8 (Inherited: 0x410)
struct UAthenaHUDBase : UFortUIStateWidgetBase {
	char pad_410[0x30]; // 0x410(0x30)
	struct TArray<struct UUserWidget*> MinigameWidgets; // 0x440(0x10)
	struct TArray<struct UFortWeaponReticleExtensionData*> WeaponReticleExtensionDatas; // 0x450(0x10)
	struct UUserWidget* KairosHUDLayerClass; // 0x460(0x08)
	struct TArray<struct FMutatorAddedWidgets> MutatorAddedWidgets; // 0x468(0x10)
	char pad_478[0x60]; // 0x478(0x60)
	struct UFortWeaponReticleExtensionWidgetBase* CurrentCustomReticleExtension; // 0x4d8(0x08)
	struct TArray<struct UFortWeaponReticleExtensionWidgetBase*> RecentReticleExtensions; // 0x4e0(0x10)
	struct UAthenaMapScreenContainer* MapScreenContainer; // 0x4f0(0x08)
	struct UAthenaHUDMenu* AthenaHUDMenu; // 0x4f8(0x08)
	struct UCommonActivatableWidget* TitleBar; // 0x500(0x08)
	struct TSet<enum class EUIExtensionSlot> RelevantExtensionSlots; // 0x508(0x50)
	struct TArray<struct FUIExtension> TournamentUIExtensions; // 0x558(0x10)
	struct TArray<struct FUIExtension> ArenaTournamentUIExtensions; // 0x568(0x10)
	struct UDynamicUIScene* PreloadMenuScene; // 0x578(0x08)
	struct TSoftClassPtr<UObject> NewEmotePicker; // 0x580(0x28)
	struct TSoftClassPtr<UObject> SquadComsPickerClass; // 0x5a8(0x28)
	struct TSoftClassPtr<UObject> WeaponWheelClass; // 0x5d0(0x28)

	void SetZoneCompleted(bool bValue); // Function FortniteUI.AthenaHUDBase.SetZoneCompleted // (Final|Native|Protected|BlueprintCallable) // @ game+0x9afa8cc
	void ReleaseMenu(); // Function FortniteUI.AthenaHUDBase.ReleaseMenu // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x9afa350
	void PreloadMenu(); // Function FortniteUI.AthenaHUDBase.PreloadMenu // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x9afa2f8
	void PlaylistExtensionWidgetCreatedNotSupported(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.PlaylistExtensionWidgetCreatedNotSupported // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9afa210
	void OnHUDScaleChanged(float HUDScale); // Function FortniteUI.AthenaHUDBase.OnHUDScaleChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.OnExtensionWidgetRemoved // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.OnExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaHUDBase.HandleWeaponEquipped // (Final|Native|Private) // @ game+0x145ee48
	void HandleUpdateMinigameUIExtensions(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaHUDBase.HandleUpdateMinigameUIExtensions // (Final|Native|Protected) // @ game+0x9af99c4
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32_t InitialOption, bool bIgnoreFirstAccept); // Function FortniteUI.AthenaHUDBase.HandlePickerOpenRequest // (Final|Native|Protected) // @ game+0x9af9680
	void HandleOnMutatorRemoved(struct AFortGameplayMutator* NewMutator); // Function FortniteUI.AthenaHUDBase.HandleOnMutatorRemoved // (Final|Native|Protected) // @ game+0x9af8e10
	void HandleOnMutatorAdded(struct AFortGameplayMutator* NewMutator); // Function FortniteUI.AthenaHUDBase.HandleOnMutatorAdded // (Final|Native|Protected) // @ game+0x9af8d90
	void HandleNewPanelFromMutator(struct UUserWidget* PanelClass); // Function FortniteUI.AthenaHUDBase.HandleNewPanelFromMutator // (Final|Native|Protected) // @ game+0x9af8d10
	void HandleMinigamePlayModeChanged(struct AFortMinigame* Minigame, bool bIsInPlayMode); // Function FortniteUI.AthenaHUDBase.HandleMinigamePlayModeChanged // (Final|Native|Protected) // @ game+0x9af8c48
	void HandleMinigameHideHUD(bool bLoading); // Function FortniteUI.AthenaHUDBase.HandleMinigameHideHUD // (Final|Native|Protected) // @ game+0x9af8bc8
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport& DeathReport); // Function FortniteUI.AthenaHUDBase.HandleLocalPlayerDied // (Final|Native|Private|HasOutParms) // @ game+0x9af8b24
	void HandleGamePhaseChanged(enum class EAthenaGamePhase NewPhase); // Function FortniteUI.AthenaHUDBase.HandleGamePhaseChanged // (Final|Native|Private) // @ game+0x283d500
	void HandleCursorModeChanging(bool bCursorModeEnabled, struct FName ActionName); // Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging // (Final|Native|Protected) // @ game+0x22c37f8
	void HandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.AthenaHUDBase.HandleCursorModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	bool GetZoneCompleted(); // Function FortniteUI.AthenaHUDBase.GetZoneCompleted // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af8af0
	void BindVolumeEvents(); // Function FortniteUI.AthenaHUDBase.BindVolumeEvents // (Native|Protected) // @ game+0x74b4f30
};

// Class FortniteUI.AthenaBroadcastHUDBase
// Size: 0x778 (Inherited: 0x5f8)
struct UAthenaBroadcastHUDBase : UAthenaHUDBase {
	struct FDataTableRowHandle ToggleMatchStatusActionRowHandle; // 0x5f8(0x10)
	struct FDataTableRowHandle ToggleSquadStatusActionRowHandle; // 0x608(0x10)
	struct FDataTableRowHandle ToggleRemainingPlayersActionRowHandle; // 0x618(0x10)
	struct FDataTableRowHandle ToggleActiveGridScreenActionRowHandle; // 0x628(0x10)
	struct FDataTableRowHandle ToggleEliminatedGridScreenActionRowHandle; // 0x638(0x10)
	struct FDataTableRowHandle ToggleMatchStatusScreenActionRowHandle; // 0x648(0x10)
	struct FDataTableRowHandle ToggleScoreboardScreenActionRowHandle; // 0x658(0x10)
	struct FDataTableRowHandle ToggleKillFeedActionRowHandle; // 0x668(0x10)
	struct FDataTableRowHandle ToggleActionFeedScreenActionRowHandle; // 0x678(0x10)
	struct FDataTableRowHandle ToggleGotoTimeRowHandle; // 0x688(0x10)
	struct FDataTableRowHandle TogglePipModeActionRowHandle; // 0x698(0x10)
	struct FDataTableRowHandle ToggleFollowedPlayerInfoActionRowHandle; // 0x6a8(0x10)
	struct FDataTableRowHandle ToggleFullscreenMapActionRowHandle; // 0x6b8(0x10)
	struct TMap<struct TSoftClassPtr<UObject>, struct FUIExtension> ExtensionWidgetOverrides; // 0x6c8(0x50)
	struct UAthenaSpectatorHUDControlsBase* BroadcastHUDControls; // 0x718(0x08)
	struct UCommonActivatableWidgetStack* WidgetStack_SpectatorPrimaryContent; // 0x720(0x08)
	struct UAthenaSpectatorNameplateLayerBase* NameplateLayer; // 0x728(0x08)
	struct UAthenaBroadcastMapPanelBase* AthenaBroadcastMapPanel; // 0x730(0x08)
	struct UCommonWidgetSwitcherLegacy* EventMatchInfoSwitcher; // 0x738(0x08)
	struct UCommonWidgetSwitcherLegacy* Switcher_TopLeft; // 0x740(0x08)
	struct USpacer* TopLeft_Empty; // 0x748(0x08)
	struct UFortBroadcastViewSettings* TopLeft_ViewSettings; // 0x750(0x08)
	struct UAthenaReplayActionFeedScreenBase* TopLeft_ActionFeed; // 0x758(0x08)
	struct UFortReplayGoToTimeDialogue* TopLeft_GoToTime; // 0x760(0x08)
	struct UFortReplayHighlightsWindow* TopLeft_Highlights; // 0x768(0x08)
	char pad_770[0x8]; // 0x770(0x08)

	void TryHandleIfPlayerStateAlreadyInVolume(); // Function FortniteUI.AthenaBroadcastHUDBase.TryHandleIfPlayerStateAlreadyInVolume // (Final|Native|Private) // @ game+0x9aef290
	void SetFullscreenMapVisibility(bool bIsVisible); // Function FortniteUI.AthenaBroadcastHUDBase.SetFullscreenMapVisibility // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnVolumeMinigameChanged(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeMinigameChanged // (Final|Native|Private) // @ game+0x9aee9e0
	void OnVolumeEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeEndOverlap // (Final|Native|Private) // @ game+0x9aee8a4
	void OnVolumeBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x9aee6a4
	void OnUnableToPerformAction(struct FGameplayTagContainer FailedReason, struct FText& FailureText); // Function FortniteUI.AthenaBroadcastHUDBase.OnUnableToPerformAction // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnToggleSquadStatusActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleSquadStatusActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnToggleScoreboardScreenActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleScoreboardScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x9aee624
	void OnToggleRemainingPlayersActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleRemainingPlayersActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnTogglePipModeActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnTogglePipModeActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x9aee5a8
	void OnToggleMatchStatusScreenActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x9aee528
	void OnToggleMatchStatusActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnToggleKillFeedActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleKillFeedActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x9aee4ac
	void OnToggleFollowedPlayerInfoActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleFollowedPlayerInfoActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnToggleEliminatedGridScreenActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleEliminatedGridScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x9aee42c
	void OnToggleActiveGridScreenActionExecuted(bool& bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleActiveGridScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x9aee3ac
	void OnPlaylistDataChanged(struct UFortPlaylistAthena* PlaylistData); // Function FortniteUI.AthenaBroadcastHUDBase.OnPlaylistDataChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaBroadcastHUDBase.OnPlayerTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPipModeChanged(bool bEnabled); // Function FortniteUI.AthenaBroadcastHUDBase.OnPipModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnMinigameChanged(struct AFortMinigame* NewMinigame); // Function FortniteUI.AthenaBroadcastHUDBase.OnMinigameChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnIndicatorModeChanged(bool bIndicatorsEnabled); // Function FortniteUI.AthenaBroadcastHUDBase.OnIndicatorModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnHudVisibilityChanged(enum class EHudVisibilityState NewVisibility); // Function FortniteUI.AthenaBroadcastHUDBase.OnHudVisibilityChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnGameStateSet_BP(struct AFortGameStateAthena* GameStateAthena); // Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet_BP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnGameStateSet(struct AFortGameState* NewGameState); // Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet // (Final|Native|Private) // @ game+0x9aee2bc
	void OnCursorModeChanging(bool bCursorModeEnabled, struct FName ActionName); // Function FortniteUI.AthenaBroadcastHUDBase.OnCursorModeChanging // (Final|Native|Protected) // @ game+0x23a4648
	void OnCurrentPlaylistChanged(); // Function FortniteUI.AthenaBroadcastHUDBase.OnCurrentPlaylistChanged // (Final|Native|Private) // @ game+0x9aee2a8
	void HandleToggleReplayViewSettings(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleReplayViewSettings // (Final|Native|Private) // @ game+0x9aee28c
	void HandleToggleHighlightsList(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleHighlightsList // (Final|Native|Private) // @ game+0x9aee270
	void HandleToggleGoToTime(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleGoToTime // (Final|Native|Private) // @ game+0x9aee254
	void HandleToggleActionFeedScreen(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleActionFeedScreen // (Final|Native|Private) // @ game+0x9aee238
	void HandleSpectatorViewTargetChanged(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleSpectatorViewTargetChanged // (Final|Native|Private) // @ game+0x9aee224
	void HandleNameplatesEnabledChanged(bool bInNameplatesEnabled); // Function FortniteUI.AthenaBroadcastHUDBase.HandleNameplatesEnabledChanged // (Final|Native|Private) // @ game+0x9aee170
	void HandleHudVisibilityChanged(enum class EHudVisibilityState NewVisibility); // Function FortniteUI.AthenaBroadcastHUDBase.HandleHudVisibilityChanged // (Final|Native|Private) // @ game+0x24e0248
	void HandleFollowedPlayerRespawnTimeChanged(float RespawnTime); // Function FortniteUI.AthenaBroadcastHUDBase.HandleFollowedPlayerRespawnTimeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
// Size: 0x3c8 (Inherited: 0x3c0)
struct UAthenaBroadcastHUDMenuStatusBase : UFortActorIndicatorWidget {
	float ZOffset; // 0x3c0(0x04)
	char pad_3C4[0x4]; // 0x3c4(0x04)

	void MapActivated(); // Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.MapActivated // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void InventoryActivated(); // Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.InventoryActivated // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
// Size: 0x330 (Inherited: 0x320)
struct UAthenaBroadcastHUDMenuStatusLayerBase : UFortHUDElementWidget {
	struct UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidgetClass; // 0x320(0x08)
	char pad_328[0x8]; // 0x328(0x08)

	void RemoveHUDMenuStatus(struct UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget); // Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.RemoveHUDMenuStatus // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void DeactivateHudMenuWidget(); // Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.DeactivateHudMenuWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x9aef8f0
	void AddHUDMenuStatus(struct UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget); // Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.AddHUDMenuStatus // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBroadcastKillFeedBase
// Size: 0x340 (Inherited: 0x320)
struct UAthenaBroadcastKillFeedBase : UFortHUDElementWidget {
	struct UFortDynamicEntryBox* KillFeedEntryBox; // 0x320(0x08)
	float TimeToShowEntry; // 0x328(0x04)
	char pad_32C[0x14]; // 0x32c(0x14)

	void OnToggleShowKillFeed(bool bShowKillFeed); // Function FortniteUI.AthenaBroadcastKillFeedBase.OnToggleShowKillFeed // (Final|Native|Private) // @ game+0x9aefd28
	void OnTimelineScrubbed(); // Function FortniteUI.AthenaBroadcastKillFeedBase.OnTimelineScrubbed // (Final|Native|Private) // @ game+0x9aefd14
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo& KillFeedEntryInfo); // Function FortniteUI.AthenaBroadcastKillFeedBase.AddKillFeedEntry // (Final|Native|Private|HasOutParms) // @ game+0x9aef658
};

// Class FortniteUI.AthenaBroadcastKillFeedItemBase
// Size: 0x408 (Inherited: 0x320)
struct UAthenaBroadcastKillFeedItemBase : UFortHUDElementWidget {
	char pad_320[0x8]; // 0x320(0x08)
	struct TSoftObjectPtr<UMaterialInterface> EliminationIcon; // 0x328(0x28)
	struct TSoftObjectPtr<UMaterialInterface> StormIcon; // 0x350(0x28)
	struct TSoftObjectPtr<UMaterialInterface> FallDamageIcon; // 0x378(0x28)
	struct TSoftObjectPtr<UMaterialInterface> ExplosionIcon; // 0x3a0(0x28)
	struct TSoftObjectPtr<UMaterialInterface> DbnoIcon; // 0x3c8(0x28)
	struct UCommonTextBlock* Text_InstigatorName; // 0x3f0(0x08)
	struct UCommonTextBlock* Text_VictimName; // 0x3f8(0x08)
	struct UImage* Image_EntryIcon; // 0x400(0x08)
};

// Class FortniteUI.AthenaBroadcastMapPanelBase
// Size: 0x5a8 (Inherited: 0x568)
struct UAthenaBroadcastMapPanelBase : UFortActivatablePanel {
	struct UAthenaSpectatorMapPlayerListBase* PlayerList; // 0x568(0x08)
	struct UAthenaMapLayer* AthenaMapLayer; // 0x570(0x08)
	struct UCommonWidgetSwitcherLegacy* LhsSwitcher; // 0x578(0x08)
	struct UCommonButtonLegacy* Button_CycleSideBar; // 0x580(0x08)
	struct FDataTableRowHandle CycleSideBarRowHandle; // 0x588(0x10)
	struct UFortBroadcasterMapSettings* MapSettingsClass; // 0x598(0x08)
	char pad_5A0[0x8]; // 0x5a0(0x08)
};

// Class FortniteUI.AthenaBroadcastMatchStatusWidget
// Size: 0x328 (Inherited: 0x320)
struct UAthenaBroadcastMatchStatusWidget : UFortHUDElementWidget {
	char pad_320[0x8]; // 0x320(0x08)

	void OnStormPhaseChanged(int32_t StormPhase); // Function FortniteUI.AthenaBroadcastMatchStatusWidget.OnStormPhaseChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
// Size: 0x330 (Inherited: 0x320)
struct UAthenaBroadcastPlayerEventScoreWidget : UFortHUDElementWidget {
	struct UCommonTextBlock* PlayerEventScoreText; // 0x320(0x08)
	struct UCommonWidgetSwitcherLegacy* PlayerEventScoreSwitcher; // 0x328(0x08)

	void OnRemoteClientEventScoreChanged(int32_t NewEventScore); // Function FortniteUI.AthenaBroadcastPlayerEventScoreWidget.OnRemoteClientEventScoreChanged // (Final|Native|Private) // @ game+0x9aefc14
	void OnPointTextSet(); // Function FortniteUI.AthenaBroadcastPlayerEventScoreWidget.OnPointTextSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
// Size: 0x328 (Inherited: 0x320)
struct UAthenaBroadcastPlayerLocationWidget : UFortHUDElementWidget {
	struct UCommonTextBlock* PlayerLocationText; // 0x320(0x08)

	void OnRemoteClientPoiTagIDChanged(int16_t RemoteClientPoiTagID); // Function FortniteUI.AthenaBroadcastPlayerLocationWidget.OnRemoteClientPoiTagIDChanged // (Final|Native|Private) // @ game+0x9aefc94
};

// Class FortniteUI.AthenaBroadcastSessionId
// Size: 0x328 (Inherited: 0x320)
struct UAthenaBroadcastSessionId : UFortHUDElementWidget {
	struct UTextBlock* Text_SessionId; // 0x320(0x08)
};

// Class FortniteUI.AthenaEventMatchSquadWidgetBase
// Size: 0x328 (Inherited: 0x320)
struct UAthenaEventMatchSquadWidgetBase : UFortHUDElementWidget {
	struct TWeakObjectPtr<struct UAthenaRemoteSquadViewData> SquadData; // 0x320(0x08)

	void SetSquadIdVisible(bool bSquadIdVisible); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.SetSquadIdVisible // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnSquadSessionRankChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InSquadSessionRank); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadSessionRankChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSquadPlaceChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InSquadPlace); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadPlaceChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSquadKillscoreChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InSquadKills); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadKillscoreChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSquadIdChanged(struct UAthenaRemoteSquadViewData* InSquadData, char InSquadId); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadIdChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSquadColorChanged(struct UAthenaRemoteSquadViewData* InSquadData, struct FLinearColor InSquadColor); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadColorChanged // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0xda071c
	void OnPlayerAdded(struct UAthenaRemoteSquadViewData* InSquadData, struct UAthenaRemotePlayerViewData* InPlayerData); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnPlayerAdded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleDisplaySessionRankChanged(bool bDisplay); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.HandleDisplaySessionRankChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaBroadcastSquadStatusWidget
// Size: 0x358 (Inherited: 0x328)
struct UAthenaBroadcastSquadStatusWidget : UAthenaEventMatchSquadWidgetBase {
	struct FUniqueNetIdRepl FollowedPlayerUID; // 0x328(0x30)

	void OnPipModeChanged(bool bPipModeEnabled); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnPipModeChanged // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void OnMinigameTeamIdChanged(struct UFortMinigameTeamIdentification* MinigameTeamId); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnMinigameTeamIdChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFollowedPlayerChanged(); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnFollowedPlayerChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleSquadIdChanged(struct UAthenaRemoteSquadViewData* InSquadData, char SquadId); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleSquadIdChanged // (Final|Native|Private) // @ game+0x9aefb3c
	void HandleFollowedPlayerChanged(struct AFortPlayerControllerSpectating* SpectatorController, struct AFortPlayerState* NewFollowedPlayer); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleFollowedPlayerChanged // (Final|Native|Protected) // @ game+0x19bcd58
};

// Class FortniteUI.AthenaCareerScreen
// Size: 0x5e0 (Inherited: 0x530)
struct UAthenaCareerScreen : UCommonActivatablePanelLegacy {
	struct TSoftClassPtr<UObject> LeaderboardsScreenClass; // 0x530(0x28)
	struct TSoftClassPtr<UObject> ReplayBrowserScreenClass; // 0x558(0x28)
	struct FDataTableRowHandle BackToSocialTabInputActionRowHandle; // 0x580(0x10)
	struct UCommonTextBlock* Text_AccountLevel; // 0x590(0x08)
	struct UCommonButtonLegacy* Button_Leaderboards; // 0x598(0x08)
	struct UCommonButtonLegacy* Button_Replays; // 0x5a0(0x08)
	struct UAthenaFeatTimelineListView* ListView_FeatTimeline; // 0x5a8(0x08)
	struct UCommonTextBlock* Text_ChapterContext; // 0x5b0(0x08)
	struct UBacchusCloseButton* Mobile_CloseButton; // 0x5b8(0x08)
	struct UCommonTextBlock* Text_MobileTabLabel; // 0x5c0(0x08)
	struct UImage* Image_LeftFill; // 0x5c8(0x08)
	struct UImage* Image_RightFill; // 0x5d0(0x08)
	struct UImage* Image_Gradient; // 0x5d8(0x08)

	void ShowFeats(bool bHasCompletedFeats); // Function FortniteUI.AthenaCareerScreen.ShowFeats // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeCountdownDisplay
// Size: 0x3d8 (Inherited: 0x2b8)
struct UAthenaChallengeCountdownDisplay : UUserWidget {
	char pad_2B8[0x10]; // 0x2b8(0x10)
	struct FDateTime UnlockTime; // 0x2c8(0x08)
	enum class ECountdownDisplay DisplayType; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct FTimerDisplayData DisplayData[0x4]; // 0x2d8(0xe0)
	char pad_3B8[0x18]; // 0x3b8(0x18)
	struct UCommonTextBlock* Text_TimeRemaining; // 0x3d0(0x08)

	void OnChallengeSet(struct FTimerDisplayData& DisplayStyle); // Function FortniteUI.AthenaChallengeCountdownDisplay.OnChallengeSet // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeDateTimeTextBlock
// Size: 0x3a0 (Inherited: 0x3a0)
struct UAthenaChallengeDateTimeTextBlock : UCommonDateTimeTextBlock {
};

// Class FortniteUI.AthenaChallengeDetailBase
// Size: 0x2f0 (Inherited: 0x2e0)
struct UAthenaChallengeDetailBase : UCommonUserWidget {
	struct UFortItemBaseWidget* ItemInfo_PreviewedItem; // 0x2e0(0x08)
	struct USizeBox* SB_MainContent; // 0x2e8(0x08)
};

// Class FortniteUI.AthenaChallengeDisplayData
// Size: 0x1c8 (Inherited: 0x30)
struct UAthenaChallengeDisplayData : UDataAsset {
	int32_t SoonDisplayMinuteThreshold; // 0x30(0x04)
	struct FLinearColor PartyAssistFontColor; // 0x34(0x10)
	struct FLinearColor DifficultChallengeFontColor; // 0x44(0x10)
	char pad_54[0x4]; // 0x54(0x04)
	struct UTexture2D* PartyAssistIcon; // 0x58(0x08)
	struct UTexture2D* ExternalPartyAssistIcon; // 0x60(0x08)
	struct FFortChallengeSetStyle DefaultChallengeStyle; // 0x68(0xa0)
	struct FFortChallengeSetStyle DailyChallengeStyle; // 0x108(0xa0)
	struct TArray<struct FGameplayTagContainer> PunchCardSortOrder; // 0x1a8(0x10)
	struct TArray<struct FFortChallengePunchCardStyles> ChallengePunchCardStyles; // 0x1b8(0x10)
};

// Class FortniteUI.AthenaChallengeDisplayLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAthenaChallengeDisplayLibrary : UBlueprintFunctionLibrary {

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaChallengeDisplayLibrary.GetChallengeStyleLightAccentColor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9aef924
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle& DisplayStyle, struct UMaterialInstanceDynamic* StyleMaterial); // Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToMaterial // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9aef800
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle& DisplayStyle, struct UImage* ImageWidget); // Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToImageMaterial // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x9aef700
};

// Class FortniteUI.AthenaChallengeEntry
// Size: 0x2c0 (Inherited: 0x2b8)
struct UAthenaChallengeEntry : UUserWidget {
	struct UCommonRichTextBlock* Text_CurrentTask; // 0x2b8(0x08)
};

// Class FortniteUI.ImageGridObject
// Size: 0x40 (Inherited: 0x28)
struct UImageGridObject : UObject {
	int32_t GridLocation; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UFortChallengeBundleItemDefinition* BundleData; // 0x30(0x08)
	struct UFortQuestItem* QuestItem; // 0x38(0x08)
};

// Class FortniteUI.AthenaChallengeImageGridEntry
// Size: 0x10c0 (Inherited: 0x1070)
struct UAthenaChallengeImageGridEntry : UCommonButtonLegacy {
	char pad_1070[0x18]; // 0x1070(0x18)
	struct UCommonLazyImage* Image_Brush; // 0x1088(0x08)
	bool bSelected; // 0x1090(0x01)
	char pad_1091[0x3]; // 0x1091(0x03)
	int32_t GridLocation; // 0x1094(0x04)
	int32_t Column; // 0x1098(0x04)
	int32_t Row; // 0x109c(0x04)
	char pad_10A0[0x20]; // 0x10a0(0x20)

	void TransitionFromOwnedToCompletedState(); // Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromOwnedToCompletedState // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void TransitionFromLockedToOwnedState(); // Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromLockedToOwnedState // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetupLockedToOwnState(); // Function FortniteUI.AthenaChallengeImageGridEntry.SetupLockedToOwnState // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnChallengeSet(bool bIsComplete, bool bIsLocked); // Function FortniteUI.AthenaChallengeImageGridEntry.OnChallengeSet // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeInviteFriendPrompt
// Size: 0x2c0 (Inherited: 0x2b8)
struct UAthenaChallengeInviteFriendPrompt : UUserWidget {
	struct URichTextBlock* RichText_InviteFriendMessage; // 0x2b8(0x08)
};

// Class FortniteUI.AthenaChallengeRewardDisplayEntry
// Size: 0x2c8 (Inherited: 0x2b8)
struct UAthenaChallengeRewardDisplayEntry : UUserWidget {
	struct UFortLazyImage* LazyImage_RewardIcon; // 0x2b8(0x08)
	struct UCommonTextBlock* Text_RewardQuantity; // 0x2c0(0x08)
};

// Class FortniteUI.AthenaChallengeRewardDisplay
// Size: 0x2c8 (Inherited: 0x2b8)
struct UAthenaChallengeRewardDisplay : UUserWidget {
	struct UDynamicEntryBox* EntryBox_Rewards; // 0x2b8(0x08)
	struct UImage* Image_CompletionIcon; // 0x2c0(0x08)
};

// Class FortniteUI.AthenaChallengeListEntryBase
// Size: 0x2e8 (Inherited: 0x2e0)
struct UAthenaChallengeListEntryBase : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void StartHighlight(); // Function FortniteUI.AthenaChallengeListEntryBase.StartHighlight // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void EndHighlight(); // Function FortniteUI.AthenaChallengeListEntryBase.EndHighlight // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void BP_OnChallengeInfoSet(bool bDisabled); // Function FortniteUI.AthenaChallengeListEntryBase.BP_OnChallengeInfoSet // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
// Size: 0x310 (Inherited: 0x2e8)
struct UAthenaChallengeTreeEntry_ChallengeSet : UAthenaChallengeListEntryBase {
	char pad_2E8[0x10]; // 0x2e8(0x10)
	struct UCommonTextBlock* Text_ChallengeSetName; // 0x2f8(0x08)
	struct UCommonTextBlock* Text_ChallengeSetContext; // 0x300(0x08)
	struct UCommonTextBlock* Text_PercentComplete; // 0x308(0x08)

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaChallengeTreeEntry_ChallengeSet.OnChallengeSetEstablished // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeListEntry_Challenge
// Size: 0x310 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_Challenge : UAthenaChallengeListEntryBase {
	char pad_2E8[0x10]; // 0x2e8(0x10)
	bool bHideProgressBar; // 0x2f8(0x01)
	char pad_2F9[0x7]; // 0x2f9(0x07)
	struct UCommonRichTextBlock* RichText_ChallengeDesc; // 0x300(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x308(0x08)

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled); // Function FortniteUI.AthenaChallengeListEntry_Challenge.OnPartyAssistEnabledChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bIsGroupChallenge, bool bCompact, bool HideRewards); // Function FortniteUI.AthenaChallengeListEntry_Challenge.OnChallengeInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	int32_t GetChallengeWeight(); // Function FortniteUI.AthenaChallengeListEntry_Challenge.GetChallengeWeight // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9aefa5c
	void BP_HandleIsTrackedChallengeChanged(bool bIsTrackedChallenge); // Function FortniteUI.AthenaChallengeListEntry_Challenge.BP_HandleIsTrackedChallengeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
// Size: 0x378 (Inherited: 0x310)
struct UAthenaChallengeListEntry_DetailedChallenge : UAthenaChallengeListEntry_Challenge {
	char pad_310[0x10]; // 0x310(0x10)
	bool bHasAnyOptionsAvailable; // 0x320(0x01)
	bool bIsDisplayingChallengeActions; // 0x321(0x01)
	char pad_322[0x6]; // 0x322(0x06)
	struct FDataTableRowHandle BackAction; // 0x328(0x10)
	struct FDataTableRowHandle CloseChallengeOptionsAction; // 0x338(0x10)
	struct UWidgetAnimation* BoundAnim_ShowChallengeOptions; // 0x348(0x08)
	struct UButton* SimpleButton_TopClickArea; // 0x350(0x08)
	struct UAthenaChallengeRewardDisplay* Reward_QuestReward; // 0x358(0x08)
	struct UCommonButtonLegacy* Button_PartyAssist; // 0x360(0x08)
	struct UCommonButtonLegacy* Button_ReplaceChallenge; // 0x368(0x08)
	struct UCommonRichTextBlock* RichText_ActionInfo; // 0x370(0x08)

	void HandleUpperAreaClicked(); // Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleUpperAreaClicked // (Final|Native|Private) // @ game+0x9aefc00
	void HandleCloseChallengeOptionsInputAction(bool& bPassThrough); // Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleCloseChallengeOptionsInputAction // (Final|Native|Private|HasOutParms) // @ game+0x9aefabc
};

// Class FortniteUI.AthenaChallengeListEntry_Header
// Size: 0x2f0 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_Header : UAthenaChallengeListEntryBase {
	struct UCommonTextBlock* Text_SectionTitle; // 0x2e8(0x08)

	void OnSectionTypeSet(enum class EChallengeListSection SectionType); // Function FortniteUI.AthenaChallengeListEntry_Header.OnSectionTypeSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
// Size: 0x300 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_CompletionReward : UAthenaChallengeListEntryBase {
	struct UAthenaChallengeRewardDisplay* Reward_CompletionReward; // 0x2e8(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x2f0(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x2f8(0x08)

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaChallengeListEntry_CompletionReward.OnRewardInfoSet // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
// Size: 0x330 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_StoreOffer : UAthenaChallengeListEntryBase {
	struct TSoftClassPtr<UObject> OfferDetailsWidgetClass; // 0x2e8(0x28)
	struct UFortStoreFrontOfferInfo* OfferInfo; // 0x310(0x08)
	struct UButton* SimpleButton_ClickArea; // 0x318(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x320(0x08)
	struct UFortLazyImage* LazyImage_SpecialOffer; // 0x328(0x08)

	void OnOfferSet(); // Function FortniteUI.AthenaChallengeListEntry_StoreOffer.OnOfferSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleClicked(); // Function FortniteUI.AthenaChallengeListEntry_StoreOffer.HandleClicked // (Final|Native|Protected) // @ game+0x9aefaa8
};

// Class FortniteUI.AthenaChallengeListEntry_Custom
// Size: 0x2f0 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_Custom : UAthenaChallengeListEntryBase {
	struct URichTextBlock* RichTextBlock_DisplayText; // 0x2e8(0x08)
};

// Class FortniteUI.AthenaChallengeListEntry_PartyUp
// Size: 0x2e8 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_PartyUp : UAthenaChallengeListEntryBase {

	void HandleTransientQuestStarted(struct UFortQuestItem* QuestItem, struct UFortQuestItemDefinition_Athena* PreceedingQuestDefAthena); // Function FortniteUI.AthenaChallengeListEntry_PartyUp.HandleTransientQuestStarted // (Final|Native|Private) // @ game+0x9af0cd0
	void HandleTransientQuestRemoved(struct UFortQuestItem* QuestItem); // Function FortniteUI.AthenaChallengeListEntry_PartyUp.HandleTransientQuestRemoved // (Final|Native|Private) // @ game+0x9af0bd4
};

// Class FortniteUI.AthenaChallengeListEntry_AllQuestsComplete
// Size: 0x2e8 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_AllQuestsComplete : UAthenaChallengeListEntryBase {
};

// Class FortniteUI.AthenaChallengeListEntry_GoalCard
// Size: 0x2f0 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_GoalCard : UAthenaChallengeListEntryBase {
	struct UAthenaGoalsPageQuestCard* GoalCard; // 0x2e8(0x08)

	void OnChallengeDataSet(bool bDisabled); // Function FortniteUI.AthenaChallengeListEntry_GoalCard.OnChallengeDataSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeListEntry_LockedQuest
// Size: 0x380 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_LockedQuest : UAthenaChallengeListEntryBase {
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeUntilQuestUnlocks; // 0x2e8(0x08)
	struct URichTextBlock* RichTextBlock_ChallengesUntilUnlocked; // 0x2f0(0x08)
	struct URichTextBlock* RichTextBlock_TimeUntilUnlocked; // 0x2f8(0x08)
	struct FLockedQuestData LockedQuestData; // 0x300(0x48)
	struct FText DisplayNameFallback; // 0x348(0x18)
	struct FText DisplayTextOverride; // 0x360(0x18)
	char pad_378[0x8]; // 0x378(0x08)

	void OnInitDisplayText(enum class ELockedWidgetUnlockType& InUnlockType); // Function FortniteUI.AthenaChallengeListEntry_LockedQuest.OnInitDisplayText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	struct FTimespan GetStartingUnlockTime(); // Function FortniteUI.AthenaChallengeListEntry_LockedQuest.GetStartingUnlockTime // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x767d538
};

// Class FortniteUI.AthenaChallengeListEntry_NpcQuest
// Size: 0x4f0 (Inherited: 0x2e8)
struct UAthenaChallengeListEntry_NpcQuest : UAthenaChallengeListEntryBase {
	struct URichTextBlock* RichText_ChallengeDesc; // 0x2e8(0x08)
	struct URichTextBlock* RichText_ObjectivesCompletedSelected; // 0x2f0(0x08)
	struct URichTextBlock* RichText_ObjectivesCompletedUnselected; // 0x2f8(0x08)
	struct UFortLazyImage* LazyImage_SourceIcon; // 0x300(0x08)
	struct URichTextBlock* RichText_SourceName; // 0x308(0x08)
	struct URichTextBlock* RichText_FlavorText; // 0x310(0x08)
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeRemaining; // 0x318(0x08)
	struct UCommonButtonBase* Button_RemoveQuest; // 0x320(0x08)
	struct UFortHoldableButton* Button_ReplaceQuest; // 0x328(0x08)
	struct USizeBox* SizeBox_CornerUL; // 0x330(0x08)
	struct UFortLazyImage* LazyImage_IconUL; // 0x338(0x08)
	struct UAthenaChallengeRewards* UserWidget_Rewards; // 0x340(0x08)
	struct UCommonTextBlock* Text_QuestID; // 0x348(0x08)
	struct UCommonTextBlock* Text_ReplaceQuest; // 0x350(0x08)
	struct USizeBox* SizeBox_ReplaceQuest; // 0x358(0x08)
	struct USizeBox* SizeBox_StyleSize; // 0x360(0x08)
	struct UFortLazyImage* LazyImage_ReplaceQuestIndicator; // 0x368(0x08)
	struct UCommonActionWidget* ActionWidget_ReplaceQuest; // 0x370(0x08)
	struct USizeBox* SizeBox_PlayerLeftMatch; // 0x378(0x08)
	struct FText TextConfirmRemoveQuestTitle; // 0x380(0x18)
	struct FText TextConfirmRemoveQuestDescription; // 0x398(0x18)
	struct FText TextReplaceQuestGamepad; // 0x3b0(0x18)
	struct FText TextReplaceQuestMouse; // 0x3c8(0x18)
	struct FText TextReplaceQuestTouch; // 0x3e0(0x18)
	struct FText TextExpiredQuest; // 0x3f8(0x18)
	struct FText TextExpiredQuestFrontEnd; // 0x410(0x18)
	struct TSoftObjectPtr<UObject> DefaultPortraitDisplayAsset; // 0x428(0x28)
	struct TSoftObjectPtr<UObject> PinnedQuestIcon; // 0x450(0x28)
	struct TSoftObjectPtr<UObject> SharedQuestIcon; // 0x478(0x28)
	char pad_4A0[0x18]; // 0x4a0(0x18)
	struct UHorizontalBox* HorizontalBox_DefaultWidgetsRoot; // 0x4b8(0x08)
	enum class EChallengeListEntryType EntryType; // 0x4c0(0x01)
	char pad_4C1[0x2f]; // 0x4c1(0x2f)

	void UpdateIconUL(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.UpdateIconUL // (Final|Native|Private) // @ game+0x9af0f94
	void OnSetState(bool bIsCompleted, bool bIsLocked, bool bIsPartyAssisted, bool bIsGroupChallenge); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.OnSetState // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnReplaceQuestConfirmed__DelegateSignature(); // DelegateFunction FortniteUI.AthenaChallengeListEntry_NpcQuest.OnReplaceQuestConfirmed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	bool IsSelected(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.IsSelected // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af0e6c
	bool IsChallengeRefreshingDaily(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.IsChallengeRefreshingDaily // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x504d9e0
	void HandleQuestSeen(struct UFortAccountItem* AccountItem); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.HandleQuestSeen // (Final|Native|Private) // @ game+0x9af0a40
	void HandleObjectiveUpdate(struct UFortQuestItem* QuestItem, struct FName Objective, int32_t AchievedCount, int32_t GoalCount); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.HandleObjectiveUpdate // (Final|Native|Private) // @ game+0x9af03f8
	bool GetIsCompleted(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.GetIsCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x504d9c0
	void BP_OnTimerSet(enum class EAthenaChallengeTimerState TimerState); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnTimerSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnSelectedForQuestReplacing(bool bSelected); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnSelectedForQuestReplacing // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnRaritySet(enum class EFortRarity Rarity); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnRaritySet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnChallengeSeenChanged(bool bChallengeSeen); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnChallengeSeenChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_FormatForChallengeOwnerLeftGame(bool bHasOwnerLeftGame); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_FormatForChallengeOwnerLeftGame // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeListViewBase
// Size: 0x368 (Inherited: 0x260)
struct UAthenaChallengeListViewBase : UListViewBase {
	char pad_260[0xd8]; // 0x260(0xd8)
	struct UAthenaQuestEntryVisualData* VisualData; // 0x338(0x08)
	char pad_340[0x20]; // 0x340(0x20)
	float EntrySpacing; // 0x360(0x04)
	char pad_364[0x4]; // 0x364(0x04)
};

// Class FortniteUI.AthenaChallengeNpcQuestCounter
// Size: 0x328 (Inherited: 0x2b8)
struct UAthenaChallengeNpcQuestCounter : UUserWidget {
	struct FGameplayTagContainer ExcludedTabs; // 0x2b8(0x20)
	struct FText Text_PartyTab; // 0x2d8(0x18)
	struct FText Text_PersonalTab; // 0x2f0(0x18)
	char pad_308[0x8]; // 0x308(0x08)
	struct URichTextBlock* RichText_HeaderDesc; // 0x310(0x08)
	struct URichTextBlock* RichText_MaxQuests; // 0x318(0x08)
	struct URichTextBlock* RichText_NumActiveQuests; // 0x320(0x08)

	void UpdateVisibility(struct FGameplayTag& CurrentTabTag); // Function FortniteUI.AthenaChallengeNpcQuestCounter.UpdateVisibility // (Final|Native|Public|HasOutParms) // @ game+0x9af0fa8
	void HandleTransientQuestStarted(struct UFortQuestItem* QuestItem, struct UFortQuestItemDefinition_Athena* PreceedingQuestDefAthena); // Function FortniteUI.AthenaChallengeNpcQuestCounter.HandleTransientQuestStarted // (Final|Native|Private) // @ game+0x9af0d8c
	void HandleTransientQuestRemoved(struct UFortQuestItem* QuestItem); // Function FortniteUI.AthenaChallengeNpcQuestCounter.HandleTransientQuestRemoved // (Final|Native|Private) // @ game+0x9af0c50
	void HandleQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool bDisplayStatusUpdate, bool bDisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengeNpcQuestCounter.HandleQuestUpdate // (Final|Native|Private) // @ game+0x9af0ae4
};

// Class FortniteUI.AthenaChallengeNpcQuestListView
// Size: 0x3c0 (Inherited: 0x368)
struct UAthenaChallengeNpcQuestListView : UAthenaChallengeListViewBase {
	char pad_368[0x48]; // 0x368(0x48)
	struct UAthenaChallengeListEntry_Header* SectionHeaderEntryClass; // 0x3b0(0x08)
	struct UAthenaChallengeListEntry_Header* DisabledHeaderEntryClass; // 0x3b8(0x08)
};

// Class FortniteUI.AthenaChallengeProgressBar
// Size: 0x2d0 (Inherited: 0x2b8)
struct UAthenaChallengeProgressBar : UUserWidget {
	bool bHideProgressBar; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)
	struct UProgressBar* ProgressBar_StepsCompleted; // 0x2c0(0x08)
	struct UCommonRichTextBlock* RichText_Progress; // 0x2c8(0x08)

	void SetPercentValueForMaterialNumber(int32_t PercentValue); // Function FortniteUI.AthenaChallengeProgressBar.SetPercentValueForMaterialNumber // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengePunchCard
// Size: 0x348 (Inherited: 0x2e0)
struct UAthenaChallengePunchCard : UCommonUserWidget {
	int32_t MaxPunchesAllowed; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct UDynamicEntryBox* Box_PunchSlots; // 0x2e8(0x08)
	struct UCommonTextBlock* Text_Title; // 0x2f0(0x08)
	struct UCommonTextBlock* Text_Description; // 0x2f8(0x08)
	char pad_300[0x30]; // 0x300(0x30)
	bool bInitializedWidgetPool; // 0x330(0x01)
	bool bBundleIsKnown; // 0x331(0x01)
	bool bBangShown; // 0x332(0x01)
	char pad_333[0x1]; // 0x333(0x01)
	struct TWeakObjectPtr<struct UFortChallengeBundleItemDefinition> WeakBundleDef; // 0x334(0x08)
	char pad_33C[0x4]; // 0x33c(0x04)
	struct FDateTime MostRecentPunch; // 0x340(0x08)

	void UpdateChallengePunchCard(struct UFortChallengeBundleItem* Bundle, struct UFortQuestItem* CopmpletedQuest); // Function FortniteUI.AthenaChallengePunchCard.UpdateChallengePunchCard // (Final|Native|Public) // @ game+0x9af0ed0
	void UnfocusPunchCard(); // Function FortniteUI.AthenaChallengePunchCard.UnfocusPunchCard // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void TryToClearBangState(); // Function FortniteUI.AthenaChallengePunchCard.TryToClearBangState // (Final|Native|Public|BlueprintCallable) // @ game+0x9af0ebc
	void ShowWidget(); // Function FortniteUI.AthenaChallengePunchCard.ShowWidget // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void SetUpEncodedName(struct FString Name, int32_t Count); // Function FortniteUI.AthenaChallengePunchCard.SetUpEncodedName // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetUnkownState(bool bKnown); // Function FortniteUI.AthenaChallengePunchCard.SetUnkownState // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle); // Function FortniteUI.AthenaChallengePunchCard.SetStyle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void SetProgressCount(int32_t AchivedCount, int32_t GoalCount); // Function FortniteUI.AthenaChallengePunchCard.SetProgressCount // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetBangState(bool bShowBang); // Function FortniteUI.AthenaChallengePunchCard.SetBangState // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void HideProgressCount(bool bBundleCompleted); // Function FortniteUI.AthenaChallengePunchCard.HideProgressCount // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void FocusPunchCard(); // Function FortniteUI.AthenaChallengePunchCard.FocusPunchCard // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void FinishedPunchingCard(bool bPlayOutro); // Function FortniteUI.AthenaChallengePunchCard.FinishedPunchingCard // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengePunchCardEntry
// Size: 0x320 (Inherited: 0x2e0)
struct UAthenaChallengePunchCardEntry : UCommonUserWidget {
	struct FName IconParamName; // 0x2e0(0x04)
	int32_t SlotIndex; // 0x2e4(0x04)
	bool bIsBeingPlaced; // 0x2e8(0x01)
	char pad_2E9[0x1f]; // 0x2e9(0x1f)
	struct UCommonTextBlock* Text_RewardQuantity; // 0x308(0x08)
	struct UCommonRichTextBlock* Text_UnlockDate; // 0x310(0x08)
	struct UFortLazyImage* LazyImage_Stamp; // 0x318(0x08)

	void SetToDefaultSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetToDefaultSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle); // Function FortniteUI.AthenaChallengePunchCardEntry.SetStyle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void SetIsNonsequentialSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsNonsequentialSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetIsLastSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsLastSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetIsFirstSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsFirstSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnPlacedEntry(); // Function FortniteUI.AthenaChallengePunchCardEntry.OnPlacedEntry // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnFinishedPlacingEntry(); // Function FortniteUI.AthenaChallengePunchCardEntry.OnFinishedPlacingEntry // (Final|Native|Public|BlueprintCallable) // @ game+0x9af0e84
};

// Class FortniteUI.AthenaChallengeRecapEntry
// Size: 0x340 (Inherited: 0x2e0)
struct UAthenaChallengeRecapEntry : UCommonUserWidget {
	char pad_2E0[0x48]; // 0x2e0(0x48)
	struct UCommonTextBlock* Text_QuestObjective; // 0x328(0x08)
	struct UCommonTextBlock* Text_CompletionCount; // 0x330(0x08)
	struct UWidgetSwitcher* Switcher_Progression; // 0x338(0x08)

	void UpdateProgressBar(float StartingPercent, float EndingPercent); // Function FortniteUI.AthenaChallengeRecapEntry.UpdateProgressBar // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void StartOutroAnim(); // Function FortniteUI.AthenaChallengeRecapEntry.StartOutroAnim // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void StartIntroAnim(); // Function FortniteUI.AthenaChallengeRecapEntry.StartIntroAnim // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OutroFinished(); // Function FortniteUI.AthenaChallengeRecapEntry.OutroFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x9af0ea0
	void IntroFinished(); // Function FortniteUI.AthenaChallengeRecapEntry.IntroFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x9af0e50
};

// Class FortniteUI.AthenaChallengeRewards
// Size: 0x2f8 (Inherited: 0x2b8)
struct UAthenaChallengeRewards : UUserWidget {
	struct UFortLazyImage* LazyImage_RewardIcon; // 0x2b8(0x08)
	struct UCommonTextBlock* Text_RewardCount; // 0x2c0(0x08)
	struct UImage* Image_RewardBacking; // 0x2c8(0x08)
	struct UFortDynamicEntryBox* DynamicBox_MultiMarkers; // 0x2d0(0x08)
	char pad_2D8[0x20]; // 0x2d8(0x20)
};

// Class FortniteUI.AthenaChallengeRewardsMultiMarker
// Size: 0x2b8 (Inherited: 0x2b8)
struct UAthenaChallengeRewardsMultiMarker : UUserWidget {

	void BP_OnSetMarkerActive(bool bIsActive); // Function FortniteUI.AthenaChallengeRewardsMultiMarker.BP_OnSetMarkerActive // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeRewardTrackEntry
// Size: 0x348 (Inherited: 0x2e0)
struct UAthenaChallengeRewardTrackEntry : UCommonUserWidget {
	struct FName MissionRewardParamName; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct TSoftObjectPtr<UFortItemDefinition> RewardToRepresent; // 0x2e8(0x28)
	int32_t BundleRewardIndex; // 0x310(0x04)
	char pad_314[0x4]; // 0x314(0x04)
	struct UImage* Image_ConnectorLeft; // 0x318(0x08)
	struct UImage* Image_ConnectorRight; // 0x320(0x08)
	struct UAthenaChallengeRewardDisplayEntry* MissionReward; // 0x328(0x08)
	char pad_330[0x18]; // 0x330(0x18)

	void StyleChange(bool bViewingPrestige); // Function FortniteUI.AthenaChallengeRewardTrackEntry.StyleChange // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetToDefaultState(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetToDefaultState // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetLastNodeInTrack(bool bIsLast); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetLastNodeInTrack // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetAsCurrentPreviewItem(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetAsCurrentPreviewItem // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void NextRewardToEarn(bool bNext); // Function FortniteUI.AthenaChallengeRewardTrackEntry.NextRewardToEarn // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void CompletedNextNode(bool bAnimate); // Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedNextNode // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void CompletedCurrentNode(bool bAnimate, bool LastReward); // Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedCurrentNode // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ClearPreviewSelection(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.ClearPreviewSelection // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeSetListView
// Size: 0x3c0 (Inherited: 0x368)
struct UAthenaChallengeSetListView : UAthenaChallengeListViewBase {
	struct FAthenaChallengeListVisualOptions ListVisualOptions; // 0x368(0x0c)
	bool bHideHeaders; // 0x374(0x01)
	bool bHideCompletionRewards; // 0x375(0x01)
	bool bHideQuestRewards; // 0x376(0x01)
	bool bUseCompactActionInfo; // 0x377(0x01)
	bool bAllowFocus; // 0x378(0x01)
	char pad_379[0x2f]; // 0x379(0x2f)
	struct UAthenaChallengeListEntry_Header* SectionHeaderEntryClass; // 0x3a8(0x08)
	struct UAthenaChallengeListEntry_CompletionReward* CompletionRewardEntryClass; // 0x3b0(0x08)
	struct UAthenaChallengeListEntry_StoreOffer* SpecialOfferEntryClass; // 0x3b8(0x08)
};

// Class FortniteUI.AthenaChallengesWidget
// Size: 0x3c8 (Inherited: 0x320)
struct UAthenaChallengesWidget : UFortHUDElementWidget {
	char pad_320[0x40]; // 0x320(0x40)
	struct UCommonTextBlock* Text_Challenges; // 0x360(0x08)
	struct UDynamicEntryBox* DynamicEntryBox_ChallengeEntries; // 0x368(0x08)
	char pad_370[0x50]; // 0x370(0x50)
	struct FFortPrioritizedWidgetData PrioritizedWidgetData; // 0x3c0(0x02)
	bool bXPSystemRequiredForChallenges; // 0x3c2(0x01)
	char pad_3C3[0x5]; // 0x3c3(0x05)

	bool IsXPSystemRequiredForChallenges(); // Function FortniteUI.AthenaChallengesWidget.IsXPSystemRequiredForChallenges // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x504de30
	void HandleDisplayDynamicQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengesWidget.HandleDisplayDynamicQuestUpdate // (Native|Protected) // @ game+0x9af1750
	void BP_WidgetIsFinished(); // Function FortniteUI.AthenaChallengesWidget.BP_WidgetIsFinished // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnWidgetActivated(); // Function FortniteUI.AthenaChallengesWidget.BP_OnWidgetActivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaChallengeTreeView
// Size: 0x3e8 (Inherited: 0x368)
struct UAthenaChallengeTreeView : UAthenaChallengeListViewBase {
	char pad_368[0x70]; // 0x368(0x70)
	struct UAthenaChallengeTreeEntry_ChallengeSet* SetHeaderEntryClass; // 0x3d8(0x08)
	bool bReturnFocusToSelection; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)

	void HandleQuestsUpdated(); // Function FortniteUI.AthenaChallengeTreeView.HandleQuestsUpdated // (Final|Native|Private) // @ game+0x9af1864
};

// Class FortniteUI.AthenaCollectionItemToast
// Size: 0x3a0 (Inherited: 0x320)
struct UAthenaCollectionItemToast : UFortHUDElementWidget {
	char pad_320[0x28]; // 0x320(0x28)
	float OpenCollectionScreenInputHoldTime; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct TArray<struct FName> BoundActions; // 0x350(0x10)
	struct UCommonTextBlock* Text_ItemNumber; // 0x360(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x368(0x08)
	struct UCommonLazyImage* LazyImage_ItemImage; // 0x370(0x08)
	struct UButton* Button_MobileClickCatcher; // 0x378(0x08)
	char pad_380[0x20]; // 0x380(0x20)

	void ResetToast(); // Function FortniteUI.AthenaCollectionItemToast.ResetToast // (Native|Protected) // @ game+0x684b118
	void HandleMobileClick(); // Function FortniteUI.AthenaCollectionItemToast.HandleMobileClick // (Final|Native|Private) // @ game+0x9af1850
	bool BPCallableIsDesignTime(); // Function FortniteUI.AthenaCollectionItemToast.BPCallableIsDesignTime // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1feae90
	void BP_OnToastUpdated(enum class EFortCollectedState CollectedState, int32_t NumCollected); // Function FortniteUI.AthenaCollectionItemToast.BP_OnToastUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnToastReset(); // Function FortniteUI.AthenaCollectionItemToast.BP_OnToastReset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnDisplayToast(); // Function FortniteUI.AthenaCollectionItemToast.BP_OnDisplayToast // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionItemToastCharacter
// Size: 0x3c0 (Inherited: 0x3a0)
struct UAthenaCollectionItemToastCharacter : UAthenaCollectionItemToast {
	struct FText NumLocationsFormat; // 0x3a0(0x18)
	struct UCommonRichTextBlock* RichText_NumLocations; // 0x3b8(0x08)

	void BP_OnLocationsSet(int32_t NumFound, int32_t NumLocations); // Function FortniteUI.AthenaCollectionItemToastCharacter.BP_OnLocationsSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionItemToastFishing
// Size: 0x3e8 (Inherited: 0x3a0)
struct UAthenaCollectionItemToastFishing : UAthenaCollectionItemToast {
	struct FText LengthFormat; // 0x3a0(0x18)
	struct FText LeaderLengthFormat; // 0x3b8(0x18)
	struct UCommonRichTextBlock* RichText_Length; // 0x3d0(0x08)
	struct UCommonTextBlock* Text_LeaderName; // 0x3d8(0x08)
	struct UCommonRichTextBlock* RichText_LeaderLength; // 0x3e0(0x08)

	void BP_OnUnlockedNewClue(); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnUnlockedNewClue // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnStarRatingSet(int32_t StarRating); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnRankSet(int32_t Rank, int32_t NumEntries); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnRankSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnNormalizedLengthSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionItemToastSwitcher
// Size: 0x3c8 (Inherited: 0x320)
struct UAthenaCollectionItemToastSwitcher : UFortHUDElementWidget {
	char pad_320[0x40]; // 0x320(0x40)
	struct FMulticastInlineDelegate OnResetToast; // 0x360(0x10)
	char pad_370[0x20]; // 0x370(0x20)
	float TimeToShowToast; // 0x390(0x04)
	float ActivationDelay; // 0x394(0x04)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x398(0x02)
	char pad_39A[0x6]; // 0x39a(0x06)
	struct UCommonVisibilitySwitcher* WidgetSwitcher_Toasts; // 0x3a0(0x08)
	struct UAthenaCollectionItemToast* ActiveCollectionItemToastWidget; // 0x3a8(0x08)
	char pad_3B0[0x10]; // 0x3b0(0x10)
	bool bHasPrioritizedWidgetFocus; // 0x3c0(0x01)
	char pad_3C1[0x7]; // 0x3c1(0x07)
};

// Class FortniteUI.AthenaCollectionLeaderboard
// Size: 0x430 (Inherited: 0x3f8)
struct UAthenaCollectionLeaderboard : UCommonActivatableWidget {
	float LeaderboardScrollSpeed; // 0x3f8(0x04)
	float LeaderboardScrollInitialDelay; // 0x3fc(0x04)
	struct UScrollBox* ScrollBox_Leaderboard; // 0x400(0x08)
	struct UDynamicEntryBox* EntryBox_Leaderboard; // 0x408(0x08)
	char pad_410[0x20]; // 0x410(0x20)
};

// Class FortniteUI.AthenaCollectionOverlayEntry
// Size: 0x300 (Inherited: 0x2e0)
struct UAthenaCollectionOverlayEntry : UCommonUserWidget {
	struct FText EmptyDisplayNameText; // 0x2e0(0x18)
	struct UCommonTextBlock* Text_DisplayName; // 0x2f8(0x08)

	void BP_OnDisplayNameSet(struct FString DisplayName); // Function FortniteUI.AthenaCollectionOverlayEntry.BP_OnDisplayNameSet // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionLeaderboardEntry
// Size: 0x340 (Inherited: 0x300)
struct UAthenaCollectionLeaderboardEntry : UAthenaCollectionOverlayEntry {
	struct FText ValueTextFormat; // 0x300(0x18)
	int32_t ValueMinimumFractionalDigits; // 0x318(0x04)
	int32_t ValueMaximumFractionalDigits; // 0x31c(0x04)
	bool bValueIsFloat; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct UCommonTextBlock* Text_Placement; // 0x328(0x08)
	struct UCommonRichTextBlock* RichText_Value; // 0x330(0x08)
	struct UFortSocialAvatarIcon* AvatarIcon; // 0x338(0x08)

	void BP_OnValueSet(float Value); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnValueSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnPlacementSet(int32_t Placement); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnPlacementSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnLeaderboardEntryReset(); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnLeaderboardEntryReset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnLeaderboardEntryInitialized(bool bIsLocalPlayer); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnLeaderboardEntryInitialized // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionLeaderboardEntryFishing
// Size: 0x350 (Inherited: 0x340)
struct UAthenaCollectionLeaderboardEntryFishing : UAthenaCollectionLeaderboardEntry {
	struct FName ParamName_Has2Stars; // 0x340(0x04)
	struct FName ParamName_Has3Stars; // 0x344(0x04)
	struct UImage* Image_Stars; // 0x348(0x08)

	void BP_OnStarRatingSet(int32_t StarRating); // Function FortniteUI.AthenaCollectionLeaderboardEntryFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionListColumnEntry
// Size: 0x368 (Inherited: 0x2e0)
struct UAthenaCollectionListColumnEntry : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct UDynamicEntryBox* EntryBox_ListEntries; // 0x2e8(0x08)
	char pad_2F0[0x78]; // 0x2f0(0x78)
};

// Class FortniteUI.AthenaCollectionListEntry
// Size: 0x1100 (Inherited: 0x1070)
struct UAthenaCollectionListEntry : UCommonButtonLegacy {
	char pad_1070[0x10]; // 0x1070(0x10)
	struct UImage* Image_Icon; // 0x1080(0x08)
	char pad_1088[0x8]; // 0x1088(0x08)
	struct UCommonTextBlock* Text_Number; // 0x1090(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x1098(0x08)
	char pad_10A0[0x60]; // 0x10a0(0x60)

	void BP_OnEntryReset(); // Function FortniteUI.AthenaCollectionListEntry.BP_OnEntryReset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnEntryImageSet(); // Function FortniteUI.AthenaCollectionListEntry.BP_OnEntryImageSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnEntryIconLoaded(struct UObject* EntryIcon); // Function FortniteUI.AthenaCollectionListEntry.BP_OnEntryIconLoaded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnCollectionStateSet(enum class EFortCollectedState CollectedState); // Function FortniteUI.AthenaCollectionListEntry.BP_OnCollectionStateSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnCollectedByFriendSet(bool bCollectedByFriend); // Function FortniteUI.AthenaCollectionListEntry.BP_OnCollectedByFriendSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionListEntryCharacter
// Size: 0x1110 (Inherited: 0x1100)
struct UAthenaCollectionListEntryCharacter : UAthenaCollectionListEntry {
	struct UImage* Image_Background; // 0x10f8(0x08)
	struct FName ParamName_ItemIcon; // 0x1100(0x04)
	struct FName ParamName_IsDiscovered; // 0x1104(0x04)
	struct FName ParamName_IsComplete; // 0x1108(0x04)

	void BP_OnLocationsFoundSet(int32_t NumFound, int32_t NumAvailable, bool bAllFound); // Function FortniteUI.AthenaCollectionListEntryCharacter.BP_OnLocationsFoundSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionListEntryFishing
// Size: 0x1110 (Inherited: 0x1100)
struct UAthenaCollectionListEntryFishing : UAthenaCollectionListEntry {
	struct FName ParamName_ItemIcon; // 0x10f8(0x04)
	struct FName ParamName_IsDiscovered; // 0x10fc(0x04)
	struct FName ParamName_ItemSize; // 0x1100(0x04)
	struct FName ParamName_Has2Stars; // 0x1104(0x04)
	struct FName ParamName_Has3Stars; // 0x1108(0x04)

	void BP_OnStarRatingSet(int32_t StarRating); // Function FortniteUI.AthenaCollectionListEntryFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength); // Function FortniteUI.AthenaCollectionListEntryFishing.BP_OnNormalizedLengthSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionListView
// Size: 0x3f0 (Inherited: 0x260)
struct UAthenaCollectionListView : UListViewBase {
	char pad_260[0x110]; // 0x260(0x110)
	float EntrySpacing; // 0x370(0x04)
	int32_t NumRows; // 0x374(0x04)
	char pad_378[0x70]; // 0x378(0x70)
	bool bSelectEntryOnFocusForTouch; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
};

// Class FortniteUI.AthenaCollectionLocationEntry
// Size: 0x300 (Inherited: 0x300)
struct UAthenaCollectionLocationEntry : UAthenaCollectionOverlayEntry {

	void BP_OnLocationsFoundSet(enum class ELocationEntryState EntryState); // Function FortniteUI.AthenaCollectionLocationEntry.BP_OnLocationsFoundSet // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionPlayerProgress
// Size: 0x300 (Inherited: 0x2e0)
struct UAthenaCollectionPlayerProgress : UCommonUserWidget {
	struct UCommonTextBlock* Text_PlayerName; // 0x2e0(0x08)
	struct UCommonTextBlock* Text_Progress; // 0x2e8(0x08)
	struct UFortSocialAvatarIcon* AvatarIcon; // 0x2f0(0x08)
	char pad_2F8[0x8]; // 0x2f8(0x08)

	bool IsLocalPlayer(); // Function FortniteUI.AthenaCollectionPlayerProgress.IsLocalPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x935fce4
	int32_t GetNumCollected(); // Function FortniteUI.AthenaCollectionPlayerProgress.GetNumCollected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x74c0110
	void BP_OnShowPlayerInfoSet(bool bShowPlayerInfo); // Function FortniteUI.AthenaCollectionPlayerProgress.BP_OnShowPlayerInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnPlayerProgressInitialized(bool bIsLocalPlayer, int32_t NumCollected, int32_t NumToCollect); // Function FortniteUI.AthenaCollectionPlayerProgress.BP_OnPlayerProgressInitialized // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionPlayerProgressContainer
// Size: 0x320 (Inherited: 0x2e0)
struct UAthenaCollectionPlayerProgressContainer : UCommonUserWidget {
	struct UAthenaCollectionPlayerProgress* PlayerProgressClass; // 0x2e0(0x08)
	float CycleDelay; // 0x2e8(0x04)
	int32_t ShowLocalPlayerAfterNumEntries; // 0x2ec(0x04)
	struct TArray<struct UAthenaCollectionPlayerProgress*> CachedPlayerProgressEntries; // 0x2f0(0x10)
	char pad_300[0x20]; // 0x300(0x20)

	void BP_OnPlayerProgressEntriesCreated(struct TArray<struct UAthenaCollectionPlayerProgress*>& PlayerProgressEntries, int32_t NumToCollect); // Function FortniteUI.AthenaCollectionPlayerProgressContainer.BP_OnPlayerProgressEntriesCreated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void BP_OnPlayerProgressContainerReset(); // Function FortniteUI.AthenaCollectionPlayerProgressContainer.BP_OnPlayerProgressContainerReset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionScreenBase
// Size: 0x618 (Inherited: 0x3f8)
struct UAthenaCollectionScreenBase : UCommonActivatableWidget {
	char pad_3F8[0x18]; // 0x3f8(0x18)
	struct FAthenaMapScreenContainerTabInfo MapTabInfo; // 0x410(0x50)
	bool bUseMcpProfileData; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct FText CollectionName; // 0x468(0x18)
	struct FString CollectionType; // 0x480(0x10)
	struct FString CollectionCategory; // 0x490(0x10)
	struct FText UnknownText; // 0x4a0(0x18)
	struct FText UnknownDescription; // 0x4b8(0x18)
	struct TSoftObjectPtr<UObject> KnownEntryImage; // 0x4d0(0x28)
	struct TSoftObjectPtr<UObject> UnknownEntryImage; // 0x4f8(0x28)
	struct TSoftObjectPtr<UObject> KnownOverlayImage; // 0x520(0x28)
	struct TSoftObjectPtr<UObject> UnknownOverlayImage; // 0x548(0x28)
	struct FText PersonalBestTextFormat; // 0x570(0x18)
	char PersonalBestMinimumFractionalDigits; // 0x588(0x01)
	char PersonalBestMaximumFractionalDigits; // 0x589(0x01)
	char pad_58A[0x6]; // 0x58a(0x06)
	struct TSoftClassPtr<UObject> SoftInfoOverlayClass; // 0x590(0x28)
	struct UScrollBox* ScrollBox_List; // 0x5b8(0x08)
	struct UAthenaCollectionListView* CollectionListView; // 0x5c0(0x08)
	struct UContentWidget* Content_InfoOverlayContainer; // 0x5c8(0x08)
	struct UCommonButtonLegacy* Button_ToggleInfoOverlay; // 0x5d0(0x08)
	struct UCommonButtonLegacy* Button_Back; // 0x5d8(0x08)
	struct UAthenaCollectionPlayerProgressContainer* PlayerProgressContainer; // 0x5e0(0x08)
	bool bWantsToShowInfoOverlay; // 0x5e8(0x01)
	bool bForceOverlayToggleMobile; // 0x5e9(0x01)
	char pad_5EA[0x6]; // 0x5ea(0x06)
	struct UAthenaCollectionScreenInfoOverlay* InfoOverlay; // 0x5f0(0x08)
	struct UFortCollectionsDataTable* CollectionsDataTable; // 0x5f8(0x08)
	struct UFortCollectionData* CollectionData; // 0x600(0x08)
	char pad_608[0x10]; // 0x608(0x10)

	void CenterSelectedEntry(); // Function FortniteUI.AthenaCollectionScreenBase.CenterSelectedEntry // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af173c
	void BP_OnStartedLoading(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnStartedLoading // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnInfoOverlayDeactivated(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnInfoOverlayDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnInfoOverlayActivated(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnInfoOverlayActivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHandleSelectedEntryChanged(struct UAthenaCollectionListEntry* SelectedEntry); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnHandleSelectedEntryChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnFinishedLoading(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnFinishedLoading // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionScreenCharacter
// Size: 0x618 (Inherited: 0x618)
struct UAthenaCollectionScreenCharacter : UAthenaCollectionScreenBase {
};

// Class FortniteUI.AthenaCollectionScreenContainer
// Size: 0x550 (Inherited: 0x3f8)
struct UAthenaCollectionScreenContainer : UCommonActivatableWidget {
	char pad_3F8[0x20]; // 0x3f8(0x20)
	struct FAthenaMapScreenContainerTabInfo MapTabInfo; // 0x418(0x50)
	struct UCommonVisibilitySwitcher* VisibilitySwitcher_Content; // 0x468(0x08)
	struct UCommonButtonLegacy* MobileCloseButton; // 0x470(0x08)
	struct TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos; // 0x478(0x10)
	struct FDataTableRowHandle NextTabInputAction; // 0x488(0x10)
	struct FDataTableRowHandle PreviousTabInputAction; // 0x498(0x10)
	struct UDynamicEntryBox* EntryBox_TabButtons; // 0x4a8(0x08)
	struct UCommonTextBlock* Text_TabTitle; // 0x4b0(0x08)
	struct TArray<struct FAthenaCollectionScreenContainerTabInfo> ActiveTabInfos; // 0x4b8(0x10)
	char pad_4C8[0x88]; // 0x4c8(0x88)

	void EnableTabActions(); // Function FortniteUI.AthenaCollectionScreenContainer.EnableTabActions // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af2214
	void DisableTabActions(); // Function FortniteUI.AthenaCollectionScreenContainer.DisableTabActions // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af21e0
	void BP_OnShowTabsSet(bool bShowTabs); // Function FortniteUI.AthenaCollectionScreenContainer.BP_OnShowTabsSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionScreenContainerTabButton
// Size: 0x10b0 (Inherited: 0x1070)
struct UAthenaCollectionScreenContainerTabButton : UCommonButtonLegacy {
	struct UCommonLazyImage* LazyImage_Icon; // 0x1070(0x08)
	struct FString CollectionType; // 0x1078(0x10)
	struct FVector2D ImageSize_Mobile; // 0x1088(0x10)
	struct FText TabTitle; // 0x1098(0x18)

	void SetIcon(struct TSoftObjectPtr<UObject> LazyObject); // Function FortniteUI.AthenaCollectionScreenContainerTabButton.SetIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x9af26b8
	void BP_ShowBang(bool bShow); // Function FortniteUI.AthenaCollectionScreenContainerTabButton.BP_ShowBang // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionScreenFishing
// Size: 0x630 (Inherited: 0x618)
struct UAthenaCollectionScreenFishing : UAthenaCollectionScreenBase {
	struct FText RequiresProFishingRodText; // 0x618(0x18)
};

// Class FortniteUI.AthenaCollectionScreenInfoOverlay
// Size: 0x4c0 (Inherited: 0x3f8)
struct UAthenaCollectionScreenInfoOverlay : UCommonActivatableWidget {
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct FName ParamName_ItemIcon; // 0x400(0x04)
	struct FName ParamName_IsDiscovered; // 0x404(0x04)
	struct UCommonRichTextBlock* RichText_AdditionalInfo; // 0x408(0x08)
	struct UImage* Image_ItemImage; // 0x410(0x08)
	struct FText NumCollectedTextFormat; // 0x418(0x18)
	struct FText EmptyDisplayNameText; // 0x430(0x18)
	struct FDataTableRowHandle ToggleLeaderboardRowHandle; // 0x448(0x10)
	struct UCommonTextBlock* Text_ItemType; // 0x458(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x460(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x468(0x08)
	struct UCommonRichTextBlock* RichText_AdditionalDescription; // 0x470(0x08)
	struct UPanelWidget* Panel_FriendScores; // 0x478(0x08)
	struct UCommonRichTextBlock* RichText_NumCollected; // 0x480(0x08)
	struct UCommonTextBlock* Text_ItemNumber; // 0x488(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x490(0x08)
	struct UFortDynamicEntryBox* EntryBox_InfoOverlay; // 0x498(0x08)
	struct UAthenaCollectionLeaderboard* FriendLeaderboard; // 0x4a0(0x08)
	char pad_4A8[0x18]; // 0x4a8(0x18)

	void BP_OnShowLeaderboard(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnShowLeaderboard // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnItemIconLoaded(struct UObject* ItemIcon); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnItemIconLoaded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnInfoOverlayReset(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnInfoOverlayReset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHideLeaderboard(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnHideLeaderboard // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnHasAdditionalInfoSet(bool bHasAdditionalInfo); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnHasAdditionalInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnFriendScoresUpdated(int32_t NumFriendScores); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnFriendScoresUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnFriendLeaderboardDeactivated(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnFriendLeaderboardDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnFriendLeaderboardActivated(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnFriendLeaderboardActivated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnContextTagsUpdated(int32_t NumContextTags); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnContextTagsUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnCollectedStateSet(enum class EFortCollectedState CollectedState); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnCollectedStateSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionScreenInfoOverlayCharacter
// Size: 0x4c8 (Inherited: 0x4c0)
struct UAthenaCollectionScreenInfoOverlayCharacter : UAthenaCollectionScreenInfoOverlay {
	struct FName ParamName_Progress; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)

	void BP_OnLocationsFoundSet(int32_t NumFound, int32_t NumAvailable, bool bAllFound); // Function FortniteUI.AthenaCollectionScreenInfoOverlayCharacter.BP_OnLocationsFoundSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCollectionScreenInfoOverlayFishing
// Size: 0x508 (Inherited: 0x4c0)
struct UAthenaCollectionScreenInfoOverlayFishing : UAthenaCollectionScreenInfoOverlay {
	bool bNeedsProFishingRod; // 0x4c0(0x01)
	char pad_4C1[0x7]; // 0x4c1(0x07)
	struct FText NoneText; // 0x4c8(0x18)
	struct UCommonRichTextBlock* RichText_PersonalBest; // 0x4e0(0x08)
	struct FText ScaleRangeTextFormat; // 0x4e8(0x18)
	struct UCommonRichTextBlock* RichText_ScaleRange; // 0x500(0x08)

	void BP_OnStarRatingSet(int32_t NumStars); // Function FortniteUI.AthenaCollectionScreenInfoOverlayFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength); // Function FortniteUI.AthenaCollectionScreenInfoOverlayFishing.BP_OnNormalizedLengthSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCommonPrioritizedWidget
// Size: 0x368 (Inherited: 0x320)
struct UAthenaCommonPrioritizedWidget : UFortHUDElementWidget {
	char pad_320[0x40]; // 0x320(0x40)
	bool bAutoManagePriorityByVisibility; // 0x360(0x01)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x361(0x02)
	char pad_363[0x5]; // 0x363(0x05)

	void OnStompFailed(); // Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void K2_OnBecomeInactive(); // Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void K2_OnBecomeActive(); // Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCompassBase
// Size: 0x930 (Inherited: 0x320)
struct UAthenaCompassBase : UFortHUDElementWidget {
	struct UMaterialInstanceDynamic* CompassMaterial; // 0x320(0x08)
	struct UImage* Image_Compass; // 0x328(0x08)
	struct FSlateBrush MarkerBrush; // 0x330(0xc0)
	struct FSlateBrush HeadingIndicatorBrush; // 0x3f0(0xc0)
	struct FSlateBrush StormIndicatorBrush; // 0x4b0(0xc0)
	float MarkerVerticalOffset; // 0x570(0x04)
	float DistanceTextVerticalOffset; // 0x574(0x04)
	float DistanceTextHorizontalOffset; // 0x578(0x04)
	char pad_57C[0x4]; // 0x57c(0x04)
	struct FSlateFontInfo HeadingFont; // 0x580(0x58)
	struct FSlateFontInfo DistanceTextFont; // 0x5d8(0x58)
	struct FSlateBrush TeammateGunshotIndicatorBrush; // 0x630(0xc0)
	struct FSlateBrush EnemyGunshotIndicatorBrush; // 0x6f0(0xc0)
	float TimeToShowGunshotIndicators; // 0x7b0(0x04)
	char pad_7B4[0x4]; // 0x7b4(0x04)
	struct UCurveFloat* GunshotIndicatorScaleOverTime; // 0x7b8(0x08)
	struct UCurveFloat* GunshotIndicatorScaleByStrength; // 0x7c0(0x08)
	struct UCurveFloat* GunshotIndicatorAlphaOverTime; // 0x7c8(0x08)
	struct UCurveFloat* GunshotIndicatorAlphaByHeading; // 0x7d0(0x08)
	char pad_7D8[0x8]; // 0x7d8(0x08)
	struct FSlateBrush DefaultPinnedQuestIconBrush; // 0x7e0(0xc0)
	float PinnedQuestAlphaRotCutoff; // 0x8a0(0x04)
	float PinnedQuestDistanceRotCutoff; // 0x8a4(0x04)
	float PinnedQuestIconVerticalOffset; // 0x8a8(0x04)
	float PinnedQuestDistanceTextVerticalOffset; // 0x8ac(0x04)
	struct FSlateFontInfo PinnedQuestDistanceTextFont; // 0x8b0(0x58)
	char pad_908[0x28]; // 0x908(0x28)
};

// Class FortniteUI.AthenaConfirmationWindow
// Size: 0x460 (Inherited: 0x3f8)
struct UAthenaConfirmationWindow : UCommonActivatableWidget {
	struct UCommonTextBlock* Text_Title; // 0x3f8(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x400(0x08)
	struct UFortLazyImage* Image_MainIcon; // 0x408(0x08)
	struct UDynamicEntryBox* EntryBox_Buttons; // 0x410(0x08)
	struct UBacchusCloseButton* Button_Close; // 0x418(0x08)
	struct UCommonBorder* Border_TapToCloseZone; // 0x420(0x08)
	struct FDataTableRowHandle CancelAction; // 0x428(0x10)
	struct UCommonButtonBase* ConfirmButtonClass; // 0x438(0x08)
	struct UCommonButtonBase* DeclineButtonClass; // 0x440(0x08)
	struct UCommonButtonBase* CancelButtonClass; // 0x448(0x08)
	char pad_450[0x10]; // 0x450(0x10)

	void OnSetButtonText(struct UCommonButtonBase* Button, struct FText& Text); // Function FortniteUI.AthenaConfirmationWindow.OnSetButtonText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function FortniteUI.AthenaConfirmationWindow.HandleTapToCloseZoneMouseButtonDown // (Final|Native|Private|HasOutParms) // @ game+0x9af2450
};

// Class FortniteUI.AthenaMarkedActorIndicator
// Size: 0x610 (Inherited: 0x3c0)
struct UAthenaMarkedActorIndicator : UFortActorIndicatorWidget {
	char pad_3C0[0x28]; // 0x3c0(0x28)
	struct FFortWorldMarkerData MarkerData; // 0x3e8(0x160)
	struct FMarkedActorDisplayInfo MarkerDisplay; // 0x548(0x98)
	struct UFortMarkerDetailsTable* DetailsTable; // 0x5e0(0x08)
	float FreshLargeItemShowTime; // 0x5e8(0x04)
	float IndicatorDotSizeThreshold; // 0x5ec(0x04)
	struct UWidgetSwitcher* Switcher_IndicatorSize; // 0x5f0(0x08)
	struct UPanelWidget* Panel_SmallIndicator; // 0x5f8(0x08)
	struct UPanelWidget* Panel_LargeIndicator; // 0x600(0x08)
	struct UCommonTextBlock* Text_Distance; // 0x608(0x08)

	void OnSetMarkerData(struct FFortWorldMarkerData& FortWorldMarkerData); // Function FortniteUI.AthenaMarkedActorIndicator.OnSetMarkerData // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaContextTutorialIndicator
// Size: 0x650 (Inherited: 0x610)
struct UAthenaContextTutorialIndicator : UAthenaMarkedActorIndicator {
	float OffscreenMaxTreshold; // 0x610(0x04)
	char pad_614[0x4]; // 0x614(0x04)
	struct UOverlay* ; // 0x618(0x08)
	char pad_620[0x4]; // 0x620(0x04)
	float ScreenEdgePaddingSizePercent; // 0x624(0x04)
	char pad_628[0x28]; // 0x628(0x28)

	void SwitchIndicatorSize(); // Function FortniteUI.AthenaContextTutorialIndicator.SwitchIndicatorSize // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af2aec
	void SetScreenPercent(float Percent); // Function FortniteUI.AthenaContextTutorialIndicator.SetScreenPercent // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetIndicatorText(struct FText& Text); // Function FortniteUI.AthenaContextTutorialIndicator.SetIndicatorText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void PlayOutAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayOutAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void PlayInAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayInAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void PlayBounceAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayBounceAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	float GetMinTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMinTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af2258
	float GetMaxTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMaxTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af2240
	float GetMaxOffscreenTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMaxOffscreenTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x278f398
	float GetCurrentDotProduct(); // Function FortniteUI.AthenaContextTutorialIndicator.GetCurrentDotProduct // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af2228
};

// Class FortniteUI.AthenaContextualChallengesWidget
// Size: 0x3c8 (Inherited: 0x3c8)
struct UAthenaContextualChallengesWidget : UAthenaChallengesWidget {

	bool ShouldOutroAutomatically(); // Function FortniteUI.AthenaContextualChallengesWidget.ShouldOutroAutomatically // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af2778
	void OnResetOutroDelay(); // Function FortniteUI.AthenaContextualChallengesWidget.OnResetOutroDelay // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnNewContextualHeader(struct FText& NewText); // Function FortniteUI.AthenaContextualChallengesWidget.OnNewContextualHeader // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible); // Function FortniteUI.AthenaContextualChallengesWidget.HandleToggleFullscreenMap // (Final|Native|Protected) // @ game+0x9af2608
	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*>& InContextualQuests); // Function FortniteUI.AthenaContextualChallengesWidget.HandleNewContextualObjectives // (Final|Native|Protected|HasOutParms) // @ game+0x9af23b4
	float GetOutroDelay(); // Function FortniteUI.AthenaContextualChallengesWidget.GetOutroDelay // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af2270
};

// Class FortniteUI.AthenaProgressModal
// Size: 0x408 (Inherited: 0x3f8)
struct UAthenaProgressModal : UCommonActivatableWidget {
	struct UCommonTextBlock* Text_Title; // 0x3f8(0x08)
	struct UCommonTextBlock* Text_Description; // 0x400(0x08)
};

// Class FortniteUI.AthenaControllerDisconnectedModal
// Size: 0x410 (Inherited: 0x408)
struct UAthenaControllerDisconnectedModal : UAthenaProgressModal {
	struct UHorizontalBox* HBox_SwitchUser; // 0x408(0x08)
};

// Class FortniteUI.AthenaCosmeticUnlockingInfo
// Size: 0x338 (Inherited: 0x2e0)
struct UAthenaCosmeticUnlockingInfo : UCommonUserWidget {
	struct UCommonRichTextBlock* RichText_StaticUnlockingText; // 0x2e0(0x08)
	struct UCommonRichTextBlock* RichText_UnlockingText; // 0x2e8(0x08)
	struct UProgressBar* ProgressBar_StepsCompleted; // 0x2f0(0x08)
	struct UCommonRichTextBlock* RichText_ProgressCompletion; // 0x2f8(0x08)
	struct FString EmphasisStyle; // 0x300(0x10)
	struct FString ProgressCompletionNumericStyle; // 0x310(0x10)
	struct UAthenaCosmeticItemDefinition* CosmeticItemDef; // 0x320(0x08)
	char pad_328[0x10]; // 0x328(0x10)

	void ShowUnlockingInfoForCosmeticVariant(struct UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmeticVariant // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9af29cc
	void ShowUnlockingInfoForCosmetic(struct UAthenaCosmeticItemDefinition* InCosmeticItemDef); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmetic // (Final|Native|Public|BlueprintCallable) // @ game+0x9af294c
	void ShowUnlockingInfo(struct UAthenaCosmeticItemDefinition* UnlockItem, struct UFortItemDefinition* UnlockSource); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9af285c
	void ShowSeasonUnlockingInfo(int32_t SeasonNumber, int32_t TierNumber); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowSeasonUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9af279c
	void RequestUpdateAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestUpdateAnim // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void RequestOutroAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestOutroAnim // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void RequestIntroAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestIntroAnim // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void OutroAnimFinished(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.OutroAnimFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af269c
	void OnUnlockingInfoSet(bool bShowProgression); // Function FortniteUI.AthenaCosmeticUnlockingInfo.OnUnlockingInfoSet // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void HideUnlockingInfo(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.HideUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9af2688
};

// Class FortniteUI.AthenaCountdownWidgetBase
// Size: 0x368 (Inherited: 0x320)
struct UAthenaCountdownWidgetBase : UFortHUDElementWidget {
	char pad_320[0x40]; // 0x320(0x40)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x360(0x02)
	char pad_362[0x6]; // 0x362(0x06)

	void OnDisplayWarningMessage(struct FText& FirstLineText, struct FText& SecondLineText); // Function FortniteUI.AthenaCountdownWidgetBase.OnDisplayWarningMessage // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnCountdownUpdate(int32_t TimeRemaining, struct FText& CountdownUpdateText); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownUpdate // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnCountdownStopped(); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStopped // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnCountdownStarted(int32_t TimeRemaining, struct FText& CountdownIntroText); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStarted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnCountdownFinished(); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownFinished // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleGamePhaseStepChanged(struct TScriptInterface<IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaCountdownWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1764cec
	void HandleCountdownUpdate(int32_t TimeRemaining); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownUpdate // (Final|Native|Protected) // @ game+0x9af2334
	void HandleCountdownStopped(); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStopped // (Final|Native|Protected) // @ game+0x9af2320
	void HandleCountdownStarted(int32_t TimeRemaining); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStarted // (Final|Native|Protected) // @ game+0x9af22a0
	void HandleCountdownFinished(); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownFinished // (Final|Native|Protected) // @ game+0x9af228c
};

// Class FortniteUI.AthenaCreativeItemEntryObjectWrapper
// Size: 0x1d0 (Inherited: 0x28)
struct UAthenaCreativeItemEntryObjectWrapper : UObject {
	struct FFortItemEntry ItemEntry; // 0x28(0x1a0)
	bool bIsDownloading; // 0x1c8(0x01)
	char pad_1C9[0x7]; // 0x1c9(0x07)
};

// Class FortniteUI.AthenaCreativeItemTileButton
// Size: 0x1230 (Inherited: 0x1070)
struct UAthenaCreativeItemTileButton : UCommonButtonLegacy {
	char pad_1070[0x8]; // 0x1070(0x08)
	struct UAthenaCreativeItemTileView* ParentView; // 0x1078(0x08)
	struct UFortItemDefinition* ItemDefinition; // 0x1080(0x08)
	struct FFortItemEntry ItemEntry; // 0x1088(0x1a0)
	char pad_1228[0x8]; // 0x1228(0x08)

	void OnLoadedItem(); // Function FortniteUI.AthenaCreativeItemTileButton.OnLoadedItem // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnEntryClick(struct UAthenaCreativeItemTileButton* Entry); // Function FortniteUI.AthenaCreativeItemTileButton.OnEntryClick // (Event|Public|BlueprintEvent) // @ game+0xda071c
	struct UAthenaCreativeItemEntryObjectWrapper* MakeFortItemEntryObjectWrapper(struct UObject* Target, struct FFortItemEntry& InItemEntry); // Function FortniteUI.AthenaCreativeItemTileButton.MakeFortItemEntryObjectWrapper // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9af3e38
	int32_t GetItemTypeCount(); // Function FortniteUI.AthenaCreativeItemTileButton.GetItemTypeCount // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x9af370c
	bool CompareToItemEntry(struct FFortItemEntry& InItemEntry); // Function FortniteUI.AthenaCreativeItemTileButton.CompareToItemEntry // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x9af31a4
};

// Class FortniteUI.AthenaCreativeItemTileView
// Size: 0xbc0 (Inherited: 0xba0)
struct UAthenaCreativeItemTileView : UCommonTileView {
	struct UFortOptionsTab* ParentTab; // 0xba0(0x08)
	struct UFortItem* CurrentlyFocusedItem; // 0xba8(0x08)
	char pad_BB0[0x10]; // 0xbb0(0x10)
};

// Class FortniteUI.AthenaCurieStatusWidget
// Size: 0x368 (Inherited: 0x320)
struct UAthenaCurieStatusWidget : UFortHUDElementWidget {
	char pad_320[0x48]; // 0x320(0x48)

	void SetPlayerState(struct AFortPlayerStateAthena* PlayerState); // Function FortniteUI.AthenaCurieStatusWidget.SetPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x9af43a8
	void OnPlayerStatePawnChanged(); // Function FortniteUI.AthenaCurieStatusWidget.OnPlayerStatePawnChanged // (Final|Native|Protected) // @ game+0x9af41d0
	void OnHandleSpectatingChanged(struct AFortPlayerStateZone* NewSpectatingTarget); // Function FortniteUI.AthenaCurieStatusWidget.OnHandleSpectatingChanged // (Final|Native|Protected) // @ game+0x9af4150
	void OnCurieStateRemoved(struct FGameplayTag& RemovedState); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateRemoved // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnCurieStateDetachedFromSpectator(struct UObject* InOwner, struct FCurieContainerHandle ContainerHandle, struct FGameplayTag& ElementIdentifier); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateDetachedFromSpectator // (Final|Native|Protected|HasOutParms) // @ game+0x9af4048
	void OnCurieStateAttachedToSpectator(struct UObject* InOwner, struct FCurieContainerHandle ContainerHandle, struct FGameplayTag& ElementIdentifier); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAttachedToSpectator // (Final|Native|Protected|HasOutParms) // @ game+0x9af3f40
	void OnCurieStateAdded(struct FGameplayTag& AddedState); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAdded // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	bool HasState(struct FGameplayTag CurieState); // Function FortniteUI.AthenaCurieStatusWidget.HasState // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af3d40
};

// Class FortniteUI.AthenaCustomizationPicker
// Size: 0x588 (Inherited: 0x420)
struct UAthenaCustomizationPicker : UFortItemPickerBase {
	struct FMulticastInlineDelegate OnCosmeticSelectionSaving; // 0x420(0x10)
	struct FMulticastInlineDelegate OnCosmeticSelectionSaved; // 0x430(0x10)
	struct TMap<enum class EInventoryContentSortType, struct FText> SortLabels; // 0x440(0x50)
	struct TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray; // 0x490(0x10)
	struct UCommonButtonBase* Button_JumpToTop; // 0x4a0(0x08)
	struct UCommonButtonBase* Button_TextSearch; // 0x4a8(0x08)
	struct UCommonButtonBase* Button_SortAndFilter; // 0x4b0(0x08)
	struct FName CurrentFilterName; // 0x4b8(0x04)
	char pad_4BC[0x26]; // 0x4bc(0x26)
	bool bArchiveFiltering; // 0x4e2(0x01)
	char pad_4E3[0x5]; // 0x4e3(0x05)
	struct UCommonTextBlock* Text_SortTag; // 0x4e8(0x08)
	struct UCommonTextBlock* Text_FilterTag; // 0x4f0(0x08)
	struct UCommonTextBlock* Text_NumArchived; // 0x4f8(0x08)
	struct UWidget* Widget_ArchivedTag; // 0x500(0x08)
	enum class EAthenaCustomizationCategory CustomizeCategory; // 0x508(0x01)
	char pad_509[0x3]; // 0x509(0x03)
	int32_t SubslotIndex; // 0x50c(0x04)
	float ItemOffsetForJumpToTopButton; // 0x510(0x04)
	char pad_514[0x4]; // 0x514(0x04)
	struct UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter; // 0x518(0x08)
	struct UUserWidget* Tooltip_ArchiveFilter; // 0x520(0x08)
	bool bAllowUnownedItems; // 0x528(0x01)
	bool bAllowCommits; // 0x529(0x01)
	bool bOneItemPerSlot; // 0x52a(0x01)
	char pad_52B[0x15]; // 0x52b(0x15)
	struct TArray<struct UObject*> InitialPickerItems; // 0x540(0x10)
	struct UFortItem* ItemListeningTo; // 0x550(0x08)
	struct UAthenaCosmeticAccountItem* LocalCampaignHeroItem; // 0x558(0x08)
	char pad_560[0x28]; // 0x560(0x28)

	void SetFilter(struct FName FilterName); // Function FortniteUI.AthenaCustomizationPicker.SetFilter // (Final|Native|Public|BlueprintCallable) // @ game+0x9af4328
	void SearchText(struct FText& Text); // Function FortniteUI.AthenaCustomizationPicker.SearchText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9af41e4
	void OnUpdateArchiveFilterTooltipText(struct FText& Text); // Function FortniteUI.AthenaCustomizationPicker.OnUpdateArchiveFilterTooltipText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnShowArchiveFilterTooltip(bool bShowTooltip); // Function FortniteUI.AthenaCustomizationPicker.OnShowArchiveFilterTooltip // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnSearchEnabled(bool bEnabled); // Function FortniteUI.AthenaCustomizationPicker.OnSearchEnabled // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnNoItemsAvailableInFilter(struct FText& EmptyDisplayText); // Function FortniteUI.AthenaCustomizationPicker.OnNoItemsAvailableInFilter // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnItemsAvailableInFilter(); // Function FortniteUI.AthenaCustomizationPicker.OnItemsAvailableInFilter // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnCosmeticChangeSaveEvent__DelegateSignature(); // DelegateFunction FortniteUI.AthenaCustomizationPicker.OnCosmeticChangeSaveEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	bool HasSelectableTile(); // Function FortniteUI.AthenaCustomizationPicker.HasSelectableTile // (Event|Protected|BlueprintEvent|Const) // @ game+0xda071c
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged); // Function FortniteUI.AthenaCustomizationPicker.HandleSelectedItemHasChanged // (Final|Native|Protected) // @ game+0x9af3c34
	void HandleButtonTextSearchClicked(); // Function FortniteUI.AthenaCustomizationPicker.HandleButtonTextSearchClicked // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleArchiveFilterTooltipDismissed(); // Function FortniteUI.AthenaCustomizationPicker.HandleArchiveFilterTooltipDismissed // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x9af3a80
	struct FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting); // Function FortniteUI.AthenaCustomizationPicker.GetQualifiedFilterDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af3934
	void EndCustomizationCategory(); // Function FortniteUI.AthenaCustomizationPicker.EndCustomizationCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x9af3270
	void BP_OnUpdateNumArchivedItems(int32_t InNumArchivedItems); // Function FortniteUI.AthenaCustomizationPicker.BP_OnUpdateNumArchivedItems // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory category, int32_t SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot); // Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x9af3000
};

// Class FortniteUI.AthenaCustomizationPickerSortAndFilterBlade
// Size: 0x3b0 (Inherited: 0x2e0)
struct UAthenaCustomizationPickerSortAndFilterBlade : UCommonUserWidget {
	struct UWidget* Widget_Sorts; // 0x2e0(0x08)
	struct UWidget* Widget_Filters; // 0x2e8(0x08)
	struct UFortDynamicEntryBox* DynamicEntryBox_SortButtons; // 0x2f0(0x08)
	struct UFortDynamicEntryBox* DynamicEntryBox_FilterButtons; // 0x2f8(0x08)
	struct UCommonButtonGroupBase* ButtonGroup_Sorts; // 0x300(0x08)
	struct UCommonButtonGroupBase* ButtonGroup_Filters; // 0x308(0x08)
	char pad_310[0xa0]; // 0x310(0xa0)

	bool IsBladeOpen(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.IsBladeOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af3e1c
	void HandleCloseAnimationFinished(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.HandleCloseAnimationFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af3abc
	struct UCommonButtonBase* GetSortButtonAtIndex(int32_t DesiredIndex); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetSortButtonAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af39f0
	int32_t GetNumSorts(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetNumSorts // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af3914
	int32_t GetNumFilters(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetNumFilters // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af38f4
	struct UCommonButtonBase* GetFilterButtonAtIndex(int32_t DesiredIndex); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetFilterButtonAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af367c
	struct TArray<struct UUserWidget*> GetAllSortAndFilterButtons(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.GetAllSortAndFilterButtons // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af3284
	void CloseBlade(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.CloseBlade // (Final|Native|Public|BlueprintCallable) // @ game+0x9af314c
	void BP_SetSortOrFilterButtonDisplayName(struct UCommonButtonBase* SortOrFilterButton, struct FText& DisplayName); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_SetSortOrFilterButtonDisplayName // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void BP_OnSortOrFilterButtonCreated(struct UCommonButtonBase* NewButton); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnSortOrFilterButtonCreated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnBladeOpen(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnBladeOpen // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnBladeClose(); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnBladeClose // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnArchiveFilteringSet(bool bEnabled); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_OnArchiveFilteringSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HighlightSortOrFilterButton(struct UCommonButtonBase* SortOrFilterButton, bool bHighlight); // Function FortniteUI.AthenaCustomizationPickerSortAndFilterBlade.BP_HighlightSortOrFilterButton // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.FortCosmeticItemTileButton
// Size: 0x1090 (Inherited: 0x1070)
struct UFortCosmeticItemTileButton : UCommonButtonLegacy {
	char pad_1070[0x8]; // 0x1070(0x08)
	struct UFortCosmeticItemCard* ItemWidget; // 0x1078(0x08)
	struct TWeakObjectPtr<struct UFortItem> Item; // 0x1080(0x08)
	float ItemCardWidth; // 0x1088(0x04)
	float MobileScalingFactor; // 0x108c(0x04)
};

// Class FortniteUI.AthenaCustomizationPickerTileButton
// Size: 0x10b0 (Inherited: 0x1090)
struct UAthenaCustomizationPickerTileButton : UFortCosmeticItemTileButton {
	char pad_1090[0x8]; // 0x1090(0x08)
	struct UFortBangWrapper_NUI* Bang; // 0x1098(0x08)
	struct UImage* Image_Favorite; // 0x10a0(0x08)
	struct UImage* Image_ClassIcon; // 0x10a8(0x08)

	void OnUpdateExclusiveWarning(bool bShouldWarn); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnUpdateExclusiveWarning // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnEquippedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnChangeOwnedState(bool bOwned); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnChangeOwnedState // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnArchivedStatusUpdated(bool bShowAsArchived, bool bUseAnimations); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnArchivedStatusUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaCustomizationScreen
// Size: 0xb88 (Inherited: 0x6b8)
struct UAthenaCustomizationScreen : UFortItemPreviewScreen {
	bool bCustomizationSelectionBeingProcessed; // 0x6b8(0x01)
	char pad_6B9[0x7]; // 0x6b9(0x07)
	struct FAthenaCustomizationParams CustomizationParams; // 0x6c0(0x48)
	enum class EAthenaCustomizationCategory InitialCustomizationCategory; // 0x708(0x01)
	char pad_709[0x7]; // 0x709(0x07)
	struct FText CategoryDisplayNames[0x16]; // 0x710(0x210)
	struct FText ItemTypeDisplayNames[0x16]; // 0x920(0x210)
	char pad_B30[0x18]; // 0xb30(0x18)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreenClass; // 0xb48(0x08)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreen; // 0xb50(0x08)
	char pad_B58[0x8]; // 0xb58(0x08)
	struct FDataTableRowHandle OpenNameLoadoutInputAction; // 0xb60(0x10)
	struct UWidgetAnimation* BoundAnim_Intro; // 0xb70(0x08)
	struct UWidgetAnimation* BoundAnim_Outro; // 0xb78(0x08)
	struct UFortCosmeticLoadoutSelector* LoadoutSelector; // 0xb80(0x08)

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32_t SlotIndex, bool bCanShowEmpty); // Function FortniteUI.AthenaCustomizationScreen.ShowLockerSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af4444
	void ShiftItemsVariantOption(struct UAthenaCosmeticAccountItem* Item, int32_t VariantChannelIndex); // Function FortniteUI.AthenaCustomizationScreen.ShiftItemsVariantOption // (Final|Native|Protected|BlueprintCallable) // @ game+0x73f6ccc
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed); // Function FortniteUI.AthenaCustomizationScreen.SetCustomizationSelectionBeingProcessed // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af42a8
	void OnLoadoutChanged(); // Function FortniteUI.AthenaCustomizationScreen.OnLoadoutChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	struct FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreen.GetItemTypeDisplayNames // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af3730
	struct UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32_t SubslotIndex); // Function FortniteUI.AthenaCustomizationScreen.GetFavoriteItemForCategory // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af34f4
	struct FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreen.GetCategoryDisplayName // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af332c
};

// Class FortniteUI.AthenaCustomizationScreenBase
// Size: 0xdf8 (Inherited: 0x6b8)
struct UAthenaCustomizationScreenBase : UFortItemPreviewScreen {
	bool bCustomizationSelectionBeingProcessed; // 0x6b8(0x01)
	char pad_6B9[0x7]; // 0x6b9(0x07)
	struct FAthenaCustomizationParams CustomizationParams; // 0x6c0(0x48)
	enum class EAthenaCustomizationCategory FirstCustomizationCategory; // 0x708(0x01)
	char pad_709[0x187]; // 0x709(0x187)
	struct FText CategoryDisplayNames[0x16]; // 0x890(0x210)
	struct FText ItemTypeDisplayNames[0x16]; // 0xaa0(0x210)
	char pad_CB0[0x30]; // 0xcb0(0x30)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreenClass; // 0xce0(0x08)
	struct UFortActivatablePanel* LoadoutSelectorScreenClass; // 0xce8(0x08)
	struct UFortBannerSelectModal* BannerSelectModalClass; // 0xcf0(0x08)
	struct UFortNameLoadoutPopup* NameLoadoutPopupClass; // 0xcf8(0x08)
	char pad_D00[0x8]; // 0xd00(0x08)
	struct UAthenaCustomizationSlotSelectorButton* LastHoveredSlot; // 0xd08(0x08)
	char pad_D10[0x8]; // 0xd10(0x08)
	struct FDataTableRowHandle OpenNameLoadoutInputAction; // 0xd18(0x10)
	struct TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities; // 0xd28(0x10)
	bool bDisplayBuiltInEmotesInEmoteRow; // 0xd38(0x01)
	char pad_D39[0x7]; // 0xd39(0x07)
	struct UWidgetAnimation* BoundAnim_Intro; // 0xd40(0x08)
	struct UWidgetAnimation* BoundAnim_Outro; // 0xd48(0x08)
	struct UWidget* Container_Loadouts_GodTileArea; // 0xd50(0x08)
	struct UCommonButtonLegacy* Button_Loadouts; // 0xd58(0x08)
	struct UCommonButtonLegacy* Button_SavePreset; // 0xd60(0x08)
	struct UCommonButtonLegacy* Button_RandomPresets; // 0xd68(0x08)
	struct UFortCosmeticLoadoutSelector* Loadout_Selector; // 0xd70(0x08)
	struct UFortCosmeticLoadoutCard* LoadoutCard_AppliedAnimation; // 0xd78(0x08)
	struct UPanelWidget* Panel_GearSlotRow; // 0xd80(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Pickaxe; // 0xd88(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Glider; // 0xd90(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Contrail; // 0xd98(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_LoadingScreen; // 0xda0(0x08)
	struct UPanelWidget* Panel_EmoteSlotRow; // 0xda8(0x08)
	struct UPanelWidget* Panel_WrapSlotRow; // 0xdb0(0x08)
	struct UPanelWidget* Panel_AccountSlotRow; // 0xdb8(0x08)
	struct UFortBannerSlotButton* Banner_Button; // 0xdc0(0x08)
	struct UAthenaLockerItemInfo* ItemInfo_Display; // 0xdc8(0x08)
	struct UCommonButtonBase* Button_ClearAllBangs; // 0xdd0(0x08)
	struct UCommonButtonBase* Button_BackToGame; // 0xdd8(0x08)
	char pad_DE0[0x18]; // 0xde0(0x18)

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32_t SlotIndex, bool bCanShowEmpty); // Function FortniteUI.AthenaCustomizationScreenBase.ShowLockerSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af453c
	bool ShouldDisplayNextRandomPresetName(); // Function FortniteUI.AthenaCustomizationScreenBase.ShouldDisplayNextRandomPresetName // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af4428
	void ShiftItemsVariantOption(struct UAthenaCosmeticAccountItem* Item, int32_t VariantChannelIndex); // Function FortniteUI.AthenaCustomizationScreenBase.ShiftItemsVariantOption // (Final|Native|Public|BlueprintCallable) // @ game+0x73f6ccc
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed); // Function FortniteUI.AthenaCustomizationScreenBase.SetCustomizationSelectionBeingProcessed // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af42a8
	void OnRefreshForNewLoadout(struct FString LoadoutName, bool bIsShuffleTile); // Function FortniteUI.AthenaCustomizationScreenBase.OnRefreshForNewLoadout // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerToggledRandomPresets(bool bNowEnabled); // Function FortniteUI.AthenaCustomizationScreenBase.OnPlayerToggledRandomPresets // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnIntroAppliedPreset(); // Function FortniteUI.AthenaCustomizationScreenBase.OnIntroAppliedPreset // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBeginSavingLoadouts(); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginSavingLoadouts // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBeginPickingLoadouts(); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingLoadouts // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBeginPickingCustomizationSlot(struct UAthenaCustomizationSlotSelectorButton* SlotButton); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingCustomizationSlot // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleInventoryUpdated(struct TSet<struct FString>& ItemChangeFlags, int64_t ProfileRevision); // Function FortniteUI.AthenaCustomizationScreenBase.HandleInventoryUpdated // (Final|Native|Private|HasOutParms) // @ game+0x9af3afc
	struct FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreenBase.GetItemTypeDisplayNames // (Final|Native|Public|BlueprintCallable) // @ game+0x9af3810
	struct UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32_t SubslotIndex); // Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x9af35b8
	struct FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreenBase.GetCategoryDisplayName // (Final|Native|Public|BlueprintCallable) // @ game+0x9af3410
};

// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// Size: 0x1140 (Inherited: 0x1070)
struct UAthenaCustomizationSlotSelectorButton : UCommonButtonLegacy {
	struct FText CategoryDisplayName; // 0x1070(0x18)
	struct FText CategoryDescription; // 0x1088(0x18)
	enum class EAthenaCustomizationCategory CustomizationType; // 0x10a0(0x01)
	char pad_10A1[0x3]; // 0x10a1(0x03)
	int32_t SubslotIndex; // 0x10a4(0x04)
	enum class EFortBangType BangType; // 0x10a8(0x01)
	bool bAllowUnownedItems; // 0x10a9(0x01)
	bool bOneItemPerSlot; // 0x10aa(0x01)
	char pad_10AB[0x5]; // 0x10ab(0x05)
	struct UMaterialInstance* OverrideSlotImage; // 0x10b0(0x08)
	struct UFortCosmeticItemCard* ItemWidget; // 0x10b8(0x08)
	struct FGameplayTag RequiredSlotGameplayTag; // 0x10c0(0x04)
	char pad_10C4[0x4]; // 0x10c4(0x04)
	struct TSoftObjectPtr<UTexture2D> DefaultEmptyTexture; // 0x10c8(0x28)
	float CardWidth; // 0x10f0(0x04)
	char pad_10F4[0x2c]; // 0x10f4(0x2c)
	struct UFortItem* LocalCampaignHeroPartItem; // 0x1120(0x08)
	struct UImage* Image_Favorite; // 0x1128(0x08)
	struct UImage* Image_ClassIcon; // 0x1130(0x08)
	struct UFortBangWrapper_NUI* Bang_Wrapper; // 0x1138(0x08)

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32_t InSubslotIndex, struct FGameplayTag& RequiredSlotTag); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9af53f0
	void SetCardDefaultImageAndWidth(struct TSoftObjectPtr<UTexture2D>& InDefaultImage, float InWidth); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCardDefaultImageAndWidth // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9af52e8
	void OnUpdateExclusiveWarning(bool bShouldWarn); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnUpdateExclusiveWarning // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCustomizationSlotActiveStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnCardImageAndWidthChanged(struct TSoftObjectPtr<UTexture2D>& Image, float Width); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCardImageAndWidthChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnArchivedStatusUpdated(bool bArchived); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnArchivedStatusUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	bool IsSlotFilled(); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.IsSlotFilled // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0xf944e0
	void HandleDifferentHeroLoadoutActivated(struct UFortMcpProfileCampaign* Profile); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.HandleDifferentHeroLoadoutActivated // (Final|Native|Private) // @ game+0x9af4b94
	void GetCustomizationSlotActiveState(bool& bOutAttachableCosmeticAvailable, bool& bOutActive); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCustomizationSlotActiveState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x20522bc
	struct UFortItem* GetCampaignHeroPartItem(); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCampaignHeroPartItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af4ac8
};

// Class FortniteUI.AthenaDiscoverabilityBase
// Size: 0x378 (Inherited: 0x320)
struct UAthenaDiscoverabilityBase : UFortHUDElementWidget {
	char pad_320[0x48]; // 0x320(0x48)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x368(0x02)
	char pad_36A[0x6]; // 0x36a(0x06)
	struct UFortControllerComponent_MapDiscoverability* AssociatedComponent; // 0x370(0x08)

	void OnStompFailed(); // Function FortniteUI.AthenaDiscoverabilityBase.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaDiscoverabilityBase.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void K2_OnBecomeInactive(); // Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void K2_OnBecomeActive(); // Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void CommonArrivalEvent(struct FGameplayTag& NewTag); // Function FortniteUI.AthenaDiscoverabilityBase.CommonArrivalEvent // (Native|Protected|HasOutParms) // @ game+0x9af4a38
};

// Class FortniteUI.AthenaDiscoveredAreaOverlay
// Size: 0x378 (Inherited: 0x378)
struct UAthenaDiscoveredAreaOverlay : UAthenaDiscoverabilityBase {

	void OnNewDiscovery(struct FText& LocalizedLocationName, struct TSoftObjectPtr<USoundCue>& DiscoveredSoundCue, bool bIsNamedLocation); // Function FortniteUI.AthenaDiscoveredAreaOverlay.OnNewDiscovery // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaDuelOverlay
// Size: 0x3c0 (Inherited: 0x320)
struct UAthenaDuelOverlay : UFortHUDElementWidget {
	char pad_320[0x40]; // 0x320(0x40)
	struct UCommonRichTextBlock* RichText_Title; // 0x360(0x08)
	struct UCommonRichTextBlock* RichText_SubTitle; // 0x368(0x08)
	struct UImage* Image_ChallengedNPCPortrait; // 0x370(0x08)
	struct UImage* Image_ElimPortrait; // 0x378(0x08)
	struct UImage* Image_Reward; // 0x380(0x08)
	struct TSoftObjectPtr<USoundBase> DuelStartedSound; // 0x388(0x28)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct FFortPrioritizedWidgetData PrioritizedWidgetData; // 0x3b8(0x02)
	char pad_3BA[0x6]; // 0x3ba(0x06)

	void OnShowOverlay(); // Function FortniteUI.AthenaDuelOverlay.OnShowOverlay // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnSetupForActivation(enum class EDuelState DuelState, struct FFortColorPalette& RarityColorPalette); // Function FortniteUI.AthenaDuelOverlay.OnSetupForActivation // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void OnOutroOverlay(); // Function FortniteUI.AthenaDuelOverlay.OnOutroOverlay // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleDuelUpdate(enum class EDuelState DuelState, struct FDuelOverlayData& DuelOverlayData); // Function FortniteUI.AthenaDuelOverlay.HandleDuelUpdate // (Final|Native|Private|HasOutParms) // @ game+0x9af4c14
};

// Class FortniteUI.AthenaMtxOfferButtonBaseLegacy
// Size: 0x10c0 (Inherited: 0x1070)
struct UAthenaMtxOfferButtonBaseLegacy : UCommonButtonLegacy {
	char pad_1070[0x8]; // 0x1070(0x08)
	struct UFortStoreFrontOfferInfo* OfferData; // 0x1078(0x08)
	struct UCommonTextBlock* Text_MtxAmount; // 0x1080(0x08)
	struct UCommonTextBlock* Text_RealMoneyPrice; // 0x1088(0x08)
	struct UCommonVisibilitySwitcher* OptionalSwitcher_CurrencyIcons; // 0x1090(0x08)
	struct UImage* OptionalIMG_StarterKit; // 0x1098(0x08)
	struct UCommonLoadGuard* LoadGuardCurrencySpinner; // 0x10a0(0x08)
	char pad_10A8[0x18]; // 0x10a8(0x18)

	void HandleMtxPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo>& PurchasedItems); // Function FortniteUI.AthenaMtxOfferButtonBaseLegacy.HandleMtxPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0x9b03110
};

// Class FortniteUI.AthenaDynamicMtxOfferButtonLegacy
// Size: 0x10d0 (Inherited: 0x10c0)
struct UAthenaDynamicMtxOfferButtonLegacy : UAthenaMtxOfferButtonBaseLegacy {
	struct UCommonTextBlock* Text_DynamicMtxAmount; // 0x10c0(0x08)
	char pad_10C8[0x8]; // 0x10c8(0x08)
};

// Class FortniteUI.AthenaReloadMtxScreenBaseLegacy
// Size: 0x750 (Inherited: 0x6b8)
struct UAthenaReloadMtxScreenBaseLegacy : UFortItemPreviewScreen {
	char pad_6B8[0x8]; // 0x6b8(0x08)
	struct UFortStoreFrontOfferInfo* OfferInfo; // 0x6c0(0x08)
	char pad_6C8[0x10]; // 0x6c8(0x10)
	struct UCommonTextBlock* Text_AmountNeeded; // 0x6d8(0x08)
	char pad_6E0[0x40]; // 0x6e0(0x40)
	struct TArray<struct UFortAccountItemDefinition*> AccountItemDefinitions; // 0x720(0x10)
	struct FDataTableRowHandle BackAction; // 0x730(0x10)
	struct UCommonButtonLegacy* Button_MobileClose; // 0x740(0x08)
	struct UAthenaSmallOfferPreviewBase* SmallOfferPreview_Widget; // 0x748(0x08)

	void HandleBackButton(bool& bPassThrough); // Function FortniteUI.AthenaReloadMtxScreenBaseLegacy.HandleBackButton // (Final|Native|Private|HasOutParms) // @ game+0x9b070c0
};

// Class FortniteUI.AthenaDynamicReloadMtxScreenLegacy
// Size: 0x7c0 (Inherited: 0x750)
struct UAthenaDynamicReloadMtxScreenLegacy : UAthenaReloadMtxScreenBaseLegacy {
	struct UCommonTextBlock* Text_TotalNeeded; // 0x750(0x08)
	struct UCommonTextBlock* Text_CurrentBalance; // 0x758(0x08)
	struct UCommonVisibilitySwitcher* Switcher_DynamicOptions; // 0x760(0x08)
	struct UAthenaStarterKitOfferButtonLegacy* Button_StarterKitOption; // 0x768(0x08)
	struct UOverlay* Overlay_MtxRequired; // 0x770(0x08)
	struct UOverlay* Overlay_StarterKit; // 0x778(0x08)
	struct UAthenaDynamicMtxOfferButtonLegacy* Button_MtxRequiredOption; // 0x780(0x08)
	struct UAthenaStaticMtxOfferButtonLegacy* Button_MtxOtherOption; // 0x788(0x08)
	struct UCommonButtonLegacy* Button_MoreOptions; // 0x790(0x08)
	struct TArray<struct FName> StorefrontNames; // 0x798(0x10)
	struct UAthenaReloadMtxScreenLegacy* StaticReloadMtxScreen; // 0x7a8(0x08)
	struct UCommonButtonLegacy* MtxRequiredButtonToFocus; // 0x7b0(0x08)
	char pad_7B8[0x8]; // 0x7b8(0x08)

	struct UWidget* GetMtxRequiredButtonToFocus(enum class EUINavigation InNavigation); // Function FortniteUI.AthenaDynamicReloadMtxScreenLegacy.GetMtxRequiredButtonToFocus // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af4ae0
};

// Class FortniteUI.AthenaEliminationIndicator
// Size: 0x618 (Inherited: 0x610)
struct UAthenaEliminationIndicator : UAthenaMarkedActorIndicator {
	char pad_610[0x8]; // 0x610(0x08)
};

// Class FortniteUI.AthenaEliminationOverlayBase
// Size: 0x2b8 (Inherited: 0x2b8)
struct UAthenaEliminationOverlayBase : UUserWidget {
};

// Class FortniteUI.AthenaEndGamePlacementWidget
// Size: 0x2e0 (Inherited: 0x2e0)
struct UAthenaEndGamePlacementWidget : UCommonUserWidget {

	void SetPlacement(int32_t NewPlacement); // Function FortniteUI.AthenaEndGamePlacementWidget.SetPlacement // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void Activate(); // Function FortniteUI.AthenaEndGamePlacementWidget.Activate // (Final|Native|Public|BlueprintCallable) // @ game+0x9af4a24
};

// Class FortniteUI.AthenaEquippedItemBase
// Size: 0x3e8 (Inherited: 0x368)
struct UAthenaEquippedItemBase : UBacchusHUDElement {
	enum class EEquippedWeaponDisplay CurrentMode; // 0x368(0x01)
	char pad_369[0xb]; // 0x369(0x0b)
	int32_t AmountConsideredInfinite; // 0x374(0x04)
	struct UCommonVisibilitySwitcher* Switcher_Content; // 0x378(0x08)
	struct UPanelWidget* Panel_ResourceContent; // 0x380(0x08)
	struct UPanelWidget* Panel_AmmoContent; // 0x388(0x08)
	struct UPanelWidget* Panel_UtilityContent; // 0x390(0x08)
	struct UImage* Image_AmmoIcon; // 0x398(0x08)
	struct UImage* Image_ResourceIcon; // 0x3a0(0x08)
	struct UImage* Image_UtilityIcon; // 0x3a8(0x08)
	struct UCommonTextBlock* Text_MagazineAmmoCount; // 0x3b0(0x08)
	struct UCommonTextBlock* Text_SurplusAmmoCount; // 0x3b8(0x08)
	struct UCommonTextBlock* Text_ResourceCount; // 0x3c0(0x08)
	struct UCommonTextBlock* Text_UtilityAmmoCount; // 0x3c8(0x08)
	struct UCommonTextBlock* Text_OutOfAmmo; // 0x3d0(0x08)
	struct UScaleBox* RootScaleBox; // 0x3d8(0x08)
	enum class ESlateVisibility WeaponEquipVisibility; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)

	void HandleWorldItemsChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleWorldItemsChanged // (Final|Native|Protected) // @ game+0x9af5254
	void HandleWeaponTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponTargetingChanged // (Final|Native|Protected) // @ game+0x9af51d4
	void HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadStarted // (Final|Native|Protected) // @ game+0x9af510c
	void HandleWeaponReloadCancelled(); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadCancelled // (Final|Native|Protected) // @ game+0x9af50f8
	void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponOverheatValueChanged // (Final|Native|Protected) // @ game+0x9af4fb8
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponEquipped // (Final|Native|Protected) // @ game+0x9af4ef4
	void HandleViewTargetChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleViewTargetChanged // (Final|Native|Protected) // @ game+0x9af4ee0
	void HandleSecondaryFireReleased(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFireReleased // (Final|Native|Protected) // @ game+0x9af4e60
	void HandleSecondaryFirePressed(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFirePressed // (Final|Native|Protected) // @ game+0x9af4dc8
	void HandleLocalAmmoChanged(int32_t LocalCount, int32_t LocalRemaining); // Function FortniteUI.AthenaEquippedItemBase.HandleLocalAmmoChanged // (Final|Native|Protected) // @ game+0x9af4d04
	void HandleBuildingMaterialChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleBuildingMaterialChanged // (Final|Native|Protected) // @ game+0x9af4b6c
	void BP_HandleWeaponTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleWeaponReloadCancelled(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadCancelled // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponOverheatValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleWeaponModeChanged(enum class EEquippedWeaponDisplay Mode); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponEquipped // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleSecondaryFireReleased(); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFireReleased // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleSecondaryFirePressed(); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFirePressed // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleResourceTypeChanged(struct UFortResourceItemDefinition* Item, int32_t ResourceCount); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceTypeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleResourceCountChanged(int32_t ResourceCount); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHideReserveAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasBulletsPerClipChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleHasAmmoChanged(bool bHasAmmo); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_HandleAmmoCountChanged(int32_t MagazineAmmoCount, int32_t SurplusAmmoCount, int32_t TotalRemaining); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleAmmoCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaEquippedItemInfoWidget
// Size: 0x4c0 (Inherited: 0x3e8)
struct UAthenaEquippedItemInfoWidget : UAthenaEquippedItemBase {
	char pad_3E8[0xd8]; // 0x3e8(0xd8)

	void OnExtensionWidgetAdded(struct UUserWidget* ExtensionWidget); // Function FortniteUI.AthenaEquippedItemInfoWidget.OnExtensionWidgetAdded // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaEventGamesBase
// Size: 0x568 (Inherited: 0x568)
struct UAthenaEventGamesBase : UFortActivatablePanel {
};

// Class FortniteUI.AthenaEventScreenBase
// Size: 0x568 (Inherited: 0x568)
struct UAthenaEventScreenBase : UFortActivatablePanel {
};

// Class FortniteUI.AthenaEventMatchActiveGridScreenBase
// Size: 0x590 (Inherited: 0x568)
struct UAthenaEventMatchActiveGridScreenBase : UAthenaEventScreenBase {
	struct UAthenaEventMatchTeamWidgetBase* TeamWidgetClass; // 0x568(0x08)
	struct TArray<struct UAthenaEventMatchTeamWidgetBase*> ActiveTeams; // 0x570(0x10)
	int32_t MaxNumColumns; // 0x580(0x04)
	int32_t MaxTeamCount; // 0x584(0x04)
	int32_t MaxTeamSize; // 0x588(0x04)
	char pad_58C[0x4]; // 0x58c(0x04)

	void OnTeamEliminated_BP(); // Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated_BP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void OnTeamEliminated(int32_t InSquadId); // Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated // (Final|Native|Private) // @ game+0x9af5268
	void OnTeamChanged_BP(); // Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamChanged_BP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaEventMatchEliminatedGridScreenBase
// Size: 0x590 (Inherited: 0x568)
struct UAthenaEventMatchEliminatedGridScreenBase : UAthenaEventScreenBase {
	struct UAthenaEventMatchTeamWidgetBase* TeamWidgetClass; // 0x568(0x08)
	struct TArray<struct UAthenaEventMatchTeamWidgetBase*> EliminatedTeams; // 0x570(0x10)
	int32_t MaxNumColumns; // 0x580(0x04)
	int32_t MaxTeamCount; // 0x584(0x04)
	int32_t MaxTeamSize; // 0x588(0x04)
	char pad_58C[0x4]; // 0x58c(0x04)

	void OnTeamEliminated_BP(); // Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnTeamEliminated_BP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void OnPlayerEliminatedStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated); // Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnPlayerEliminatedStateChanged // (Final|Native|Private) // @ game+0x6554a54
};

// Class FortniteUI.AthenaEventMatchPlayerWidgetBase
// Size: 0x1080 (Inherited: 0x1070)
struct UAthenaEventMatchPlayerWidgetBase : UCommonButtonLegacy {
	char pad_1070[0x8]; // 0x1070(0x08)
	struct TWeakObjectPtr<struct UAthenaRemotePlayerViewData> PlayerData; // 0x1078(0x08)

	void SetPlayerData(struct UAthenaRemotePlayerViewData* InPlayerData); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.SetPlayerData // (Final|Native|Public|BlueprintCallable) // @ game+0x9af54f4
	void OnTeamColorChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct FLinearColor InTeamColor); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnTeamColorChanged // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0xda071c
	void OnSquadIdChanged(struct UAthenaRemotePlayerViewData* InPlayerData, char InSquadId); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnSquadIdChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnShieldHealed(struct UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldHealed // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnShieldDamaged(struct UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldDamaged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerPawnChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct AFortPlayerPawn* InPlayerPawn); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerPawnChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerNameChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct FString InPlayerName); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerNameChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerDataChanged(struct UAthenaRemotePlayerViewData* InPlayerData); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerDataChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlaceChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InPlace); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlaceChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnMaterialCountChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InCount); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnMaterialCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnLocationChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct FString InLocation); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnLocationChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnKillScoreChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InKillScore); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnKillScoreChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnIsReplayRelevancyPlayerChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsReplayRelevancyPlayer); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsReplayRelevancyPlayerChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnIsInRelevancyChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsInRelevancyChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnIsFollowedPlayerChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsFollowedPlayer); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsFollowedPlayerChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnHealthHealed(struct UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthHealed // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnHealthDamaged(struct UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthDamaged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDisconnectedChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDisconnectedChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDeadStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDeadStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDBNOStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDBNOStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnBeingRevivedStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnBeingRevivedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase
// Size: 0x1080 (Inherited: 0x1080)
struct UAthenaEventMatchScoreboardPlayerWidgetBase : UAthenaEventMatchPlayerWidgetBase {

	void SetSquadIdVisible(bool InVisible); // Function FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase.SetSquadIdVisible // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaEventMatchScoreboardScreenBase
// Size: 0x5b8 (Inherited: 0x568)
struct UAthenaEventMatchScoreboardScreenBase : UAthenaEventScreenBase {
	struct FUIActionTag SortByElimsAction; // 0x568(0x04)
	char pad_56C[0x4]; // 0x56c(0x04)
	struct FUIActionTag SortByPlaceAction; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct FDataTableRowHandle SortByEliminationsActionRowHandle; // 0x578(0x10)
	struct FDataTableRowHandle SortByPlaceActionRowHandle; // 0x588(0x10)
	struct TArray<struct UAthenaRemoteSquadViewData*> SquadDataArray; // 0x598(0x10)
	char pad_5A8[0x8]; // 0x5a8(0x08)
	struct UCommonListView* ScoreboardListView; // 0x5b0(0x08)

	void SetSquadIdsVisible_BP(bool bSquadIdsVisible); // Function FortniteUI.AthenaEventMatchScoreboardScreenBase.SetSquadIdsVisible_BP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleSquadKillScoreChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InKillScore); // Function FortniteUI.AthenaEventMatchScoreboardScreenBase.HandleSquadKillScoreChanged // (Final|Native|Private) // @ game+0x221cb7c
	void HandleSquadEliminated(struct UAthenaRemoteSquadViewData* InSquadData); // Function FortniteUI.AthenaEventMatchScoreboardScreenBase.HandleSquadEliminated // (Final|Native|Private) // @ game+0x2576144
};

// Class FortniteUI.AthenaEventMatchScoreboardSquadWidget
// Size: 0x330 (Inherited: 0x328)
struct UAthenaEventMatchScoreboardSquadWidget : UAthenaEventMatchSquadWidgetBase {
	char pad_328[0x8]; // 0x328(0x08)
};

// Class FortniteUI.AthenaEventMatchStatusScreenBase
// Size: 0x5b8 (Inherited: 0x568)
struct UAthenaEventMatchStatusScreenBase : UAthenaEventScreenBase {
	char pad_568[0x50]; // 0x568(0x50)

	void UpdateTimeSinceLastKillText(struct FText& TimeSinceLastKillText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateTimeSinceLastKillText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateSupplyDropsLootedText(struct FText& SupplyDropsLootedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateSupplyDropsLootedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateShotsFiredText(struct FText& ShotsFiredText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateShotsFiredText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdatePlayersRemainingText(struct FText& PlayersRemainingText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePlayersRemainingText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdatePiecesDestroyedText(struct FText& PiecesDestroyedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesDestroyedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdatePiecesBuiltText(struct FText& PiecesBuiltText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesBuiltText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateMostKillsText(struct FText& MostKillsText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateMostKillsScore(struct FText& MostKillsScore); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsScore // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateMatchTimeText(struct FText& MatchTimeText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMatchTimeText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateLongestEliminationText(struct FText& LongestEliminationText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateLongestEliminationScore(struct FText& LongestEliminationScore); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationScore // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateGamePhaseTimeTitleText(struct FText& GamePhaseTimeTitleText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeTitleText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateGamePhaseTimeText(struct FText& GamePhaseTimeText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateGamePhaseText(struct FText& GamePhaseText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateFastestKillText(struct FText& FastestKillText, struct FText& FastestKillTime); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateFastestKillText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateDamageTakenText(struct FText& DamageTakenText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageTakenText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateDamageInflictedText(struct FText& DamageInflictedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageInflictedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateDamageHealedText(struct FText& DamageHealedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageHealedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateCircleRadiusText(struct FText& CircleRadiusText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateCircleRadiusText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void UpdateChestsLootedText(struct FText& ChestsLootedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateChestsLootedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void OnPlayerKillScoreChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InKillScore); // Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerKillScoreChanged // (Final|Native|Protected) // @ game+0x20ed080
	void OnPlayerDeadStateChanged_BP(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead); // Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged_BP // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnPlayerDeadStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead); // Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged // (Final|Native|Protected) // @ game+0x1aff3d0
};

// Class FortniteUI.AthenaEventMatchTeamWidgetBase
// Size: 0x340 (Inherited: 0x2e0)
struct UAthenaEventMatchTeamWidgetBase : UCommonUserWidget {
	struct TArray<struct UAthenaEventMatchPlayerWidgetBase*> PlayerWidgets; // 0x2e0(0x10)
	char SquadId; // 0x2f0(0x01)
	char pad_2F1[0x3]; // 0x2f1(0x03)
	struct FLinearColor TeamColor; // 0x2f4(0x10)
	int32_t MaxTeamSize; // 0x304(0x04)
	struct UAthenaEventMatchPlayerWidgetBase* PlayerWidgetClass; // 0x308(0x08)
	char pad_310[0x18]; // 0x310(0x18)
	struct TArray<struct TWeakObjectPtr<struct UAthenaRemotePlayerViewData>> PlayerDatas; // 0x328(0x10)
	char pad_338[0x8]; // 0x338(0x08)

	void OnPlayerWidgetAdded(); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerWidgetAdded // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnPlayerDisconnectedChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDisconnected); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDisconnectedChanged // (Final|Native|Private) // @ game+0x1e6fb18
	void OnPlayerDeadStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDeadStateChanged // (Final|Native|Private) // @ game+0x1e6fa24
	bool IsTeamDead(); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.IsTeamDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af5d10
	int32_t GetTeamKills(); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.GetTeamKills // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af5c5c
};

// Class FortniteUI.AthenaExclusiveRewardBanner
// Size: 0x300 (Inherited: 0x2e0)
struct UAthenaExclusiveRewardBanner : UCommonUserWidget {
	char pad_2E0[0x10]; // 0x2e0(0x10)
	struct UCommonRichTextBlock* RichText_RewardMessage; // 0x2f0(0x08)
	struct UFortLazyImage* Image_RewardIcon; // 0x2f8(0x08)

	void OnInitBannerIcon(struct UTexture2D* RewardIcon); // Function FortniteUI.AthenaExclusiveRewardBanner.OnInitBannerIcon // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnInitBanner(); // Function FortniteUI.AthenaExclusiveRewardBanner.OnInitBanner // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnClearBanner(); // Function FortniteUI.AthenaExclusiveRewardBanner.OnClearBanner // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaFeatTimelineListEntry
// Size: 0x340 (Inherited: 0x2e0)
struct UAthenaFeatTimelineListEntry : UCommonUserWidget {
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct UPanelWidget* Panel_FeatInfo; // 0x2e8(0x08)
	struct UPanelWidget* Panel_Date; // 0x2f0(0x08)
	struct UCommonButtonLegacy* SimpleButton_ClickArea; // 0x2f8(0x08)
	struct UCommonTextBlock* Text_FeatName; // 0x300(0x08)
	struct UCommonTextBlock* Text_FeatDescription; // 0x308(0x08)
	struct UFortLazyImage* LazyImage_QuestIcon; // 0x310(0x08)
	struct UCommonTextBlock* Text_CompletedTime; // 0x318(0x08)
	struct UCommonRichTextBlock* RichText_Date; // 0x320(0x08)
	char pad_328[0x10]; // 0x328(0x10)
	bool bIsHovered; // 0x338(0x01)
	char pad_339[0x7]; // 0x339(0x07)

	void UnHoverFeat(); // Function FortniteUI.AthenaFeatTimelineListEntry.UnHoverFeat // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void OnWaitingForCompletedTimer(); // Function FortniteUI.AthenaFeatTimelineListEntry.OnWaitingForCompletedTimer // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnTimespanInfoSet(int32_t NumDays); // Function FortniteUI.AthenaFeatTimelineListEntry.OnTimespanInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFeatInfoSet(int32_t NumFeatsOnDay, int32_t IdxOnDay); // Function FortniteUI.AthenaFeatTimelineListEntry.OnFeatInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFeatCompletedThisSession(); // Function FortniteUI.AthenaFeatTimelineListEntry.OnFeatCompletedThisSession // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HoverFeat(); // Function FortniteUI.AthenaFeatTimelineListEntry.HoverFeat // (Event|Public|BlueprintEvent) // @ game+0xda071c
	struct FGameplayTag CalculateSourceTag(); // Function FortniteUI.AthenaFeatTimelineListEntry.CalculateSourceTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x218ce08
};

// Class FortniteUI.AthenaFeatTimelineListView
// Size: 0x380 (Inherited: 0x260)
struct UAthenaFeatTimelineListView : UListViewBase {
	char pad_260[0xd8]; // 0x260(0xd8)
	float EntrySpacing; // 0x338(0x04)
	float EndSpacing; // 0x33c(0x04)
	float DelayBeforeStartCompleted; // 0x340(0x04)
	float DelayBetweenCompletedItems; // 0x344(0x04)
	char pad_348[0x38]; // 0x348(0x38)
};

// Class FortniteUI.AthenaFPSBase
// Size: 0x300 (Inherited: 0x2e0)
struct UAthenaFPSBase : UCommonUserWidget {
	struct UCommonTextBlock* FPS; // 0x2e0(0x08)
	char pad_2E8[0x18]; // 0x2e8(0x18)

	void HandleShowFPSChanged(bool bInShowFPS); // Function FortniteUI.AthenaFPSBase.HandleShowFPSChanged // (Final|Native|Protected) // @ game+0x9af5c80
};

// Class FortniteUI.AthenaFrontendFlowInterruptInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaFrontendFlowInterruptInterface : UInterface {
};

// Class FortniteUI.AthenaFrontEndMapPoiIcon
// Size: 0x300 (Inherited: 0x2e0)
struct UAthenaFrontEndMapPoiIcon : UCommonUserWidget {
	struct UCommonTextBlock* Text_PoiName; // 0x2e0(0x08)
	char pad_2E8[0x18]; // 0x2e8(0x18)

	void HandleTextChanged(bool bIsRedacted); // Function FortniteUI.AthenaFrontEndMapPoiIcon.HandleTextChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaFullScreenMapBase
// Size: 0x578 (Inherited: 0x530)
struct UAthenaFullScreenMapBase : UCommonActivatablePanelLegacy {
	struct UAthenaMapLayerContainer* MapLayerContainer; // 0x530(0x08)
	struct FDataTableRowHandle ToggleMapMarkerRowHandle; // 0x538(0x10)
	struct TSoftObjectPtr<UFortMarkerDetailsTable> SoftMarkerDetailsTable; // 0x548(0x28)
	bool bMapLayerContainerEnabled; // 0x570(0x01)
	char pad_571[0x7]; // 0x571(0x07)

	void ShowMapLayerContainer(bool bShowing); // Function FortniteUI.AthenaFullScreenMapBase.ShowMapLayerContainer // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaFullScreenMapControlsWidget
// Size: 0x5c0 (Inherited: 0x3f8)
struct UAthenaFullScreenMapControlsWidget : UCommonActivatableWidget {
	char pad_3F8[0x20]; // 0x3f8(0x20)
	struct UPanelWidget* Panel_PanGroup; // 0x418(0x08)
	struct UPanelWidget* Panel_ZoomGroup; // 0x420(0x08)
	struct UCommonButtonLegacy* Button_ToggleQuestIcons; // 0x428(0x08)
	struct UCommonButtonLegacy* Button_ResetToPlayer; // 0x430(0x08)
	struct UCommonButtonLegacy* Button_Exit; // 0x438(0x08)
	struct UCommonTextBlock* Text_PlaceMarker; // 0x440(0x08)
	struct FText TextPlaceMarker; // 0x448(0x18)
	struct FText TextRemoveMarker; // 0x460(0x18)
	struct FText TextNPCIconsOn; // 0x478(0x18)
	struct FText TextNPCIconsOff; // 0x490(0x18)
	struct FText TextPinQuest; // 0x4a8(0x18)
	struct FText TextUnpinQuest; // 0x4c0(0x18)
	struct FText TextPinCategory; // 0x4d8(0x18)
	struct FText TextUnpinCategory; // 0x4f0(0x18)
	struct FText TextConfirmRemoveQuestTitle; // 0x508(0x18)
	struct FText TextConfirmRemoveQuestDescription; // 0x520(0x18)
	struct USizeBox* SizeBox_PlaceMarker; // 0x538(0x08)
	struct UCommonButtonLegacy* Button_SortToggle; // 0x540(0x08)
	struct UCommonButtonLegacy* Button_RemoveSelectedQuest; // 0x548(0x08)
	struct UFortTextButton* Button_PinSelectedQuest; // 0x550(0x08)
	struct UFortTextButton* Button_PinSelectedCategory; // 0x558(0x08)
	struct UFortTextButton* Button_ViewPlaylist; // 0x560(0x08)
	struct UFortTextButton* Button_QuestNPCIcons; // 0x568(0x08)
	struct UAthenaConfirmationWindow* ConfirmationWindowClass; // 0x570(0x08)
	char pad_578[0x48]; // 0x578(0x48)

	void OnViewPlaylistButtonClicked__DelegateSignature(struct FString PlaylistName); // DelegateFunction FortniteUI.AthenaFullScreenMapControlsWidget.OnViewPlaylistButtonClicked__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnPinSelectedQuestButtonClicked__DelegateSignature(); // DelegateFunction FortniteUI.AthenaFullScreenMapControlsWidget.OnPinSelectedQuestButtonClicked__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnPinSelectedCategoryButtonClicked__DelegateSignature(); // DelegateFunction FortniteUI.AthenaFullScreenMapControlsWidget.OnPinSelectedCategoryButtonClicked__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void BP_OnSortTypeTextChanged(struct FText& TypeText); // Function FortniteUI.AthenaFullScreenMapControlsWidget.BP_OnSortTypeTextChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void BP_HandleToggleQuestIconsClicked(); // Function FortniteUI.AthenaFullScreenMapControlsWidget.BP_HandleToggleQuestIconsClicked // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaFullScreenMapPanel
// Size: 0x608 (Inherited: 0x578)
struct UAthenaFullScreenMapPanel : UAthenaFullScreenMapBase {
	char pad_578[0x18]; // 0x578(0x18)
	struct FAthenaMapScreenContainerTabInfo MapTabInfo; // 0x590(0x50)
	struct TSoftClassPtr<UObject> SoftGameInfoClass; // 0x5e0(0x28)

	void OnTransistionedFromAnotherMapPanel(); // Function FortniteUI.AthenaFullScreenMapPanel.OnTransistionedFromAnotherMapPanel // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnMapGameInfoWidgetCreated(struct UUserWidget* Widget); // Function FortniteUI.AthenaFullScreenMapPanel.OnMapGameInfoWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaFullScreenMapQuestCategoryButton
// Size: 0x1060 (Inherited: 0x1020)
struct UAthenaFullScreenMapQuestCategoryButton : UCommonButtonBase {
	char pad_1020[0x18]; // 0x1020(0x18)
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeRemaining; // 0x1038(0x08)
	struct UCommonTextBlock* Text_TimeCustom; // 0x1040(0x08)
	struct UCommonTextBlock* Text_DebugCategoryName; // 0x1048(0x08)
	struct UWidgetSwitcher* Switcher_TimerOrDisabled; // 0x1050(0x08)
	struct UFortLazyImage* LazyImage_Icon; // 0x1058(0x08)

	void ShowNewBang(bool bEnabled); // Function FortniteUI.AthenaFullScreenMapQuestCategoryButton.ShowNewBang // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFocusSetToQuests(); // Function FortniteUI.AthenaFullScreenMapQuestCategoryButton.OnFocusSetToQuests // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFocusReceivedFromQuests(); // Function FortniteUI.AthenaFullScreenMapQuestCategoryButton.OnFocusReceivedFromQuests // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_Populate(struct FText& Title, struct FText& SubText, enum class EQuestCategoryButtonTimerState TimerState, struct FQuestCategoryButtonOverrides& ButtonOverrides); // Function FortniteUI.AthenaFullScreenMapQuestCategoryButton.BP_Populate // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaFullScreenQuestMapContent
// Size: 0x608 (Inherited: 0x578)
struct UAthenaFullScreenQuestMapContent : UAthenaFullScreenMapBase {
	char pad_578[0x10]; // 0x578(0x10)
	struct UAthenaFullScreenMapControlsWidget* ControlsPanel; // 0x588(0x08)
	struct UAthenaQuestListContent* QuestPanel; // 0x590(0x08)
	struct UOverlay* MapAnimWrapper; // 0x598(0x08)
	struct UUserWidget* CustomMapWidgetInstance; // 0x5a0(0x08)
	struct UFortQuestItemDefinition* CachedPinnedQuestDefinition; // 0x5a8(0x08)
	char pad_5B0[0x10]; // 0x5b0(0x10)
	bool bDisableDisplayMapInCreative; // 0x5c0(0x01)
	char pad_5C1[0x47]; // 0x5c1(0x47)

	void OnQuestListLostFocus(); // Function FortniteUI.AthenaFullScreenQuestMapContent.OnQuestListLostFocus // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnQuestListGainedFocus(); // Function FortniteUI.AthenaFullScreenQuestMapContent.OnQuestListGainedFocus // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnListViewScrolled(float OffsetInItems, float DistanceRemaining); // Function FortniteUI.AthenaFullScreenQuestMapContent.OnListViewScrolled // (Final|Native|Private) // @ game+0x9af716c
	void OnChallengeCategoryChanged(); // Function FortniteUI.AthenaFullScreenQuestMapContent.OnChallengeCategoryChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleViewPlaylistButtonClicked(struct FString PlaylistName); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandleViewPlaylistButtonClicked // (Final|Native|Private) // @ game+0x504ebd0
	void HandleSortTypeTextChanged(struct FText& TypeText); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandleSortTypeTextChanged // (Final|Native|Private|HasOutParms) // @ game+0x9af69ec
	void HandleRemoveSelectedQuestButtonClicked(); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandleRemoveSelectedQuestButtonClicked // (Final|Native|Private) // @ game+0x9af68b8
	void HandlePinSelectedQuestButtonClicked(); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandlePinSelectedQuestButtonClicked // (Final|Native|Private) // @ game+0x9af6800
	void HandlePinSelectedCategoryButtonClicked(); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandlePinSelectedCategoryButtonClicked // (Final|Native|Private) // @ game+0x9af67ec
	void HandlePinnedQuestsChanged(); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandlePinnedQuestsChanged // (Final|Native|Private) // @ game+0x9af6814
	void HandleControlsSortButtonClicked(); // Function FortniteUI.AthenaFullScreenQuestMapContent.HandleControlsSortButtonClicked // (Final|Native|Private) // @ game+0x9af6168
};

// Class FortniteUI.AthenaFullScreenQuestMapPanel
// Size: 0x558 (Inherited: 0x3f8)
struct UAthenaFullScreenQuestMapPanel : UCommonActivatableWidget {
	char pad_3F8[0x18]; // 0x3f8(0x18)
	struct FAthenaMapScreenContainerTabInfo MapTabInfo; // 0x410(0x50)
	float SafeZoneOpacityInterpolationInDuration; // 0x460(0x04)
	float SafeZoneOpacityInterpolationOutDuration; // 0x464(0x04)
	struct UAthenaFullScreenMapQuestCategoryButton* CategoryButtonType; // 0x468(0x08)
	float CategoryButtonPadding; // 0x470(0x04)
	struct FGameplayTag DefaultCategoryTag; // 0x474(0x04)
	bool bResetSelectionWhenParentDeactivates; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)
	struct UAthenaFullScreenMapControlsWidget* ControlsPanel; // 0x480(0x08)
	struct UGridPanel* GridPanel_Categories; // 0x488(0x08)
	struct UAthenaFullScreenQuestMapContent* QuestMapContent; // 0x490(0x08)
	struct UAthenaScrollBox* ScrollBox_ContentRoot; // 0x498(0x08)
	struct UCommonButtonBase* Button_Previous; // 0x4a0(0x08)
	struct UCommonButtonBase* Button_Next; // 0x4a8(0x08)
	char pad_4B0[0x8]; // 0x4b0(0x08)
	struct UCommonButtonGroupBase* CategoryButtonGroup; // 0x4b8(0x08)
	struct TMap<struct FGuid, struct UAthenaFullScreenMapQuestCategoryButton*> CategoryInstanceMap; // 0x4c0(0x50)
	char pad_510[0x31]; // 0x510(0x31)
	bool bEnableSnapScrolling; // 0x541(0x01)
	char pad_542[0x2]; // 0x542(0x02)
	float SnapScrollingThreshold; // 0x544(0x04)
	char pad_548[0x10]; // 0x548(0x10)

	void HandleScrollCompleted(float ScrollAmount); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleScrollCompleted // (Final|Native|Private) // @ game+0x9af6968
	void HandleRequestPrevious(); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleRequestPrevious // (Final|Native|Private) // @ game+0x9af68cc
	struct UWidget* HandleQuestMapNavigateLeft(enum class EUINavigation InNavigation); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleQuestMapNavigateLeft // (Final|Native|Private) // @ game+0x9af6828
	struct UWidget* HandleCategoryNavigateRight(enum class EUINavigation InNavigation); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleCategoryNavigateRight // (Final|Native|Private) // @ game+0x9af60d4
};

// Class FortniteUI.MinigameWidgetBase
// Size: 0x378 (Inherited: 0x320)
struct UMinigameWidgetBase : UFortHUDElementWidget {
	char pad_320[0x30]; // 0x320(0x30)
	bool bDisplayCaptureObjectiveRow; // 0x350(0x01)
	char pad_351[0x7]; // 0x351(0x07)
	struct AFortMinigame* CurrentMinigame; // 0x358(0x08)
	char pad_360[0x10]; // 0x360(0x10)
	struct AActor* CurrentContainer; // 0x370(0x08)

	void ResetDisplayValues(); // Function FortniteUI.MinigameWidgetBase.ResetDisplayValues // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnVolumeMinigameChanged(struct AFortMinigame* Minigame); // Function FortniteUI.MinigameWidgetBase.OnVolumeMinigameChanged // (Final|Native|Private) // @ game+0x9b979bc
	void OnPlayerStatUpdated(); // Function FortniteUI.MinigameWidgetBase.OnPlayerStatUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnObjectiveUpdated(); // Function FortniteUI.MinigameWidgetBase.OnObjectiveUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDisplayMinigameStartUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigameStartUI // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDisplayMinigamePregameCountdownUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigamePregameCountdownUI // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDisplayMinigameInProgressUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigameInProgressUI // (Native|Event|Protected|BlueprintEvent) // @ game+0x9b97868
	void OnDisplayMinigameEndUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMinigameEndUI // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDisplayMiniGameAbortUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayMiniGameAbortUI // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnDisplayCaptureObjectiveUI(bool bDisplay); // Function FortniteUI.MinigameWidgetBase.OnDisplayCaptureObjectiveUI // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnCurrentStateChangedDelegate(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.MinigameWidgetBase.OnCurrentStateChangedDelegate // (Final|Native|Private) // @ game+0x9b977a4
	struct FAthenaGameMessageData MakeMessageData(enum class EAthenaGameMsgType MsgType, struct FText MsgText, struct USoundCue* MsgSound, float DisplayTime); // Function FortniteUI.MinigameWidgetBase.MakeMessageData // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x9b97560
	void HideAllMinigameWidgetUI(); // Function FortniteUI.MinigameWidgetBase.HideAllMinigameWidgetUI // (Final|Native|Private) // @ game+0x9b9754c
	void HandlePlayerStatChanged(); // Function FortniteUI.MinigameWidgetBase.HandlePlayerStatChanged // (Final|Native|Private) // @ game+0x74b486c
	int32_t GetStatValue(struct UFortMinigameStatFilter* InFilter, bool bGameTotal); // Function FortniteUI.MinigameWidgetBase.GetStatValue // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x9b973a8
};

// Class FortniteUI.AthenaFullScreenScoreboardPanel
// Size: 0x380 (Inherited: 0x378)
struct UAthenaFullScreenScoreboardPanel : UMinigameWidgetBase {
	struct UScrollBox* DataScrollBox; // 0x378(0x08)
};

// Class FortniteUI.AthenaGadgetFuelWidget
// Size: 0x308 (Inherited: 0x2e0)
struct UAthenaGadgetFuelWidget : UCommonUserWidget {
	struct TWeakObjectPtr<struct UAthenaGadgetItemDefinition> AthenaGadgetItemDefinition; // 0x2e0(0x08)
	enum class EFortFuelGadgetVisualType FortFuelGadgetVisualType; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	struct UImage* FuelGaugeProgressImage; // 0x2f0(0x08)
	struct UCommonNumericTextBlock* CurrentChargesText; // 0x2f8(0x08)
	char pad_300[0x8]; // 0x300(0x08)

	void SetItem(struct UFortWorldItem* Item); // Function FortniteUI.AthenaGadgetFuelWidget.SetItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x211a46c
};

// Class FortniteUI.AthenaGameFeatureStatus
// Size: 0x3a0 (Inherited: 0x2e0)
struct UAthenaGameFeatureStatus : UCommonUserWidget {
	struct FText ProgressStatusToastTitle; // 0x2e0(0x18)
	enum class EFortGameFeature GameFeature; // 0x2f8(0x01)
	bool bExtendedDisplay; // 0x2f9(0x01)
	char pad_2FA[0x6]; // 0x2fa(0x06)
	struct FText ExtendedDisplayText; // 0x300(0x18)
	struct TSoftObjectPtr<UObject> DownloadingIconAsset; // 0x318(0x28)
	struct TSoftObjectPtr<UObject> InitialToastNotificationIcon; // 0x340(0x28)
	struct FName DownloadingIconMaterialParam; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)
	struct UFortLazyImage* Image_DownloadingIcon; // 0x370(0x08)
	struct UCommonNumericTextBlock* Text_ProgressPercent; // 0x378(0x08)
	struct UCommonTextBlock* Text_ExtendedDisplayText; // 0x380(0x08)
	char pad_388[0x18]; // 0x388(0x18)

	void OnStatusChanged(enum class EAthenaGameFeatureStatus NewStatus); // Function FortniteUI.AthenaGameFeatureStatus.OnStatusChanged // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGameOverDisplay
// Size: 0x648 (Inherited: 0x568)
struct UAthenaGameOverDisplay : UFortActivatablePanel {
	struct UFortMatchStatsScreen* MatchStatsClass; // 0x568(0x08)
	char pad_570[0x20]; // 0x570(0x20)
	struct FDataTableRowHandle Input_ReturnToLobby; // 0x590(0x10)
	struct FDataTableRowHandle Input_NextTeammate; // 0x5a0(0x10)
	struct FDataTableRowHandle Input_PreviousTeammate; // 0x5b0(0x10)
	struct FDataTableRowHandle Input_NextPlayer; // 0x5c0(0x10)
	struct FDataTableRowHandle Input_PreviousPlayer; // 0x5d0(0x10)
	struct FDataTableRowHandle Input_ReportPlayer; // 0x5e0(0x10)
	struct FDataTableRowHandle Input_ToggleBattleMap; // 0x5f0(0x10)
	struct FDataTableRowHandle Input_ForceStartPostGame; // 0x600(0x10)
	struct UEliminatedOverlay* EliminatedOverlay; // 0x610(0x08)
	struct UCommonButtonLegacy* Button_Highlights; // 0x618(0x08)
	struct FScalableFloat bAllowSpectateAllPlayers; // 0x620(0x28)

	void OnWinningScoreDetermined(int32_t Score); // Function FortniteUI.AthenaGameOverDisplay.OnWinningScoreDetermined // (Final|Native|Protected) // @ game+0x9af7590
	void OnWinnerAnnounced(struct FString Winner); // Function FortniteUI.AthenaGameOverDisplay.OnWinnerAnnounced // (Final|Native|Protected) // @ game+0x9af7430
	void OnViewTargetChanged(); // Function FortniteUI.AthenaGameOverDisplay.OnViewTargetChanged // (Final|Native|Protected) // @ game+0x9af7414
	void OnToggleFullscreenMap(bool bFullscreenMapVisible); // Function FortniteUI.AthenaGameOverDisplay.OnToggleFullscreenMap // (Final|Native|Protected) // @ game+0x9af7384
	void OnSpectatorStreamingChanged(bool bSpectatorStreaming); // Function FortniteUI.AthenaGameOverDisplay.OnSpectatorStreamingChanged // (Final|Native|Protected) // @ game+0x9af7384
	void OnSpecialActorListChanged(); // Function FortniteUI.AthenaGameOverDisplay.OnSpecialActorListChanged // (Final|Native|Protected) // @ game+0x9af7400
	void OnRessurectingNowDelegate(bool bRessurectingNow); // Function FortniteUI.AthenaGameOverDisplay.OnRessurectingNowDelegate // (Final|Native|Protected) // @ game+0x9af7384
	void OnPlayerOrTeamWon(); // Function FortniteUI.AthenaGameOverDisplay.OnPlayerOrTeamWon // (Final|Native|Public|BlueprintCallable) // @ game+0x9af7370
	void OnPlayerLost(enum class EEndOfMatchReason LostReason); // Function FortniteUI.AthenaGameOverDisplay.OnPlayerLost // (Final|Native|Public|BlueprintCallable) // @ game+0x9af72f0
	void OnPlaceChanged(); // Function FortniteUI.AthenaGameOverDisplay.OnPlaceChanged // (Final|Native|Protected) // @ game+0x9af72d4
	void OnPawnDied(struct FFortPlayerDeathReport& DeathReport); // Function FortniteUI.AthenaGameOverDisplay.OnPawnDied // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9af7224
	void OnKillFeedUpdated(); // Function FortniteUI.AthenaGameOverDisplay.OnKillFeedUpdated // (Final|Native|Protected) // @ game+0x9af7140
	void InGameMatchmakingComplete(bool bSuccess); // Function FortniteUI.AthenaGameOverDisplay.InGameMatchmakingComplete // (Final|Native|Protected) // @ game+0x9af6dc8
	void HighlightCountChanged(int32_t HighlightCount); // Function FortniteUI.AthenaGameOverDisplay.HighlightCountChanged // (Final|Native|Protected) // @ game+0x9af6d48
	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* NewSpectatorPawn); // Function FortniteUI.AthenaGameOverDisplay.HandleToggledBattleMapLive // (Final|Native|Protected) // @ game+0x9af6b8c
};

// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
// Size: 0x340 (Inherited: 0x320)
struct UAthenaGenericHUDTimerWidgetBase : UFortHUDElementWidget {
	char pad_320[0x10]; // 0x320(0x10)
	struct UTextBlock* TimeText; // 0x330(0x08)
	char pad_338[0x8]; // 0x338(0x08)

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.AthenaGenericHUDTimerWidgetBase.HandleGamePhaseChanged // (Final|Native|Protected) // @ game+0x9af62b4
};

// Class FortniteUI.AthenaHUDSituationalFeedback
// Size: 0x330 (Inherited: 0x320)
struct UAthenaHUDSituationalFeedback : UFortHUDElementWidget {
	struct UFortDynamicEntryBox* EntryBox_Feedback; // 0x320(0x08)
	bool bPrecreateFeedbackEntries; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
};

// Class FortniteUI.AthenaGenericKeyBindsFeedback
// Size: 0x358 (Inherited: 0x330)
struct UAthenaGenericKeyBindsFeedback : UAthenaHUDSituationalFeedback {
	struct TArray<struct FGenericAction> GenericActions; // 0x330(0x10)
	char pad_340[0x18]; // 0x340(0x18)

	void HandleWeaponHUDKeyActionUpdated(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleWeaponHUDKeyActionUpdated // (Final|Native|Private) // @ game+0x9af6ccc
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PreviousWeapon); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleWeaponEquipped // (Final|Native|Private) // @ game+0x9af6c10
	void HandleTetherChanged(bool bIsTethered); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleTetherChanged // (Final|Native|Private) // @ game+0x9af6b04
	void HandleSavedTabChanged(bool IsTabSaved); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleSavedTabChanged // (Final|Native|Private) // @ game+0x9af68e0
	void HandleKeybindsChanged(); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleKeybindsChanged // (Final|Native|Private) // @ game+0x9af64b4
	void HandleInputStackChanged(); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleInputStackChanged // (Final|Native|Private) // @ game+0x9af64b4
	void HandleInputComponentDisplayTextChanged(struct UFortInputComponent* UpdatedInputComponent); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleInputComponentDisplayTextChanged // (Final|Native|Private) // @ game+0x504eb30
	void HandleGenericActionRemoved(struct FName ActionName); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleGenericActionRemoved // (Final|Native|Private) // @ game+0x9af6434
	void HandleGenericActionAdded(struct FName ActionName, struct FText DescriptionText); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleGenericActionAdded // (Final|Native|Private) // @ game+0x9af6354
	void HandleEnterExitVehicle(); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleEnterExitVehicle // (Final|Native|Private) // @ game+0x9af62a0
	void HandleDBNOCarryPlayerChanged(bool bIsCarrying); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleDBNOCarryPlayerChanged // (Final|Native|Private) // @ game+0x9af6218
};

// Class FortniteUI.AthenaGiftReceivedPrompt
// Size: 0x478 (Inherited: 0x3f8)
struct UAthenaGiftReceivedPrompt : UCommonActivatableWidget {
	struct UFortItemPresentationScreen* ItemPresentationScreenClass; // 0x3f8(0x08)
	struct TSoftObjectPtr<UMaterialInterface> GiftMaterial; // 0x400(0x28)
	struct UFortGiftBoxItem* GiftBoxItem; // 0x428(0x08)
	struct UFortItemReceivedHeaderBase* Widget_HeaderInfo; // 0x430(0x08)
	struct UCommonButtonLegacy* Button_Open; // 0x438(0x08)
	struct UCommonLazyImage* Image_GiftBox; // 0x440(0x08)
	char pad_448[0x30]; // 0x448(0x30)

	void OnGiftInfoPopulated(); // Function FortniteUI.AthenaGiftReceivedPrompt.OnGiftInfoPopulated // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnCloseButtonClicked(); // Function FortniteUI.AthenaGiftReceivedPrompt.OnCloseButtonClicked // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void HandleMessageTextFiltered(bool bSuccess, struct FString SanitizedMessage); // Function FortniteUI.AthenaGiftReceivedPrompt.HandleMessageTextFiltered // (Final|Native|Protected) // @ game+0x9af64c8
	void DismissPrompt(); // Function FortniteUI.AthenaGiftReceivedPrompt.DismissPrompt // (Final|Native|Protected|BlueprintCallable) // @ game+0x9af60c0
};

// Class FortniteUI.AthenaGlobalCurrencyWidget
// Size: 0x2e8 (Inherited: 0x2e0)
struct UAthenaGlobalCurrencyWidget : UCommonUserWidget {
	struct UCommonNumericTextBlock* CurrencyTotalText; // 0x2e0(0x08)

	void HandleOnItemCountChanged(struct UFortItemDefinition* Definition, int32_t Delta); // Function FortniteUI.AthenaGlobalCurrencyWidget.HandleOnItemCountChanged // (Final|Native|Protected) // @ game+0x9af6674
};

// Class FortniteUI.AthenaGoalsPageBaseCard
// Size: 0x2e0 (Inherited: 0x2b8)
struct UAthenaGoalsPageBaseCard : UUserWidget {
	struct UCommonListView* ListView_Goals; // 0x2b8(0x08)
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeRemaining; // 0x2c0(0x08)
	struct UPanelWidget* Panel_TimeRemaining; // 0x2c8(0x08)
	char pad_2D0[0x10]; // 0x2d0(0x10)

	void ShowNewBang(bool bEnabled); // Function FortniteUI.AthenaGoalsPageBaseCard.ShowNewBang // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnTimerSet(enum class EAthenaChallengeTimerState TimerState); // Function FortniteUI.AthenaGoalsPageBaseCard.OnTimerSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGoalsPageQuestCard
// Size: 0x300 (Inherited: 0x2e0)
struct UAthenaGoalsPageQuestCard : UAthenaGoalsPageBaseCard {
	struct UFortLazyImage* LazyImage_HeaderBackground; // 0x2e0(0x08)
	struct UCommonTextBlock* Text_BundleID; // 0x2e8(0x08)
	struct TArray<struct UFortQuestItem*> PrevQuestList; // 0x2f0(0x10)

	void PopulateHeader(struct FBundleGoalCardDisplayData& GoalCardDisplayData); // Function FortniteUI.AthenaGoalsPageQuestCard.PopulateHeader // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGoalsPageQuestCardLine
// Size: 0x2e0 (Inherited: 0x2b8)
struct UAthenaGoalsPageQuestCardLine : UUserWidget {
	char pad_2B8[0x8]; // 0x2b8(0x08)
	struct UCommonRichTextBlock* RichText_GoalName; // 0x2c0(0x08)
	struct UAthenaChallengeRewards* UserWidget_Rewards; // 0x2c8(0x08)
	struct UCommonTextBlock* Text_QuestID; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)

	void SetObjectiveProgress(int32_t Achieved, int32_t Required); // Function FortniteUI.AthenaGoalsPageQuestCardLine.SetObjectiveProgress // (Event|Protected|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGoalsPageQuestChainCard
// Size: 0x328 (Inherited: 0x2e0)
struct UAthenaGoalsPageQuestChainCard : UAthenaGoalsPageBaseCard {
	struct FText DefaultSubHeaderText; // 0x2e0(0x18)
	struct UCommonTextBlock* Text_Header; // 0x2f8(0x08)
	struct UFortLazyImage* LazyImage_HeaderBackground; // 0x300(0x08)
	struct UCommonTextBlock* Text_SubHeader; // 0x308(0x08)
	char pad_310[0x8]; // 0x310(0x08)
	struct TArray<struct UFortQuestItem*> PrevQuestList; // 0x318(0x10)

	bool IsCardPinned(); // Function FortniteUI.AthenaGoalsPageQuestChainCard.IsCardPinned // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9af9bb0
	void BP_OnCardUnpinned(bool bAnimate); // Function FortniteUI.AthenaGoalsPageQuestChainCard.BP_OnCardUnpinned // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BP_OnCardPinned(struct FLinearColor& LocalPinColor, bool bAnimate); // Function FortniteUI.AthenaGoalsPageQuestChainCard.BP_OnCardPinned // (Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGoalsPageQuestRewardLine
// Size: 0x2d0 (Inherited: 0x2b8)
struct UAthenaGoalsPageQuestRewardLine : UUserWidget {
	char pad_2B8[0x8]; // 0x2b8(0x08)
	struct UAthenaChallengeRewards* UserWidget_Rewards; // 0x2c0(0x08)
	char pad_2C8[0x8]; // 0x2c8(0x08)

	void SetToDefaultSlot(); // Function FortniteUI.AthenaGoalsPageQuestRewardLine.SetToDefaultSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetObjectiveProgress(int32_t Achieved, int32_t Required); // Function FortniteUI.AthenaGoalsPageQuestRewardLine.SetObjectiveProgress // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void SetIsLastSlot(); // Function FortniteUI.AthenaGoalsPageQuestRewardLine.SetIsLastSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void SetIsFirstSlot(); // Function FortniteUI.AthenaGoalsPageQuestRewardLine.SetIsFirstSlot // (Event|Public|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGoalsPageTabList
// Size: 0x328 (Inherited: 0x2e0)
struct UAthenaGoalsPageTabList : UCommonUserWidget {
	struct UFortTabListWidgetBase* TabList_GoalCategories; // 0x2e0(0x08)
	struct UAthenaMapChallengeCategoryTabButton* TabButtonClass; // 0x2e8(0x08)
	struct TArray<struct FGoalsPageCategoryTabData> GoalTabsData; // 0x2f0(0x10)
	struct UObject* DefaultTabDisplayAsset; // 0x300(0x08)
	char pad_308[0x20]; // 0x308(0x20)

	void SetTabName(struct FText& DisplayName); // Function FortniteUI.AthenaGoalsPageTabList.SetTabName // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
	void HandleTabSelected(struct FName TabNameID); // Function FortniteUI.AthenaGoalsPageTabList.HandleTabSelected // (Final|Native|Private) // @ game+0x9af9944
	void HandleTabButtonCreated(struct FName TabId, struct UCommonButtonBase* TabButton); // Function FortniteUI.AthenaGoalsPageTabList.HandleTabButtonCreated // (Final|Native|Private) // @ game+0x9af978c
};

// Class FortniteUI.FortMessageReceivedScreen
// Size: 0x588 (Inherited: 0x568)
struct UFortMessageReceivedScreen : UFortActivatablePanel {
	struct FMulticastInlineDelegate OnMessageClosed; // 0x568(0x10)
	struct UFortGiftBoxItem* GiftBoxItem; // 0x578(0x08)
	struct UCommonLazyImage* GiftBoxImage; // 0x580(0x08)

	void OnGiftBoxSet(); // Function FortniteUI.FortMessageReceivedScreen.OnGiftBoxSet // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void OnFinalGiftingComplete__DelegateSignature(); // DelegateFunction FortniteUI.FortMessageReceivedScreen.OnFinalGiftingComplete__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	bool GetTournamentTitleFromCMS(struct FString DisplayDataId, struct FString& OutTitle); // Function FortniteUI.FortMessageReceivedScreen.GetTournamentTitleFromCMS // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x9b52480
	struct FText GetHeaderAssetString(struct FString Param); // Function FortniteUI.FortMessageReceivedScreen.GetHeaderAssetString // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b52098
	struct FText GetBodyAssetString(struct FString Param); // Function FortniteUI.FortMessageReceivedScreen.GetBodyAssetString // (Final|Native|Protected|BlueprintCallable) // @ game+0x9b51f14
};

// Class FortniteUI.AthenaGrantChallengeModal
// Size: 0x5b0 (Inherited: 0x588)
struct UAthenaGrantChallengeModal : UFortMessageReceivedScreen {
	struct TArray<struct UFortChallengeBundleItemDefinition*> BundleDefs; // 0x588(0x10)
	struct UCommonTextBlock* Text_ChallengeName; // 0x598(0x08)
	struct UCommonTextBlock* Text_ChallengeContext; // 0x5a0(0x08)
	struct UCommonTextBlock* Text_BodyCopy; // 0x5a8(0x08)

	void ShowNextChallengePopup(); // Function FortniteUI.AthenaGrantChallengeModal.ShowNextChallengePopup // (Final|Native|Protected|BlueprintCallable) // @ game+0x9afac6c
	void OnChallengeBundleSet(struct FFortChallengeSetStyle& DisplayStyle); // Function FortniteUI.AthenaGrantChallengeModal.OnChallengeBundleSet // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda071c
};

// Class FortniteUI.AthenaGroupChallengeTag
// Size: 0x2c0 (Inherited: 0x2b8)
struct UAthenaGroupChallengeTag : UUserWidget {
	struct UWidgetAnimation* Anim_Flash; // 0x2b8(0x08)

	void HandleOnToggleFullScreenMap(bool bIsMapVisible); // Function FortniteUI.AthenaGroupChallengeTag.HandleOnToggleFullScreenMap // (Final|Native|Private) // @ game+0x9af953c
};

// Class FortniteUI.AthenaHUDContext
// Size: 0x488 (Inherited: 0x30)
struct UAthenaHUDContext : UBlueprintContextBase {
	char pad_30[0x8]; // 0x30(0x08)
	struct FMulticastInlineDelegate OnLocalPlayerWon; // 0x38(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerDeathOnWin; // 0x48(0x10)
	struct FMulticastInlineDelegate OnLocalTeamWon; // 0x58(0x10)
	struct FMulticastInlineDelegate OnLocalTeamLost; // 0x68(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerLost; // 0x78(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerKilledPlayer; // 0x88(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerDBNOStateChanged; // 0x98(0x10)
	struct FMulticastInlineDelegate OnPawnEmoteStopped; // 0xa8(0x10)
	struct FMulticastInlineDelegate OnUIGameplayCue; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerBeginSkydiving; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnAthenaAutoFireChanged; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnAthenaGamePhaseChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnPlayerFiredWeapon; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnShowUrgentQuestMessage; // 0x108(0x10)
	struct FMulticastInlineDelegate OnDuelChange; // 0x118(0x10)
	struct FMulticastInlineDelegate OnLowPerformanceMode; // 0x128(0x10)
	struct FMulticastInlineDelegate OnPTTStateChange; // 0x138(0x10)
	struct FMulticastInlineDelegate OnCanPTTChange; // 0x148(0x10)
	struct FMulticastInlineDelegate ShowMobilePickerDelegate; // 0x158(0x10)
	struct FMulticastInlineDelegate OnPlayerNameChangeDelegate; // 0x168(0x10)
	struct FMulticastInlineDelegate OnResurrectingNowDelegate; // 0x178(0x10)
	struct FMulticastInlineDelegate OnAllWinnersAnnouncedDelegate; // 0x188(0x10)
	struct FMulticastInlineDelegate OnSignalQualityChangeDelegate; // 0x198(0x10)
	struct FMulticastInlineDelegate OnForwardStartedFalling; // 0x1a8(0x10)
	struct FMulticastInlineDelegate OnSpecialActorListChanged; // 0x1b8(0x10)
	char pad_1C8[0x18]; // 0x1c8(0x18)
	struct FMulticastInlineDelegate OnFireStopped; // 0x1e0(0x10)
	struct FMulticastInlineDelegate OnPostGameWidgetPlacementChange; // 0x1f0(0x10)
	struct FMulticastInlineDelegate OnForceStartPostGameFlow; // 0x200(0x10)
	struct FMulticastInlineDelegate OnForceAllQuickbarsMinimizedChanged; // 0x210(0x10)
	struct FMulticastInlineDelegate OnPlaylistExtensionWidgetCreatedNotSupported; // 0x220(0x10)
	struct FMulticastInlineDelegate OnClearPlaylistExtensionWidgetNotSupported; // 0x230(0x10)
	struct FMulticastInlineDelegate OnStartPostGameMenu; // 0x240(0x10)
	struct FMulticastInlineDelegate OnRecoverFromPostGameMenu; // 0x250(0x10)
	struct FMulticastInlineDelegate OnOverrideInventoryPanel; // 0x260(0x10)
	char pad_270[0x1a0]; // 0x270(0x1a0)
	struct TWeakObjectPtr<struct UWidget> MoveButtonWidgetPtr; // 0x410(0x08)
	struct FAthenaWinnerInfo WinnerInfo; // 0x418(0x20)
	char pad_438[0x1]; // 0x438(0x01)
	bool bMoveButtonMode; // 0x439(0x01)
	bool bPendingAttachToHUD; // 0x43a(0x01)
	bool bLocalPlayerWonMatch; // 0x43b(0x01)
	struct TWeakObjectPtr<struct AFortPlayerPawnAthena> BoundPlayerPawn; // 0x43c(0x08)
	char pad_444[0x4]; // 0x444(0x04)
	struct UAthenaPlayerViewModel* PlayerViewModel; // 0x448(0x08)
	char pad_450[0x38]; // 0x450(0x38)

	float VictoryStingerTimeUntilFadeOut(); // Function FortniteUI.AthenaHUDContext.VictoryStingerTimeUntilFadeOut // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9afb534
	bool UseTapToShoot(); // Function FortniteUI.AthenaHUDContext.UseTapToShoot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x760af7c
	void UseOrRleoadFromHUDStop(); // Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStop // (Final|Native|Public|BlueprintCallable) // @ game+0x9afb508
	void UseOrRleoadFromHUDStart(); // Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStart // (Final|Native|Public|BlueprintCallable) // @ game+0x9afb4dc
	void UpdateSelectedWidgetMoveOffsetVector(struct FVector2D& VectorOffset, float fMoveScale); // Function FortniteUI.AthenaHUDContext.UpdateSelectedWidgetMoveOffsetVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9afb400
	void TryBestUseForActor(struct AActor* ActorToUse); // Function FortniteUI.AthenaHUDContext.TryBestUseForActor // (Final|Native|Public|BlueprintCallable) // @ game+0x9afb348
	void TakeMovementInputFromHUD(struct FVector2D MoveVector); // Function FortniteUI.AthenaHUDContext.TakeMovementInputFromHUD // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9afb2c0
	void TakeLookStickInputFromHUD(struct FVector2D LookStickPosition); // Function FortniteUI.AthenaHUDContext.TakeLookStickInputFromHUD // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9afb238
	void TakeLookInputFromHUD(struct FRotator LookRotator); // Function FortniteUI.AthenaHUDContext.TakeLookInputFromHUD // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x9afb1a8
	void TakeItemSelectionInputFromHUD(int32_t TouchIndex, int32_t SlotIdx, bool& bIsUsing, enum class EFortQuickBars InQuickBar, bool bReloadOrUseIfAlreadySelected, bool bStopUseImmediately); // Function FortniteUI.AthenaHUDContext.TakeItemSelectionInputFromHUD // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9afafc8
	void SwitchToPrimaryQuickbar(); // Function FortniteUI.AthenaHUDContext.SwitchToPrimaryQuickbar // (Final|Native|Public|BlueprintCallable) // @ game+0x9afaf9c
	void SwapQuickBarFocusFromHUD(enum class EFortQuickBars InQuickBar, int32_t SlotOverride); // Function FortniteUI.AthenaHUDContext.SwapQuickBarFocusFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x9afaec4
	void StopTargettingFromHUD(); // Function FortniteUI.AthenaHUDContext.StopTargettingFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x9afae8c
	void StopItemSelectionInputFromHUD(int32_t TouchIndex, int32_t SlotIdx, enum class EFortQuickBars InQuickBar); // Function FortniteUI.AthenaHUDContext.StopItemSelectionInputFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x9afad94
	void StartPostGameMenu(); // Function FortniteUI.AthenaHUDContext.StartPostGameMenu // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9afad78
	void ShowUrgentQuestMessage(struct FUrgentQuestData& UrgentQuestData); // Function FortniteUI.AthenaHUDContext.ShowUrgentQuestMessage // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9afac80
	void ShowMobilePicker__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.ShowMobilePicker__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void ShowMobilePicker(); // Function FortniteUI.AthenaHUDContext.ShowMobilePicker // (Final|Native|Public|BlueprintCallable) // @ game+0x9afac50
	void ShowMarkerGameModeMessage(int32_t PlayerId, int32_t InstanceID); // Function FortniteUI.AthenaHUDContext.ShowMarkerGameModeMessage // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9afab70
	void ShowGameModeMessage(); // Function FortniteUI.AthenaHUDContext.ShowGameModeMessage // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9afab40
	void ShowDuelUpdate(enum class EDuelState DuelState, struct FDuelOverlayData& DuelOverlayData); // Function FortniteUI.AthenaHUDContext.ShowDuelUpdate // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x9afaa28
	bool ShouldVictoryUIPushEmoteInput(); // Function FortniteUI.AthenaHUDContext.ShouldVictoryUIPushEmoteInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9afa9f0
	bool ShouldPlayCustomEndScreenAtLoss(); // Function FortniteUI.AthenaHUDContext.ShouldPlayCustomEndScreenAtLoss // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9afa9b8
	bool ShouldDisplayScoreUI(); // Function FortniteUI.AthenaHUDContext.ShouldDisplayScoreUI // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa994
	bool ShouldDisplayPlacement(); // Function FortniteUI.AthenaHUDContext.ShouldDisplayPlacement // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa970
	bool ShouldAlwaysDisplaySquadInfo(); // Function FortniteUI.AthenaHUDContext.ShouldAlwaysDisplaySquadInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa94c
	void SetTargetingToggleable(bool bNewValue); // Function FortniteUI.AthenaHUDContext.SetTargetingToggleable // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa830
	void SetSelectWidgetToMoveMode(bool bSet); // Function FortniteUI.AthenaHUDContext.SetSelectWidgetToMoveMode // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa714
	void SetSelectedInventoryItem(struct UFortItem* Item); // Function FortniteUI.AthenaHUDContext.SetSelectedInventoryItem // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa7b0
	void SetResourceMaterial(enum class EFortResourceType NewMaterial); // Function FortniteUI.AthenaHUDContext.SetResourceMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa690
	void SetPTTState(enum class EPTTState NewPushToTalkState); // Function FortniteUI.AthenaHUDContext.SetPTTState // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa590
	void SetPostGameWidgetPlacement(struct FName WidgetPlacement); // Function FortniteUI.AthenaHUDContext.SetPostGameWidgetPlacement // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa610
	void SetLockOnStickCoords(struct FVector2D& LockOnCoords); // Function FortniteUI.AthenaHUDContext.SetLockOnStickCoords // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x9afa518
	void SetLocalPlayerWonMatch(bool bLocalPlayerWon); // Function FortniteUI.AthenaHUDContext.SetLocalPlayerWonMatch // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa498
	void SelectWidgetToMove(struct UWidget* Widget); // Function FortniteUI.AthenaHUDContext.SelectWidgetToMove // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa390
	void ReloadFromHUD(); // Function FortniteUI.AthenaHUDContext.ReloadFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa364
	void RecoverFromPostGameMenu(); // Function FortniteUI.AthenaHUDContext.RecoverFromPostGameMenu // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9afa334
	void PushGameOverEmoteInput(); // Function FortniteUI.AthenaHUDContext.PushGameOverEmoteInput // (Final|Native|Public|BlueprintCallable) // @ game+0x9afa30c
	void PTTStateChange__DelegateSignature(enum class EPTTState NewPushToTalkState); // DelegateFunction FortniteUI.AthenaHUDContext.PTTStateChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	bool OwnerOrWeaponHasTag(struct FGameplayTag InTag); // Function FortniteUI.AthenaHUDContext.OwnerOrWeaponHasTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x9afa184
	void OverrideInventoryPanel(struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDContext.OverrideInventoryPanel // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x9afa0f4
	void OnStartPostGameMenu__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnStartPostGameMenu__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnSpecialActorListChanged__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnSpecialActorListChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnSignalQualityChange__DelegateSignature(float NewQuality); // DelegateFunction FortniteUI.AthenaHUDContext.OnSignalQualityChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnShowUrgentQuestMessage__DelegateSignature(struct FUrgentQuestData& UrgentQuestData, float EventTimeRemaining); // DelegateFunction FortniteUI.AthenaHUDContext.OnShowUrgentQuestMessage__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0xda071c
	void OnResurrectingNow__DelegateSignature(bool bResurrectingNow); // DelegateFunction FortniteUI.AthenaHUDContext.OnResurrectingNow__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnRecoverFromPostGameMenu__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnRecoverFromPostGameMenu__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnReadyForWinnerInfoDisplay(); // Function FortniteUI.AthenaHUDContext.OnReadyForWinnerInfoDisplay // (Final|Native|Private) // @ game+0x9afa07c
	void OnPostGameWidgetPlacement__DelegateSignature(struct FName WidgetPlacement); // DelegateFunction FortniteUI.AthenaHUDContext.OnPostGameWidgetPlacement__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnPlaylistExtensionWidgetCreatedNotSupported__DelegateSignature(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // DelegateFunction FortniteUI.AthenaHUDContext.OnPlaylistExtensionWidgetCreatedNotSupported__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnPlayerNameChange__DelegateSignature(struct FString NewName); // DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerNameChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnPlayerFiredWeapon__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerFiredWeapon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnPawnEmoteStopped__DelegateSignature(struct UFortItemDefinition* MontageItemDef, struct AFortPawn* PawnEmoting); // DelegateFunction FortniteUI.AthenaHUDContext.OnPawnEmoteStopped__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnOverrideInventoryPanel__DelegateSignature(struct UUserWidget* Widget); // DelegateFunction FortniteUI.AthenaHUDContext.OnOverrideInventoryPanel__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLowPerformanceMode__DelegateSignature(bool bInLowPerformanceMode); // DelegateFunction FortniteUI.AthenaHUDContext.OnLowPerformanceMode__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalTeamWon__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamWon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalTeamLost__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamLost__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalPlayerWon__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerWon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalPlayerLost__DelegateSignature(enum class EEndOfMatchReason LostReason); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerLost__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalPlayerKilledPlayer__DelegateSignature(struct AFortPlayerStateAthena* Player); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerKilledPlayer__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalPlayerDeathOnWin__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDeathOnWin__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalPlayerDBNOStateChanged__DelegateSignature(bool bIsDBNO); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDBNOStateChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnLocalPlayerBeginSkydiving__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerBeginSkydiving__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
	void OnForwardStartedFalling__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnForwardStartedFalling__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda071c
