// AnimBlueprintGeneratedClass Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C
// Size: 0x1a58 (Inherited: 0x700)
struct UFortnite_Base_Head_Export_Skeleton_AnimBP_C : UHeadPartAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x700(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x708(0x05)
	char pad_70D[0x3]; // 0x70d(0x03)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x710(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x718(0x08)
	struct FAnimNode_TwoWayBlend ; // 0x720(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x7e0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x8e0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x908(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x930(0x100)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xa30(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0xa78(0xe0)
	struct FAnimNode_SaveCachedPose ; // 0xb58(0x100)
	struct FAnimNode_UseCachedPose ; // 0xc58(0x28)
	struct FAnimNode_UseCachedPose ; // 0xc80(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xca8(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xdd0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xdf0(0x20)
	struct FAnimNode_SaveCachedPose ; // 0xe10(0x100)
	struct FAnimNode_UseCachedPose ; // 0xf10(0x28)
	struct FAnimNode_BlendListByBool ; // 0xf38(0x48)
	struct FAnimNode_UseCachedPose ; // 0xf80(0x28)
	struct FAnimNode_SaveCachedPose ; // 0xfa8(0x100)
	struct FAnimNode_LayeredBoneBlend ; // 0x10a8(0xe0)
	struct FAnimNode_BlendListByEnum ; // 0x1188(0x48)
	struct FAnimNode_UseCachedPose ; // 0x11d0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x11f8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1220(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1320(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1348(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x1428(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1450(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1478(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x14a0(0x48)
	struct FAnimNode_UseCachedPose ; // 0x14e8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1510(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1558(0x28)
	struct FAnimNode_LiveLinkPose ; // 0x1580(0x48)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x15c8(0x1d0)
	struct FAnimNode_LiveLinkPose AnimGraphNode_LiveLinkPose; // 0x1798(0x48)
	struct FAnimNode_SequencePlayer ; // 0x17e0(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1820(0x40)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x1860(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1910(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1938(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x19f8(0x20)
	struct USkeletalMeshComponent* MeshToCopy; // 0x1a18(0x08)
	bool GetPlayerListUsesCustomCharacterParts; // 0x1a20(0x01)
	bool bIsMoving; // 0x1a21(0x01)
	bool ; // 0x1a22(0x01)
	bool ; // 0x1a23(0x01)
	bool bIsFallingLocal; // 0x1a24(0x01)
	bool bIsJumpingLocal; // 0x1a25(0x01)
	bool ; // 0x1a26(0x01)
	bool bIsCrouchWalking; // 0x1a27(0x01)
	bool ; // 0x1a28(0x01)
	bool ; // 0x1a29(0x01)
	bool ; // 0x1a2a(0x01)
	bool ; // 0x1a2b(0x01)
	bool ; // 0x1a2c(0x01)
	bool bIsDancing; // 0x1a2d(0x01)
	bool ; // 0x1a2e(0x01)
	bool ; // 0x1a2f(0x01)
	bool ; // 0x1a30(0x01)
	char pad_1A31[0x7]; // 0x1a31(0x07)
	double LastFireTime; // 0x1a38(0x08)
	bool IsSkydiving0; // 0x1a40(0x01)
	bool IsDive0; // 0x1a41(0x01)
	char pad_1A42[0x6]; // 0x1a42(0x06)
	double LookYaw; // 0x1a48(0x08)
	double LookPitch; // 0x1a50(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void BlueprintInitializeAnimation(); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP(int32_t EntryPoint); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP // (Final|UbergraphFunction) // @ game+0xda071c
};

