// Class GrappleParentRuntime.FortCameraModifier_Swinging
// Size: 0x288 (Inherited: 0x48)
struct UFortCameraModifier_Swinging : UCameraModifier {
	float MaxVelocityDeltaPerSecond; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UCurveFloat* BlendInCurve; // 0x50(0x08)
	struct UCurveFloat* BlendOutCurve; // 0x58(0x08)
	struct FSpeedScaledAxisOffsetData ForwardOffsetData; // 0x60(0x60)
	struct FVector2D TotalForwardOffsetBounds; // 0xc0(0x10)
	struct FSpeedScaledAxisOffsetData RightOffsetData; // 0xd0(0x60)
	struct FVector2D RightForwardOffsetMultiplierBounds; // 0x130(0x10)
	struct FSpeedScaledAxisOffsetData UpOffsetData; // 0x140(0x60)
	struct FVector2D UpPositiveForwardOffsetMultiplierBounds; // 0x1a0(0x10)
	struct FVector2D UpNegativeForwardOffsetMultiplierBounds; // 0x1b0(0x10)
	float FOVInterpSpeed; // 0x1c0(0x04)
	char pad_1C4[0x4]; // 0x1c4(0x04)
	struct FVector2D FOVBounds; // 0x1c8(0x10)
	struct UCurveFloat* BoostCurve; // 0x1d8(0x08)
	struct FScalableFloat BoostModifier; // 0x1e0(0x28)
	float AttachBoostDuration; // 0x208(0x04)
	float AttachBoostMagnitude; // 0x20c(0x04)
	float DetachBoostDuration; // 0x210(0x04)
	float DetachBoostMagnitude; // 0x214(0x04)
	struct UCurveFloat* SlidingHeightCurve; // 0x218(0x08)
	struct FGameplayTag SlidingGameplayTag; // 0x220(0x04)
	float SlideHeightTransitionDuration; // 0x224(0x04)
	float MaxSlidingSpeedMultiplierOffset; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct AFortPlayerPawnAthena* CachedPlayer; // 0x230(0x08)
	struct AFortWeaponRangedDualSwing* CachedWeapon; // 0x238(0x08)
	char pad_240[0x48]; // 0x240(0x48)

	void RemoveSelfFromCameraManager(); // Function GrappleParentRuntime.FortCameraModifier_Swinging.RemoveSelfFromCameraManager // (Final|Native|Protected) // @ game+0x4c61b30
	void CalculateDynamicMultipliers(float& OutFOVBoundsMultiplier, float& OutBoostOffsetMultiplier); // Function GrappleParentRuntime.FortCameraModifier_Swinging.CalculateDynamicMultipliers // (Native|Event|Protected|HasOutParms|BlueprintEvent|Const) // @ game+0x4c61a10
};

// Class GrappleParentRuntime.FortSwingingLayerAnimInstance
// Size: 0x5e0 (Inherited: 0x440)
struct UFortSwingingLayerAnimInstance : UFortBaseLayerAnimInstance {
	struct UAnimInstance* MainAnimBP; // 0x438(0x08)
	struct AFortPlayerPawnAthena* Player; // 0x440(0x08)
	bool IsGroundSwing; // 0x448(0x01)
	bool IsFemale; // 0x449(0x01)
	float PlayerDistanceToGround; // 0x44c(0x04)
	bool CalculateRotation; // 0x450(0x01)
	char pad_457[0x1]; // 0x457(0x01)
	struct FScalableFloat ForwardInfluenceOnRotation; // 0x458(0x28)
	struct FScalableFloat TimeForMaxRotationSpeed; // 0x480(0x28)
	struct FScalableFloat MaxRotationSpeed; // 0x4a8(0x28)
	struct FScalableFloat RotationSpeedWhileNotAttached; // 0x4d0(0x28)
	struct FScalableFloat RotationSpeedWhileNotRotated; // 0x4f8(0x28)
	struct AActor* GetAttachedActor; // 0x520(0x08)
	bool isFreeFalling; // 0x528(0x01)
	bool IsAttached; // 0x529(0x01)
	bool IsNotAttachedToCliff; // 0x52a(0x01)
	char pad_52B[0x5]; // 0x52b(0x05)
	struct FVector Velocity; // 0x530(0x18)
	struct FVector XYVelocity; // 0x548(0x18)
	struct FVector VecFromPlayerToAttachPoint; // 0x560(0x18)
	float PitchAngleFromAttachPoint; // 0x578(0x04)
	float RollAngle; // 0x57c(0x04)
	float YawAngleToAttachTarget; // 0x580(0x04)
	struct FName CurveName_SwingPhase; // 0x584(0x04)
	struct FName CurveName_BlendOut; // 0x588(0x04)
	float SwingPhase; // 0x58c(0x04)
	struct FRotator CurrentRootRotation; // 0x590(0x18)
	struct FVector CurrentRootTranslation; // 0x5a8(0x18)
	bool IsSwingRelease1; // 0x5c0(0x01)
	bool IsSwingRelease2; // 0x5c1(0x01)
	bool IsSwingRelease3; // 0x5c2(0x01)
	bool IsSwingRelease4; // 0x5c3(0x01)
	bool IsSwingRelease5; // 0x5c4(0x01)
	bool IsSwingReleaseSkid; // 0x5c5(0x01)
	bool IsMovingAttachPoint; // 0x5c6(0x01)
	bool IsBlendOut; // 0x5c7(0x01)
	float WebCastAttachDirection; // 0x5c8(0x04)
	bool IsWebCastDown; // 0x5cc(0x01)
	bool IsSwingOneHand; // 0x5cd(0x01)
	bool IsRandomHandBool; // 0x5ce(0x01)
	bool IsRandomSwingReleaseBool; // 0x5cf(0x01)
	bool IsRandomeReleaseBool; // 0x5d0(0x01)
	bool IsWithin100UnitsOfGround; // 0x5d1(0x01)
	bool IsHanging; // 0x5d2(0x01)
	bool IsFallRelease; // 0x5d3(0x01)
	bool IsOnGroundWebCast; // 0x5d4(0x01)
	bool IsSwingNearGroundToSkid; // 0x5d5(0x01)
	bool IsHangToSwingInAir; // 0x5d6(0x01)
	bool IsHangToSwingNearGround; // 0x5d7(0x01)
	char pad_5D8[0x8]; // 0x5d8(0x08)

	void GetPlayerAnglesFromAttachPoint(float& Pitch, float& Roll, float& Yaw); // Function GrappleParentRuntime.FortSwingingLayerAnimInstance.GetPlayerAnglesFromAttachPoint // (Final|Native|Public|HasOutParms) // @ game+0x6536024
	struct FVector GetAttachVectorInPlayerSpace(struct FVector& InPlayerToAttachPoint); // Function GrappleParentRuntime.FortSwingingLayerAnimInstance.GetAttachVectorInPlayerSpace // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x6535f7c
};

