// AnimBlueprintGeneratedClass Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C
// Size: 0x7994 (Inherited: 0xe20)
struct UPlayer_ProceduralAdjustments_AnimBP_C : UFortPlayerProceduralAdjustmentsAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xe20(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xe28(0x0b)
	char pad_E33[0x5]; // 0xe33(0x05)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xe38(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xe40(0x08)
	struct FAnimNode_Root ; // 0xe48(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xe68(0xc0)
	struct FAnimNode_Root ; // 0xf28(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xf48(0xc0)
	struct FAnimNode_Root ; // 0x1008(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1028(0xc0)
	struct FAnimNode_Root ; // 0x10e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1108(0xc0)
	struct FAnimNode_Root ; // 0x11c8(0x20)
	struct FAnimNode_Root ; // 0x11e8(0x20)
	struct FAnimNode_Root ; // 0x1208(0x20)
	struct FAnimNode_Root ; // 0x1228(0x20)
	struct FAnimNode_Root ; // 0x1248(0x20)
	struct FAnimNode_Root ; // 0x1268(0x20)
	struct FAnimNode_Root ; // 0x1288(0x20)
	struct FAnimNode_Root ; // 0x12a8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x12c8(0xc0)
	struct FAnimNode_Root ; // 0x1388(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x13a8(0xc0)
	struct FAnimNode_Root ; // 0x1468(0x20)
	struct FAnimNode_Root ; // 0x1488(0x20)
	struct FAnimNode_Root ; // 0x14a8(0x20)
	struct FAnimNode_Root ; // 0x14c8(0x20)
	struct FAnimNode_Root ; // 0x14e8(0x20)
	struct FAnimNode_Root ; // 0x1508(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1528(0xc0)
	struct FAnimNode_Root ; // 0x15e8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1608(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x16c8(0xc0)
	struct FAnimNode_Root ; // 0x1788(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x17a8(0xc0)
	struct FAnimNode_Root ; // 0x1868(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1888(0xc0)
	struct FAnimNode_Root ; // 0x1948(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x1968(0x20)
	struct FAnimNode_ModifyBone ; // 0x1988(0x128)
	struct FAnimNode_ModifyBone ; // 0x1ab0(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x1bd8(0x20)
	struct FAnimNode_ModifyBone ; // 0x1bf8(0x128)
	struct FAnimNode_ModifyBone ; // 0x1d20(0x128)
	struct FAnimNode_ModifyBone ; // 0x1e48(0x128)
	struct FAnimNode_ModifyBone ; // 0x1f70(0x128)
	struct FAnimNode_LinkedInputPose ; // 0x2098(0xc0)
	struct FAnimNode_Root ; // 0x2158(0x20)
	struct FAnimNode_ModifyBone ; // 0x2178(0x128)
	struct FFortAnimNode_SlopeWarping FortAnimGraphNode_SlopeWarping; // 0x22a0(0x2e0)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2580(0x20)
	struct FAnimNode_BlendListByBool ; // 0x25a0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x25e8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2608(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2628(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2648(0xa8)
	struct FAnimNode_UseCachedPose ; // 0x26f0(0x28)
	struct FAnimNode_ModifyBone ; // 0x2718(0x128)
	struct FAnimNode_ModifyBone ; // 0x2840(0x128)
	struct FAnimNode_UseCachedPose ; // 0x2968(0x28)
	struct FAnimNode_ModifyBone ; // 0x2990(0x128)
	struct FAnimNode_ModifyBone ; // 0x2ab8(0x128)
	struct FAnimNode_SaveCachedPose ; // 0x2be0(0x100)
	struct FAnimNode_LinkedInputPose ; // 0x2ce0(0xc0)
	struct FAnimNode_Root ; // 0x2da0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x2dc0(0xc0)
	struct FAnimNode_ModifyBone ; // 0x2e80(0x128)
	struct FAnimNode_BlendListByBool ; // 0x2fa8(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2ff0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x3010(0x48)
	struct FAnimNode_ModifyBone ; // 0x3058(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3180(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x31a0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x31c0(0x20)
	struct FAnimNode_ModifyBone ; // 0x31e0(0x128)
	struct FAnimNode_ModifyBone ; // 0x3308(0x128)
	struct FAnimNode_ModifyBone ; // 0x3430(0x128)
	struct FAnimNode_ModifyBone ; // 0x3558(0x128)
	struct FAnimNode_BlendListByBool ; // 0x3680(0x48)
	struct FAnimNode_ModifyBone ; // 0x36c8(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x37f0(0x20)
	struct FAnimNode_ModifyBone ; // 0x3810(0x128)
	struct FAnimNode_ModifyBone ; // 0x3938(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3a60(0x20)
	struct FAnimNode_SaveCachedPose ; // 0x3a80(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3b80(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3ba8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3bd0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3bf8(0x28)
	struct FAnimNode_BlendListByBool ; // 0x3c20(0x48)
	struct FAnimNode_UseCachedPose ; // 0x3c68(0x28)
	struct FAnimNode_Root ; // 0x3c90(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x3cb0(0x20)
	struct FAnimNode_ModifyBone ; // 0x3cd0(0x128)
	struct FAnimNode_ModifyBone ; // 0x3df8(0x128)
	struct FAnimNode_LinkedInputPose ; // 0x3f20(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x3fe0(0x20)
	struct FAnimNode_Root ; // 0x4000(0x20)
	struct FAnimNode_ModifyBone ; // 0x4020(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4148(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4168(0x20)
	struct FAnimNode_ModifyBone ; // 0x4188(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x42b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x42d0(0x20)
	struct FAnimNode_UseCachedPose ; // 0x42f0(0x28)
	struct FAnimNode_ModifyBone ; // 0x4318(0x128)
	struct FAnimNode_ModifyBone ; // 0x4440(0x128)
	struct FAnimNode_UseCachedPose ; // 0x4568(0x28)
	struct FAnimNode_BlendListByBool ; // 0x4590(0x48)
	struct FAnimNode_LinkedInputPose ; // 0x45d8(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x4698(0x100)
	struct FAnimNode_Root ; // 0x4798(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x47b8(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4878(0x20)
	struct FAnimNode_ModifyBone ; // 0x4898(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x49c0(0x20)
	struct FAnimNode_ModifyBone ; // 0x49e0(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4b08(0x20)
	struct FAnimNode_BlendListByBool ; // 0x4b28(0x48)
	struct FAnimNode_ModifyBone ; // 0x4b70(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4c98(0x20)
	struct FAnimNode_UseCachedPose ; // 0x4cb8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x4ce0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x4de0(0x28)
	struct FAnimNode_Root ; // 0x4e08(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x4e28(0xc0)
	struct FAnimNode_CopyBone ; // 0x4ee8(0xe8)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4fd0(0x20)
	struct FAnimNode_CopyBone ; // 0x4ff0(0xe8)
	struct FAnimNode_LegIK ; // 0x50d8(0xf8)
	struct FAnimNode_LegIK ; // 0x51d0(0xf8)
	struct FAnimNode_CopyBone ; // 0x52c8(0xe8)
	struct FAnimNode_CopyBone ; // 0x53b0(0xe8)
	struct FAnimNode_CopyBone ; // 0x5498(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x5580(0x20)
	struct FAnimNode_CopyBone ; // 0x55a0(0xe8)
	struct FAnimNode_CopyBone ; // 0x5688(0xe8)
	struct FAnimNode_ModifyBone ; // 0x5770(0x128)
	struct FAnimNode_CopyBone ; // 0x5898(0xe8)
	struct FAnimNode_CopyBone ; // 0x5980(0xe8)
	struct FAnimNode_CopyBone ; // 0x5a68(0xe8)
	struct FAnimNode_ModifyBone ; // 0x5b50(0x128)
	struct FAnimNode_CopyBone ; // 0x5c78(0xe8)
	struct FAnimNode_ModifyBone ; // 0x5d60(0x128)
	struct FAnimNode_ModifyBone ; // 0x5e88(0x128)
	struct FAnimNode_ModifyBone ; // 0x5fb0(0x128)
	struct FAnimNode_CopyBone ; // 0x60d8(0xe8)
	struct FAnimNode_CopyBone ; // 0x61c0(0xe8)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x62a8(0xe8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x6390(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x63b0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x63f8(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x64d8(0x28)
	struct FAnimNode_SaveCachedPose ; // 0x6500(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x6600(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6700(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6728(0x48)
	struct FAnimNode_BlendListByBool ; // 0x6770(0x48)
	struct FAnimNode_SaveCachedPose ; // 0x67b8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x68b8(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x68e0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x69a8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x6aa8(0x28)
	struct FAnimNode_UseCachedPose ; // 0x6ad0(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x6af8(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x6bc0(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6c88(0x128)
	struct FAnimNode_UseCachedPose ; // 0x6db0(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x6dd8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6df8(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x6e40(0x20)
	struct FAnimNode_SaveCachedPose ; // 0x6e60(0x100)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x6f60(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7020(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x70e0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x71e0(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x7208(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x72d0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x7398(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x73c0(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x7488(0x28)
	struct FAnimNode_LinkedAnimLayer ; // 0x74b0(0xc8)
	struct FAnimNode_LinkedAnimLayer ; // 0x7578(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x7640(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7668(0x20)
	struct FAnimNode_LinkedAnimLayer ; // 0x7688(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7750(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x7778(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7798(0xc8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x7860(0xf8)
	bool IsHidingInProp; // 0x7958(0x01)
	char pad_7959[0x7]; // 0x7959(0x07)
	struct FVector RightHandOverride; // 0x7960(0x18)
	struct FVector LeftHandOverride; // 0x7978(0x18)
	struct FName EmoteAnimOffsetCurveName; // 0x7990(0x04)

	void FullBodyOverride(struct FPoseLink PassThroughFullBodyPose, struct FPoseLink& FullBodyOverride); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void CharacterSkeletalControlPostLegIK(struct FPoseLink InPosePostLegIK, struct FPoseLink& CharacterSkeletalControlPostLegIK); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.CharacterSkeletalControlPostLegIK // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink& ItemUpperBody); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink& ItemIdleAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJumpUpAdditive(struct FPoseLink& ItemJumpUpAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJumpLoopAdditive(struct FPoseLink& ItemJumpLoopAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFallAdditive(struct FPoseLink& ItemFallAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFallLandAdditive(struct FPoseLink& ItemFallLandAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJetPackStartAdditive(struct FPoseLink& ItemJetPackStartAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemJetPackJumpAdditive(struct FPoseLink& ItemJetPackJumpAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemZipLineStartAdditive(struct FPoseLink& ItemZipLineStartAdditive); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink& ItemLowerBodyMovement); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink& ItemRelaxedEntry); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpStart(struct FPoseLink& ItemSwimJumpStart); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpStartLoop(struct FPoseLink& ItemSwimJumpStartLoop); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpFallLoop(struct FPoseLink& ItemSwimJumpFallLoop); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpSurfaceLoop(struct FPoseLink& ItemSwimJumpSurfaceLoop); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSwimJumpSurfaceEnd(struct FPoseLink& ItemSwimJumpSurfaceEnd); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink& ItemSkeletalControl); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink& ItemAimOffset); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink& ItemFullBodyOverride); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink& ItemPreIK); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void PostIKAdjustmentsLayer(struct FPoseLink InPosePostIkAdjustments, struct FPoseLink& PostIKAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PostIKAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void PreIKAdjustmentsLayer(struct FPoseLink InPosePreIKAdjustments, struct FPoseLink& PreIKAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PreIKAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void PlevisAndFeetAdjustmentsLayer(struct FPoseLink InPosePelvisAndFeetAdjustments, struct FPoseLink& PlevisAndFeetAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PlevisAndFeetAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void PushCannonAdjustmentsLayer(struct FPoseLink InPosePushCannonAdjustments, struct FPoseLink& PushCannonAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.PushCannonAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ParaGliderAdjustmentsLayer(struct FPoseLink InPoseParaGliderAdjustments, struct FPoseLink& ParaGliderAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ParaGliderAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void HoverboardAdjustmentsLayer(struct FPoseLink InPoseHoverboardAdjustments, struct FPoseLink& HoverboardAdjustmentsLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.HoverboardAdjustmentsLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void HandIKFixUpLayer(struct FPoseLink InPoseHandIk, struct FPoseLink& HandIKFixUpLayer); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.HandIKFixUpLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void AnimGraph(struct FPoseLink InPosePostTurnInPlace, struct FPoseLink& AnimGraph); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_Player_ProceduralAdjustments_AnimBP(int32_t EntryPoint); // Function Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.ExecuteUbergraph_Player_ProceduralAdjustments_AnimBP // (Final|UbergraphFunction) // @ game+0xda071c
};

