// AnimBlueprintGeneratedClass RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C
// Size: 0x2391 (Inherited: 0x880)
struct URidingPlayerLayerAnimBP_C : UFortValetPassengerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x880(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x888(0x1c)
	char pad_8A4[0x4]; // 0x8a4(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x8a8(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x8b0(0x08)
	struct FAnimNode_Root ; // 0x8b8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x8d8(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x998(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xa58(0x100)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xb58(0xe0)
	struct FAnimNode_UseCachedPose ; // 0xc38(0x28)
	struct FAnimNode_ModifyBone ; // 0xc60(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd88(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xda8(0x20)
	struct FAnimNode_SaveCachedPose ; // 0xdc8(0x100)
	struct FAnimNode_UseCachedPose ; // 0xec8(0x28)
	struct FAnimNode_BlendListByBool ; // 0xef0(0x48)
	struct FAnimNode_UseCachedPose ; // 0xf38(0x28)
	struct FAnimNode_RotateRootBone ; // 0xf60(0xa8)
	struct FAnimNode_Slot ; // 0x1008(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1050(0x40)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x1090(0x110)
	struct FAnimNode_BlendSpacePlayer ; // 0x11a0(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1208(0xc8)
	struct FAnimNode_ModifyBone ; // 0x12d0(0x128)
	struct FAnimNode_LinkedInputPose ; // 0x13f8(0xc0)
	struct FAnimNode_Root ; // 0x14b8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x14d8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x1520(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1568(0x40)
	struct FAnimNode_BlendListByBool ; // 0x15a8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x15f0(0x100)
	struct FAnimNode_UseCachedPose ; // 0x16f0(0x28)
	struct FAnimNode_UseCachedPose ; // 0x1718(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1740(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1788(0x68)
	struct FAnimNode_BlendListByBool ; // 0x17f0(0x48)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1838(0xa8)
	struct FAnimNode_SequencePlayer ; // 0x18e0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1920(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1968(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1990(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x19d8(0x40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1a18(0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1a60(0x110)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1b70(0x28)
	struct FAnimNode_ModifyBone ; // 0x1b98(0x128)
	struct FAnimNode_ModifyBone ; // 0x1cc0(0x128)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1de8(0x128)
	struct FAnimNode_Root ; // 0x1f10(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1f30(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1ff0(0xc0)
	struct FAnimNode_Root ; // 0x20b0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x20d0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x2190(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2250(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2310(0x20)
	struct FRotator MatchRootYaw; // 0x2330(0x18)
	bool Is Targeting; // 0x2348(0x01)
	char pad_2349[0x7]; // 0x2349(0x07)
	struct AFortPlayerPawn* FortPlayer; // 0x2350(0x08)
	double Timer; // 0x2358(0x08)
	bool ShouldTransitionToRiding; // 0x2360(0x01)
	char pad_2361[0x7]; // 0x2361(0x07)
	double LowerBodyYaw; // 0x2368(0x08)
	bool IsRideMode; // 0x2370(0x01)
	bool IsSprinting; // 0x2371(0x01)
	bool IsStandingStill; // 0x2372(0x01)
	bool IsInCombat; // 0x2373(0x01)
	char pad_2374[0x4]; // 0x2374(0x04)
	struct ANPC_Pawn_Wildlife_Parent_C* WildlifePawn; // 0x2378(0x08)
	bool IsSmackie; // 0x2380(0x01)
	char pad_2381[0x7]; // 0x2381(0x07)
	double Velocity; // 0x2388(0x08)
	bool IsNug; // 0x2390(0x01)

	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink InPoseUpperAndLowerCachePose, struct FPoseLink& VehicleFullBodyOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D1B22730415169A7290CBFAD6C915976(); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D1B22730415169A7290CBFAD6C915976 // (BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_RotateRootBone_D73766CE4BF0C956278D7FA8259A40CA(); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RidingPlayerLayerAnimBP_AnimGraphNode_RotateRootBone_D73766CE4BF0C956278D7FA8259A40CA // (BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_RidingPlayerLayerAnimBP(int32_t EntryPoint); // Function RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.ExecuteUbergraph_RidingPlayerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xda071c
};

