// AnimBlueprintGeneratedClass SlidingLayerAnimBP.SlidingLayerAnimBP_C
// Size: 0x1de0 (Inherited: 0x4c0)
struct USlidingLayerAnimBP_C : UFortSlidingLayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4c0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4c8(0x40)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x508(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x510(0x08)
	struct FAnimNode_LinkedInputPose ; // 0x518(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5d8(0xc0)
	struct FAnimNode_Root ; // 0x698(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x6b8(0xc0)
	struct FAnimNode_Root ; // 0x778(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x798(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x858(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x918(0xc0)
	struct FAnimNode_Root ; // 0x9d8(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x9f8(0xc0)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0xab8(0xd0)
	struct FAnimNode_Root ; // 0xb88(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0xba8(0x68)
	struct FAnimNode_BlendListByBool ; // 0xc10(0x48)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xc58(0x10)
	struct FAnimNode_BlendSpacePlayer ; // 0xc68(0x68)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0xcd0(0xd0)
	struct FAnimNode_Root ; // 0xda0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xdc0(0xc0)
	struct FAnimNode_RotateRootBone ; // 0xe80(0xa8)
	struct FAnimNode_TransitionResult ; // 0xf28(0x28)
	struct FAnimNode_TransitionResult ; // 0xf50(0x28)
	struct FAnimNode_TransitionResult ; // 0xf78(0x28)
	struct FAnimNode_TransitionResult ; // 0xfa0(0x28)
	struct FAnimNode_TransitionResult ; // 0xfc8(0x28)
	struct FAnimNode_TransitionResult ; // 0xff0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1018(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1040(0x28)
	struct FAnimNode_BlendListByBool ; // 0x1068(0x48)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x10b0(0xd0)
	struct FAnimNode_SequencePlayer ; // 0x1180(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x11c0(0x68)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x1228(0xd0)
	struct FAnimNode_BlendSpacePlayer ; // 0x12f8(0x68)
	struct FAnimNode_SequencePlayer ; // 0x1360(0x40)
	struct FAnimNode_StateResult ; // 0x13a0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x13c0(0x68)
	struct FAnimNode_StateResult ; // 0x1428(0x20)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x1448(0xd0)
	struct FAnimNode_SequencePlayer ; // 0x1518(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x1558(0x68)
	struct FAnimNode_StateResult ; // 0x15c0(0x20)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x15e0(0xd0)
	struct FAnimNode_SequencePlayer ; // 0x16b0(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x16f0(0x68)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1758(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1778(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1840(0x100)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1940(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1988(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x19b0(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x19d8(0xa8)
	struct FAnimNode_LinkedInputPose ; // 0x1a80(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1b40(0xc0)
	struct FAnimNode_Root ; // 0x1c00(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1c20(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1ce0(0x40)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1d20(0x20)
	bool IsKneeSliding; // 0x1d40(0x01)
	bool b_KneeSlideNote_bTransition_FullBody_Sprinting; // 0x1d41(0x01)
	char pad_1D42[0x6]; // 0x1d42(0x06)
	struct FRotator ; // 0x1d48(0x18)
	struct FRotator ; // 0x1d60(0x18)
	struct AFortPlayerPawn* ; // 0x1d78(0x08)
	struct UFortPlayerAnimInstance* Fort Player Anim Instance; // 0x1d80(0x08)
	double Delta Time ; // 0x1d88(0x08)
	double KneeSlideLowerBodyYawOffset; // 0x1d90(0x08)
	double ; // 0x1d98(0x08)
	double ; // 0x1da0(0x08)
	double ; // 0x1da8(0x08)
	double ; // 0x1db0(0x08)
	double ; // 0x1db8(0x08)
	bool TransitionToKneeSlide; // 0x1dc0(0x01)
	char pad_1DC1[0x7]; // 0x1dc1(0x07)
	double ; // 0x1dc8(0x08)
	bool InitiatedSlideUpHill; // 0x1dd0(0x01)
	bool ; // 0x1dd1(0x01)
	char pad_1DD2[0x6]; // 0x1dd2(0x06)
	double ; // 0x1dd8(0x08)

	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_FullBodyOverride(struct FPoseLink InputPoseFullBody, struct FPoseLink InLocomotionPosePreAdditives, struct FPoseLink InLocomotionAdditives, struct FPoseLink& MovementMode_FullBodyOverride); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_SourcePose(struct FPoseLink InSourcePoseBase, struct FPoseLink& MovementMode_SourcePose); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_SourcePose // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_LowerBodyOverride(struct FPoseLink InLowerBodyPose, struct FPoseLink InSourcePose, struct FPoseLink InSourcePosePreUpperBodySlot, struct FPoseLink& MovementMode_LowerBodyOverride); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_LowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_LocomotionAdditives(struct FPoseLink InLocomotionAdditivesPose, struct FPoseLink& MovementMode_LocomotionAdditives); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.MovementMode_LocomotionAdditives // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void BlueprintInitializeAnimation(); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SlidingLayerAnimBP_AnimGraphNode_ApplyMeshSpaceAdditive_CA45D1154A0385BF8F15FBB40CA66AD6(); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SlidingLayerAnimBP_AnimGraphNode_ApplyMeshSpaceAdditive_CA45D1154A0385BF8F15FBB40CA66AD6 // (BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_SlidingLayerAnimBP(int32_t EntryPoint); // Function SlidingLayerAnimBP.SlidingLayerAnimBP_C.ExecuteUbergraph_SlidingLayerAnimBP // (Final|UbergraphFunction) // @ game+0xda071c
};

