// AnimBlueprintGeneratedClass SwimmingAnimBP.SwimmingAnimBP_C
// Size: 0x5cd8 (Inherited: 0x9a0)
struct USwimmingAnimBP_C : UFortSwimmingLayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x9a0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x9a8(0x108)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xab0(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xab8(0x08)
	struct FAnimNode_Root ; // 0xac0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xae0(0xc0)
	struct FAnimNode_BlendListByBool ; // 0xba0(0x48)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0xbe8(0x110)
	struct FAnimNode_BlendListByEnum ; // 0xcf8(0x48)
	struct FAnimNode_LinkedInputPose ; // 0xd40(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0xe00(0x100)
	struct FAnimNode_UseCachedPose ; // 0xf00(0x28)
	struct FAnimNode_UseCachedPose ; // 0xf28(0x28)
	struct FAnimNode_Root ; // 0xf50(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xf70(0xc0)
	struct FAnimNode_RotateRootBone ; // 0x1030(0xa8)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x10d8(0x110)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x11e8(0x110)
	struct FAnimNode_TransitionResult ; // 0x12f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1320(0x28)
	struct FAnimNode_TransitionResult ; // 0x1348(0x28)
	struct FAnimNode_TransitionResult ; // 0x1370(0x28)
	struct FAnimNode_TransitionResult ; // 0x1398(0x28)
	struct FAnimNode_SequencePlayer ; // 0x13c0(0x40)
	struct FAnimNode_StateResult ; // 0x1400(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1420(0x40)
	struct FAnimNode_StateResult ; // 0x1460(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1480(0x40)
	struct FAnimNode_StateResult ; // 0x14c0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x14e0(0x40)
	struct FAnimNode_StateResult ; // 0x1520(0x20)
	struct FAnimNode_StateMachine ; // 0x1540(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x1608(0x100)
	struct FAnimNode_BlendListByBool ; // 0x1708(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1750(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x1778(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x1858(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1880(0x40)
	struct FAnimNode_TwoWayBlend ; // 0x18c0(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x1980(0x100)
	struct FAnimNode_UseCachedPose ; // 0x1a80(0x28)
	struct FAnimNode_BlendListByEnum ; // 0x1aa8(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1af0(0x28)
	struct FAnimNode_ApplyAdditive ; // 0x1b18(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x1be0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1c20(0x48)
	struct FAnimNode_UseCachedPose ; // 0x1c68(0x28)
	struct FAnimNode_Root ; // 0x1c90(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1cb0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1d70(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x1e30(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x1ef0(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x1ff0(0x100)
	struct FAnimNode_TransitionResult ; // 0x20f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2118(0x28)
	struct FAnimNode_TransitionResult ; // 0x2140(0x28)
	struct FAnimNode_TransitionResult ; // 0x2168(0x28)
	struct FAnimNode_TransitionResult ; // 0x2190(0x28)
	struct FAnimNode_TransitionResult ; // 0x21b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x21e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2208(0x28)
	struct FAnimNode_TransitionResult ; // 0x2230(0x28)
	struct FAnimNode_TransitionResult ; // 0x2258(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2280(0x40)
	struct FAnimNode_StateResult ; // 0x22c0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x22e0(0x68)
	struct FAnimNode_StateResult ; // 0x2348(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2368(0x40)
	struct FAnimNode_StateResult ; // 0x23a8(0x20)
	struct FAnimNode_UseCachedPose ; // 0x23c8(0x28)
	struct FAnimNode_BlendListByBool ; // 0x23f0(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2438(0x40)
	struct FAnimNode_SequencePlayer ; // 0x2478(0x40)
	struct FAnimNode_BlendListByBool ; // 0x24b8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x2500(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2548(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2588(0x48)
	struct FAnimNode_SequencePlayer ; // 0x25d0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x2610(0x48)
	struct FAnimNode_SequencePlayer ; // 0x2658(0x40)
	struct FAnimNode_StateResult ; // 0x2698(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x26b8(0x68)
	struct FAnimNode_StateResult ; // 0x2720(0x20)
	struct FAnimNode_StateMachine ; // 0x2740(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x2808(0x48)
	struct FAnimNode_LayeredBoneBlend ; // 0x2850(0xe0)
	struct FAnimNode_RefPose ; // 0x2930(0x10)
	struct FAnimNode_UseCachedPose ; // 0x2940(0x28)
	struct FAnimNode_LayeredBoneBlend ; // 0x2968(0xe0)
	struct FAnimNode_RefPose ; // 0x2a48(0x10)
	struct FAnimNode_LayeredBoneBlend ; // 0x2a58(0xe0)
	struct FAnimNode_RefPose ; // 0x2b38(0x10)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2b48(0xc8)
	struct FAnimNode_UseCachedPose ; // 0x2c10(0x28)
	struct FAnimNode_TransitionResult ; // 0x2c38(0x28)
	struct FAnimNode_TransitionResult ; // 0x2c60(0x28)
	struct FAnimNode_TransitionResult ; // 0x2c88(0x28)
	struct FAnimNode_TransitionResult ; // 0x2cb0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2cd8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d00(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d28(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d50(0x28)
	struct FAnimNode_TransitionResult ; // 0x2d78(0x28)
	struct FAnimNode_TransitionResult ; // 0x2da0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2dc8(0x28)
	struct FAnimNode_TransitionResult ; // 0x2df0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2e18(0x28)
	struct FAnimNode_TransitionResult ; // 0x2e40(0x28)
	struct FAnimNode_TransitionResult ; // 0x2e68(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x2e90(0x20)
	struct FAnimNode_ModifyBone ; // 0x2eb0(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x2fd8(0x20)
	struct FAnimNode_TransitionResult ; // 0x2ff8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3020(0x28)
	struct FAnimNode_TransitionResult ; // 0x3048(0x28)
	struct FAnimNode_TransitionResult ; // 0x3070(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3098(0x40)
	struct FAnimNode_BlendListByBool ; // 0x30d8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3120(0x40)
	struct FAnimNode_StateResult ; // 0x3160(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3180(0x68)
	struct FAnimNode_StateResult ; // 0x31e8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3208(0x40)
	struct FAnimNode_StateResult ; // 0x3248(0x20)
	struct FAnimNode_StateMachine ; // 0x3268(0xc8)
	struct FAnimNode_StateResult ; // 0x3330(0x20)
	struct FAnimNode_TransitionResult ; // 0x3350(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3378(0x40)
	struct FAnimNode_StateResult ; // 0x33b8(0x20)
	struct FAnimNode_UseCachedPose ; // 0x33d8(0x28)
	struct FAnimNode_StateResult ; // 0x3400(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3420(0x28)
	struct FAnimNode_StateResult ; // 0x3448(0x20)
	struct FAnimNode_StateMachine ; // 0x3468(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x3530(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x3630(0x100)
	struct FAnimNode_TwoWayBlend ; // 0x3730(0xc0)
	struct FAnimNode_TransitionResult ; // 0x37f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3818(0x28)
	struct FAnimNode_TransitionResult ; // 0x3840(0x28)
	struct FAnimNode_TransitionResult ; // 0x3868(0x28)
	struct FAnimNode_BlendSpacePlayer ; // 0x3890(0x68)
	struct FAnimNode_StateResult ; // 0x38f8(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3918(0x68)
	struct FAnimNode_BlendListByEnum ; // 0x3980(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x39c8(0x68)
	struct FAnimNode_StateResult ; // 0x3a30(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x3a50(0x68)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3ab8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x3b00(0x68)
	struct FAnimNode_StateResult ; // 0x3b68(0x20)
	struct FAnimNode_StateMachine ; // 0x3b88(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3c50(0xa8)
	struct FAnimNode_TwoWayBlend ; // 0x3cf8(0xc0)
	struct FAnimNode_BlendListByBool ; // 0x3db8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x3e00(0x68)
	struct FAnimNode_BlendSpacePlayer ; // 0x3e68(0x68)
	struct FAnimNode_StateResult ; // 0x3ed0(0x20)
	struct FAnimNode_StateMachine ; // 0x3ef0(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x3fb8(0x100)
	struct FAnimNode_UseCachedPose ; // 0x40b8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x40e0(0xe0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x41c0(0x10)
	struct FAnimNode_Root ; // 0x41d0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x41f0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x42b0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x4370(0xc0)
	struct FAnimNode_TransitionResult ; // 0x4430(0x28)
	struct FAnimNode_TransitionResult ; // 0x4458(0x28)
	struct FAnimNode_TransitionResult ; // 0x4480(0x28)
	struct FAnimNode_TransitionResult ; // 0x44a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x44d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x44f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x4520(0x28)
	struct FAnimNode_TransitionResult ; // 0x4548(0x28)
	struct FAnimNode_TransitionResult ; // 0x4570(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4598(0x28)
	struct FAnimNode_SequencePlayer ; // 0x45c0(0x40)
	struct FAnimNode_StateResult ; // 0x4600(0x20)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x4620(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4730(0x20)
	struct FAnimNode_ModifyBone ; // 0x4750(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4878(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x4898(0x68)
	struct FAnimNode_StateResult ; // 0x4900(0x20)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x4920(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4a30(0x20)
	struct FAnimNode_ModifyBone ; // 0x4a50(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4b78(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x4b98(0x68)
	struct FAnimNode_StateResult ; // 0x4c00(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4c20(0x40)
	struct FAnimNode_StateResult ; // 0x4c60(0x20)
	struct FAnimNode_ModifyBone ; // 0x4c80(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x4da8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x4dc8(0x20)
	struct FAnimNode_ModifyBone ; // 0x4de8(0x128)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4f10(0x100)
	struct FAnimNode_UseCachedPose ; // 0x5010(0x28)
	struct FAnimNode_TwoWayBlend ; // 0x5038(0xc0)
	struct FAnimNode_UseCachedPose ; // 0x50f8(0x28)
	struct FAnimNode_BlendListByBool ; // 0x5120(0x48)
	struct FAnimNode_UseCachedPose ; // 0x5168(0x28)
	struct FAnimNode_BlendListByBool ; // 0x5190(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x51d8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x51f8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5218(0x128)
	struct FAnimNode_UseCachedPose ; // 0x5340(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5368(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5388(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x5450(0x100)
	struct FAnimNode_SaveCachedPose ; // 0x5550(0x100)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5650(0x68)
	struct FAnimNode_BlendListByBool ; // 0x56b8(0x48)
	struct FAnimNode_TwoWayBlend ; // 0x5700(0xc0)
	struct FAnimNode_Root ; // 0x57c0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x57e0(0xc0)
	struct FAnimNode_Root ; // 0x58a0(0x20)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x58c0(0xc0)
	struct FAnimNode_SequenceEvaluator ; // 0x5980(0x40)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x59c0(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x5a80(0x40)
	struct FAnimNode_BlendListByBool ; // 0x5ac0(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5b08(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5b50(0x100)
	struct FAnimNode_UseCachedPose ; // 0x5c50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5c78(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5ca0(0x20)
	bool AllowSprintStop; // 0x5cc0(0x01)
	bool ChangeMovementToVelocityFromAccel; // 0x5cc1(0x01)
	char pad_5CC2[0x6]; // 0x5cc2(0x06)
	double LocalAccelYawAngleAtStart; // 0x5cc8(0x08)
	double PivotAngle; // 0x5cd0(0x08)

	void MovementMode_AimOffset(struct FPoseLink InAimOffsetsPose, struct FPoseLink InSourcePosePreAimOffsets, struct FPoseLink& MovementMode_AimOffset); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_AimOffset // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_FinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& MovementMode_FinalPoseOverride); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_FinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_FullBodyOverride(struct FPoseLink InputPoseFullBody, struct FPoseLink InLocomotionPosePreAdditives, struct FPoseLink InLocomotionAdditives, struct FPoseLink& MovementMode_FullBodyOverride); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_FullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_LowerBodyOverride(struct FPoseLink InLowerBodyPose, struct FPoseLink InSourcePose, struct FPoseLink InSourcePosePreUpperBodySlot, struct FPoseLink& MovementMode_LowerBodyOverride); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_LowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_LocomotionAdditives(struct FPoseLink InLocomotionAdditivesPose, struct FPoseLink& MovementMode_LocomotionAdditives); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_LocomotionAdditives // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void MovementMode_SourcePose(struct FPoseLink InSourcePoseBase, struct FPoseLink& MovementMode_SourcePose); // Function SwimmingAnimBP.SwimmingAnimBP_C.MovementMode_SourcePose // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void On Dive Jump Ground Land Update(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node); // Function SwimmingAnimBP.SwimmingAnimBP_C.On Dive Jump Ground Land Update // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_A2BC0C1C4C08F505008D78822E2CDA35(); // Function SwimmingAnimBP.SwimmingAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_A2BC0C1C4C08F505008D78822E2CDA35 // (BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_9F9F2B2044ED07971A24218CE59E276D(); // Function SwimmingAnimBP.SwimmingAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_9F9F2B2044ED07971A24218CE59E276D // (BlueprintEvent) // @ game+0xda071c
	void AnimNotify_SwimSprintStart_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintStart_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void AnimNotify_SwimSprintStart_Exited_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintStart_Exited_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void AnimNotify_SwimSprint_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprint_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void AnimNotify_SwimSprintSlow_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintSlow_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void AnimNotify_SwimStartAdditive_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimStartAdditive_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void AnimNotify_SwimMovementAccelAdditive_Exited_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimMovementAccelAdditive_Exited_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_SwimmingAnimBP(int32_t EntryPoint); // Function SwimmingAnimBP.SwimmingAnimBP_C.ExecuteUbergraph_SwimmingAnimBP // (Final|UbergraphFunction) // @ game+0xda071c
};

