// VerseClass VerseNPC.$SolarisSignatureFunctionOuter
// Size: 0x28 (Inherited: 0x28)
struct U$SolarisSignatureFunctionOuter : UObject {
};

// VerseClass VerseNPC.companion_ai
// Size: 0x368 (Inherited: 0x1c0)
struct Ucompanion_ai : Uscript_component {
	OptionProperty __verse_0xC81F8A41_NPCComponent; // 0x1c0(0x08)
	OptionProperty __verse_0x7F57F536_PositionComponent; // 0x1c8(0x08)
	char __verse_0x4222121E_DebugDisplay : 1; // 0x1d0(0x01)
	char pad_1D0_1 : 7; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	double __verse_0x2CDB4F82_LeashDistance; // 0x1d8(0x08)
	double __verse_0x115C86C1_AttackTargetDistance; // 0x1e0(0x08)
	double __verse_0xCE8DFDAA_TacticalSprintThreshold; // 0x1e8(0x08)
	double __verse_0x9F079D21_MovevementThreshold; // 0x1f0(0x08)
	double __verse_0x8D041DAB_HoldPositionLeashDistance; // 0x1f8(0x08)
	struct FDelegate __verse_0xB62610E6_CrouchService_L_Nnpc__component_R; // 0x200(0x0c)
	struct FDelegate __verse_0x0C28E1CA_DispatchGoTo_L_Nnpc__component_M_Nping__info_R; // 0x20c(0x0c)
	struct FDelegate __verse_0x4611DC7E_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R; // 0x218(0x0c)
	struct FDelegate __verse_0x9C681E4E_GameLoop_L_Nnpc__component_R; // 0x224(0x0c)
	struct FDelegate __verse_0x673DA7EC_GetNewObstacle_L_Nnpc__component_R; // 0x230(0x0c)
	struct FDelegate __verse_0x9A0B3813_GetNewTargetPerception_L_Nnpc__component_M_N_Qthreat__info_R; // 0x23c(0x0c)
	struct FDelegate __verse_0xECA6CE6C_GetNewThreat_L_Nnpc__component_R; // 0x248(0x0c)
	struct FDelegate __verse_0x7E340938_GetObstacle_L_Nnpc__component_R; // 0x254(0x0c)
	struct FDelegate __verse_0x1967E673_GetThreat_L_Nnpc__component_R; // 0x260(0x0c)
	struct FDelegate __verse_0xF49FB7E9_GoToAndAttackTask_L_Nnpc__component_M_Nthreat__info_R; // 0x26c(0x0c)
	struct FDelegate __verse_0x59693279_GoToPositionTask_L_Nnpc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R; // 0x278(0x0c)
	struct FDelegate __verse_0xBFD98BA6_HandleBackToMeCommand_L_Nnpc__component_M_Nping__info_R; // 0x284(0x0c)
	struct FDelegate __verse_0x62619CCA_HandleGoTo_L_Nnpc__component_M_Nping__info_R; // 0x290(0x0c)
	struct FDelegate __verse_0xBCE8C154_HandleGoToCommand_L_Nnpc__component_M_Nping__info_R; // 0x29c(0x0c)
	struct FDelegate __verse_0x962597AC_HandleHoldPositionCommand_L_Nnpc__component_M_Nping__info_R; // 0x2a8(0x0c)
	struct FDelegate __verse_0x8B472A92_HandleNPCCommand_L_Nnpc__component_M_Nping__info_R; // 0x2b4(0x0c)
	struct FDelegate __verse_0x5501F66A_HandleObstacleTask_L_Nnpc__component_M_N_Qentity_R; // 0x2c0(0x0c)
	struct FDelegate __verse_0xD9ADC2CC_HandleReviveCommand_L_Nnpc__component_M_Nping__info_R; // 0x2cc(0x0c)
	struct FDelegate __verse_0x34EB7DA3_HandleTarget_L_Nnpc__component_R; // 0x2d8(0x0c)
	struct FDelegate __verse_0xBB87EB06_HoldPositionCommand_L_Nnpc__component_M_Nvector3_R; // 0x2e4(0x0c)
	struct FDelegate __verse_0x1B2E6740__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x2f0(0x0c)
	struct FDelegate __verse_0x2C3043C9_LookAroundTask_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nfloat_R; // 0x2fc(0x0c)
	struct FDelegate __verse_0xFA5CDEC0_LookAtThreatTask_L_Nnpc__component_R; // 0x308(0x0c)
	struct FDelegate __verse_0x8F4D8990_OnDamagedBy_L_Nnpc__component_R; // 0x314(0x0c)
	struct FDelegate __verse_0x8B544B14_ReviveCommand_L_Nnpc__component_M_Nentity_R; // 0x320(0x0c)
	struct FDelegate __verse_0x9473EEBD_SetLeashPosition_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nentity_R; // 0x32c(0x0c)
	struct FDelegate __verse_0x86899FFA_ShootTargetService_L_Nnpc__component_M_Nfloat_R; // 0x338(0x0c)
	struct FDelegate __verse_0x409D3E93_SprintService_L_Nnpc__component_R; // 0x344(0x0c)
	struct FDelegate __verse_0x894A09F2_TacticalSprintService_L_Nnpc__component_R; // 0x350(0x0c)
	struct FDelegate __verse_0xD52E5C4D_WaitForEntityMovement_L_Nentity_M_Nfloat_R; // 0x35c(0x0c)

	struct Utask(:type)* WaitForEntityMovement_L_Nentity_M_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lentity_Mfloat_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.WaitForEntityMovement_L_Nentity_M_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* TacticalSprintService_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.TacticalSprintService_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* SprintService_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.SprintService_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* ShootTargetService_L_Nnpc__component_M_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mfloat_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.ShootTargetService_L_Nnpc__component_M_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* SetLeashPosition_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mentity_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.SetLeashPosition_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* ReviveCommand_L_Nnpc__component_M_Nentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mentity_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.ReviveCommand_L_Nnpc__component_M_Nentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnDamagedBy_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.OnDamagedBy_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* LookAtThreatTask_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.LookAtThreatTask_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* LookAroundTask_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.LookAroundTask_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fcompanion__ai_N_RLogAndDisplayOnScreen_L_N_Kchar_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HoldPositionCommand_L_Nnpc__component_M_Nvector3_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mvector3_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HoldPositionCommand_L_Nnpc__component_M_Nvector3_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleTarget_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleTarget_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleReviveCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleReviveCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleObstacleTask_L_Nnpc__component_M_N_Qentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_M_Qentity_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleObstacleTask_L_Nnpc__component_M_N_Qentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleNPCCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleNPCCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleHoldPositionCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleHoldPositionCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleGoToCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleGoToCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleGoTo_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleGoTo_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleBackToMeCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.HandleBackToMeCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GoToPositionTask_L_Nnpc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GoToPositionTask_L_Nnpc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GoToAndAttackTask_L_Nnpc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GoToAndAttackTask_L_Nnpc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GetThreat_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GetThreat_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GetObstacle_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GetObstacle_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GetNewThreat_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GetNewThreat_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GetNewTargetPerception_L_Nnpc__component_M_N_Qthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_M_Qthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GetNewTargetPerception_L_Nnpc__component_M_N_Qthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GetNewObstacle_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GetNewObstacle_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GameLoop_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.GameLoop_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lvector3_Mfloat_Mcolor_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* DispatchGoTo_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.DispatchGoTo_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* CrouchService_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.companion_ai.CrouchService_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void $InitInstance(); // Function VerseNPC.companion_ai.$InitInstance // (None) // @ game+0xda071c
	void $InitCDO(); // Function VerseNPC.companion_ai.$InitCDO // (None) // @ game+0xda071c
};

// VerseClass VerseNPC.log_companion_ai
// Size: 0x28 (Inherited: 0x28)
struct Ulog_companion_ai : Ulog_channel {

	void $InitInstance(); // Function VerseNPC.log_companion_ai.$InitInstance // (None) // @ game+0xda071c
	void $InitCDO(); // Function VerseNPC.log_companion_ai.$InitCDO // (None) // @ game+0xda071c
};

// VerseClass VerseNPC.log_script_npc_test
// Size: 0x28 (Inherited: 0x28)
struct Ulog_script_npc_test : Ulog_channel {

	void $InitInstance(); // Function VerseNPC.log_script_npc_test.$InitInstance // (None) // @ game+0xda071c
	void $InitCDO(); // Function VerseNPC.log_script_npc_test.$InitCDO // (None) // @ game+0xda071c
};

// VerseClass VerseNPC.npc_component
// Size: 0x2c0 (Inherited: 0xf8)
struct Unpc_component : Uai_component {
	char pad_F8[0x114]; // 0xf8(0x114)
	struct FDelegate __verse_0xB58CDDB5__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RAreNPCCommandsEnabled; // 0x20c(0x0c)
	struct FDelegate __verse_0xFA530C05_AttackThreat_L_Nthreat__info_R; // 0x134(0x0c)
	struct FDelegate __verse_0xE4D0BB73_Crouch; // 0x164(0x0c)
	struct FDelegate __verse_0x17596BCA__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RDeclineNPCCommand_L_Nlogic_R; // 0x230(0x0c)
	struct FDelegate __verse_0x8EDC0B57_DestroyObstacle_L_Nentity_R; // 0x14c(0x0c)
	char pad_248[0x24]; // 0x248(0x24)
	struct FDelegate __verse_0x70DC8CC3__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RForgetThreat_L_Nthreat__info_R; // 0x26c(0x0c)
	struct FDelegate __verse_0xA17B1F52__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetAllThreatInfo; // 0x248(0x0c)
	struct FDelegate __verse_0x19C45520__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetBestObjectToLoot; // 0x1b8(0x0c)
	struct FDelegate __verse_0xF02C5EAE__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentDestination; // 0x128(0x0c)
	struct FDelegate __verse_0xC0E2912A__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentNPCCommand; // 0x218(0x0c)
	struct FDelegate __verse_0xFA54E983__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentThreatInfo; // 0x23c(0x0c)
	struct FDelegate __verse_0xD58FC25E__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetObstacleInfo; // 0x284(0x0c)
	struct FDelegate __verse_0xE3DDE74D__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetOrCreateThreatInfo_L_Nentity_M_Nlogic_R; // 0x260(0x0c)
	struct FDelegate __verse_0x74912F24__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetThreatInfo_L_Nentity_R; // 0x254(0x0c)
	struct FDelegate __verse_0x91E44EAA_Jump; // 0x194(0x0c)
	struct FDelegate __verse_0xC907A4E0_LookAt_L_Nvector3_R; // 0x1ac(0x0c)
	struct FDelegate __verse_0x1B994B4F_LootObject_L_Nloot__info_R; // 0x1d0(0x0c)
	struct FDelegate __verse_0x514829C1_MoveInRangeToAttack; // 0x140(0x0c)
	struct FDelegate __verse_0x167392A9_NavigateTo_L_Nvector3_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R; // 0x104(0x0c)
	struct FDelegate __verse_0xBBE4DD00_NavigateTo_L_Nentity_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R; // 0x110(0x0c)
	struct FDelegate __verse_0xDA317101_OnBestObjectToLoot; // 0x1c4(0x0c)
	struct FDelegate __verse_0x13EC72B3_OnBestThreatChanged; // 0x278(0x0c)
	struct FDelegate __verse_0x0B93B3DC_OnDamaged; // 0x2a8(0x0c)
	struct FDelegate __verse_0x68114BBA_OnNPCCommand; // 0x224(0x0c)
	struct FDelegate __verse_0xA19AC819_OnObstacleChanged; // 0x290(0x0c)
	struct FDelegate __verse_0x2C144C89_OnThreatPerceptionChanged_L_Nthreat__info_R; // 0x29c(0x0c)
	struct FDelegate __verse_0xB5C0D619_PatrolAround_L_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R; // 0x11c(0x0c)
	struct FDelegate __verse_0x10F2389B_PlayEmote; // 0x158(0x0c)
	struct FDelegate __verse_0xFB3503F2__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RResetLeash; // 0x200(0x0c)
	struct FDelegate __verse_0x7681370A_Revive_L_Nentity_R; // 0x1dc(0x0c)
	struct FDelegate __verse_0xECDDAB04_RunDefaultBehavior; // 0xf8(0x0c)
	struct FDelegate __verse_0xBCEA98C2__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RSetLeashActor_L_Nentity_R; // 0x1f4(0x0c)
	struct FDelegate __verse_0xEF843846__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RSetLeashPosition_L_Nvector3_M_Nfloat_R; // 0x1e8(0x0c)
	struct FDelegate __verse_0xD27C8306_Slide; // 0x1a0(0x0c)
	struct FDelegate __verse_0x19F8ABA1_Sprint; // 0x17c(0x0c)
	struct FDelegate __verse_0xCB7DDA42_TacticalSprint; // 0x188(0x0c)
	struct FDelegate __verse_0xD59E8F01_Walk; // 0x170(0x0c)

	struct Utask(:type)* Walk(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.Walk // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* TacticalSprint(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.TacticalSprint // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* Sprint(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.Sprint // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* Slide(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.Slide // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RSetLeashPosition_L_Nvector3_M_Nfloat_R(struct Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RSetLeashPosition_L_Nvector3_M_Nfloat_R // (Native|Public|BlueprintCallable) // @ game+0x6beb228
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RSetLeashActor_L_Nentity_R(struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RSetLeashActor_L_Nentity_R // (Native|Public|BlueprintCallable) // @ game+0x6beb220
	struct Utask(:type)* RunDefaultBehavior(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.RunDefaultBehavior // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* Revive_L_Nentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.Revive_L_Nentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RResetLeash(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RResetLeash // (Native|Public|BlueprintCallable) // @ game+0x6beb218
	struct Utask(:type)* PlayEmote(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.PlayEmote // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* PatrolAround_L_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, OptionProperty __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.PatrolAround_L_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnThreatPerceptionChanged_L_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Fthreat_info __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.OnThreatPerceptionChanged_L_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnObstacleChanged(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.OnObstacleChanged // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnNPCCommand(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.OnNPCCommand // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnDamaged(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.OnDamaged // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnBestThreatChanged(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.OnBestThreatChanged // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnBestObjectToLoot(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.OnBestObjectToLoot // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* NavigateTo_L_Nentity_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lentity_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.NavigateTo_L_Nentity_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* NavigateTo_L_Nvector3_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.NavigateTo_L_Nvector3_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* MoveInRangeToAttack(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.MoveInRangeToAttack // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* LootObject_L_Nloot__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Floot_info __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.LootObject_L_Nloot__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* LookAt_L_Nvector3_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Fvector3 __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.LookAt_L_Nvector3_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* Jump(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.Jump // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetThreatInfo_L_Nentity_R(struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetThreatInfo_L_Nentity_R // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb210
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetOrCreateThreatInfo_L_Nentity_M_Nlogic_R(struct Ftuple_Lentity_Mlogic_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetOrCreateThreatInfo_L_Nentity_M_Nlogic_R // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb208
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetObstacleInfo(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetObstacleInfo // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb200
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentThreatInfo(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentThreatInfo // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1f8
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentNPCCommand(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentNPCCommand // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1f0
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentDestination(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetCurrentDestination // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1e8
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetBestObjectToLoot(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetBestObjectToLoot // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1e0
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetAllThreatInfo(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RGetAllThreatInfo // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1d8
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RForgetThreat_L_Nthreat__info_R(struct Fthreat_info __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RForgetThreat_L_Nthreat__info_R // (Native|Public|BlueprintCallable) // @ game+0x6beb1d0
	struct Utask(:type)* DestroyObstacle_L_Nentity_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.DestroyObstacle_L_Nentity_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RDeclineNPCCommand_L_Nlogic_R(char __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RDeclineNPCCommand_L_Nlogic_R // (Native|Public|BlueprintCallable) // @ game+0x6beb1c8
	struct Utask(:type)* Crouch(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.Crouch // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* AttackThreat_L_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Fthreat_info __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component.AttackThreat_L_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	char _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RAreNPCCommandsEnabled(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.npc_component._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fnpc__component_N_RAreNPCCommandsEnabled // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1c0
	void $InitInstance(); // Function VerseNPC.npc_component.$InitInstance // (None) // @ game+0xda071c
	void $InitCDO(); // Function VerseNPC.npc_component.$InitCDO // (None) // @ game+0xda071c
};

// VerseClass VerseNPC.NPCTeam
// Size: 0x28 (Inherited: 0x28)
struct UNPCTeam : UObject {

	struct TArray<struct UEntity*> _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fNPCTeam_N_RGetTeamMembers_L_Nentity_R(struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.NPCTeam._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fNPCTeam_N_RGetTeamMembers_L_Nentity_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1b8
	struct TArray<struct UEntity*> _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fNPCTeam_N_RGetSquadMembers_L_Nentity_R(struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.NPCTeam._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fNPCTeam_N_RGetSquadMembers_L_Nentity_R // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x6beb1b0
	void $InitCDO(); // Function VerseNPC.NPCTeam.$InitCDO // (None) // @ game+0xda071c
};

// VerseClass VerseNPC.script_npc_test
// Size: 0x3c0 (Inherited: 0x1c0)
struct Uscript_npc_test : Uscript_component {
	OptionProperty __verse_0xDC1A5B5B_NPCComp; // 0x1c0(0x08)
	OptionProperty __verse_0x325D2C22_PositionComp; // 0x1c8(0x08)
	OptionProperty __verse_0xC0B9B3D4_TargetInfo; // 0x1d0(0x39)
	char pad_209[0x7]; // 0x209(0x07)
	OptionProperty __verse_0x10890051_LootInfo; // 0x210(0x29)
	char pad_239[0x7]; // 0x239(0x07)
	OptionProperty __verse_0x01443115_PingInfo; // 0x240(0x39)
	char pad_279[0x3]; // 0x279(0x03)
	struct FDelegate __verse_0xEAB5CDB3_AttackThreat_L_Nnpc__component_M_Nthreat__info_R; // 0x27c(0x0c)
	struct FDelegate __verse_0x1CFFE439_FriendlyFollow_L_Nfloat_R; // 0x288(0x0c)
	struct FDelegate __verse_0xAAC24BD9_GameLoop; // 0x294(0x0c)
	struct FDelegate __verse_0x4DA59C84__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RGetTargetPosition_L_Nentity_R; // 0x2a0(0x0c)
	struct FDelegate __verse_0xF9C9343F_HandleHideCommand_L_Nnpc__component_M_Nping__info_R; // 0x2ac(0x0c)
	struct FDelegate __verse_0xEBF40D0B_HandleLoot_L_Nnpc__component_M_Nloot__info_R; // 0x2b8(0x0c)
	struct FDelegate __verse_0x4CCAE851_HandlePingCommand_L_Nnpc__component_M_Nping__info_R; // 0x2c4(0x0c)
	struct FDelegate __verse_0x6E977733_HandleThreat_L_Nnpc__component_M_Nthreat__info_R; // 0x2d0(0x0c)
	struct FDelegate __verse_0x95CB6CD9_InvestigateThreat_L_Nnpc__component_M_Nthreat__info_R; // 0x2dc(0x0c)
	struct FDelegate __verse_0x3D01DD69__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogActionResult_L_N_Kchar_M_Naction__result_R; // 0x2e8(0x0c)
	struct FDelegate __verse_0xE98A5387__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x2f4(0x0c)
	struct FDelegate __verse_0x44C52672__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogNavigationResult_L_N_Kchar_M_Nnavigate__result_R; // 0x300(0x0c)
	struct FDelegate __verse_0x22AB2427__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPerceptionStatus_L_N_Kchar_M_Nthreat__status_R; // 0x30c(0x0c)
	struct FDelegate __verse_0xD9860044__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPerceptionStatus_L_N_Kchar_M_Nobstacle__status_R; // 0x318(0x0c)
	struct FDelegate __verse_0x10C6BBC5__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPingCommand_L_Nping__info_R; // 0x324(0x0c)
	struct FDelegate __verse_0x27B7F0EB__L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogTargetList_L_Nnpc__component_R; // 0x330(0x0c)
	struct FDelegate __verse_0xC65DE815_LookAtThreat_L_Nnpc__component_M_Nthreat__info_R; // 0x33c(0x0c)
	struct FDelegate __verse_0x21CCFB81_MonitorNewLoot_L_Nnpc__component_R; // 0x348(0x0c)
	struct FDelegate __verse_0xF4F02A7B_MonitorNewPingcommand_L_Nnpc__component_R; // 0x354(0x0c)
	struct FDelegate __verse_0x34F015F6_MonitorNewThreat_L_Nnpc__component_R; // 0x360(0x0c)
	struct FDelegate __verse_0x8F4D8990_OnDamagedBy_L_Nnpc__component_R; // 0x36c(0x0c)
	struct FDelegate __verse_0x2A5682F5_OnNewLoot_L_Nnpc__component_R; // 0x378(0x0c)
	struct FDelegate __verse_0xABDB5C2E_OnNewPingCommand_L_Nnpc__component_R; // 0x384(0x0c)
	struct FDelegate __verse_0x2DB0B590_OnNewTargetPerception_L_Nnpc__component_M_Nthreat__info_R; // 0x390(0x0c)
	struct FDelegate __verse_0x16DFB8C0_OnNewThreat_L_Nnpc__component_R; // 0x39c(0x0c)
	struct FDelegate __verse_0x0AB25FA2_PatrolOnSquare; // 0x3a8(0x0c)
	struct FDelegate __verse_0x8BD85598_WanderAround; // 0x3b4(0x0c)

	struct Utask(:type)* WanderAround(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.WanderAround // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* PatrolOnSquare(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.PatrolOnSquare // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnNewThreat_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.OnNewThreat_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnNewTargetPerception_L_Nnpc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.OnNewTargetPerception_L_Nnpc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnNewPingCommand_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.OnNewPingCommand_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnNewLoot_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.OnNewLoot_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* OnDamagedBy_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.OnDamagedBy_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin(struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fVerse_2eorg_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* MonitorNewThreat_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.MonitorNewThreat_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* MonitorNewPingcommand_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.MonitorNewPingcommand_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* MonitorNewLoot_L_Nnpc__component_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.MonitorNewLoot_L_Nnpc__component_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* LookAtThreat_L_Nnpc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.LookAtThreat_L_Nnpc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogTargetList_L_Nnpc__component_R(struct Unpc_component* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogTargetList_L_Nnpc__component_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPingCommand_L_Nping__info_R(struct Fping_info __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPingCommand_L_Nping__info_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPerceptionStatus_L_N_Kchar_M_Nobstacle__status_R(struct Ftuple_L_Kchar_Mobstacle__status_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPerceptionStatus_L_N_Kchar_M_Nobstacle__status_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPerceptionStatus_L_N_Kchar_M_Nthreat__status_R(struct Ftuple_L_Kchar_Mthreat__status_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogPerceptionStatus_L_N_Kchar_M_Nthreat__status_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogNavigationResult_L_N_Kchar_M_Nnavigate__result_R(struct Ftuple_L_Kchar_Mnavigate__result_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogNavigationResult_L_N_Kchar_M_Nnavigate__result_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogAndDisplayOnScreen_L_N_Kchar_R(VerseStringProperty __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogAndDisplayOnScreen_L_N_Kchar_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	void _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogActionResult_L_N_Kchar_M_Naction__result_R(struct Ftuple_L_Kchar_Maction__result_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RLogActionResult_L_N_Kchar_M_Naction__result_R // (Public|HasDefaults|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* InvestigateThreat_L_Nnpc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.InvestigateThreat_L_Nnpc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleThreat_L_Nnpc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.HandleThreat_L_Nnpc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandlePingCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.HandlePingCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleLoot_L_Nnpc__component_M_Nloot__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mloot__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.HandleLoot_L_Nnpc__component_M_Nloot__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* HandleHideCommand_L_Nnpc__component_M_Nping__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.HandleHideCommand_L_Nnpc__component_M_Nping__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	OptionProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RGetTargetPosition_L_Nentity_R(struct UEntity* __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test._L_2fFortnite_2ecom_2fAI_2fVerseNPC_2fscript__npc__test_N_RGetTargetPosition_L_Nentity_R // (Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* GameLoop(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_L_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.GameLoop // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* FriendlyFollow_L_Nfloat_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.FriendlyFollow_L_Nfloat_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	struct Utask(:type)* AttackThreat_L_Nnpc__component_M_Nthreat__info_R(struct Utask(:type)* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument); // Function VerseNPC.script_npc_test.AttackThreat_L_Nnpc__component_M_Nthreat__info_R // (Public|HasOutParms|BlueprintCallable) // @ game+0xda071c
	void $InitInstance(); // Function VerseNPC.script_npc_test.$InitInstance // (None) // @ game+0xda071c
	void $InitCDO(); // Function VerseNPC.script_npc_test.$InitCDO // (HasDefaults) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$CrouchService_L_Nnpc__component_R
// Size: 0x1b8 (Inherited: 0x120)
struct Utask_companion_ai$CrouchService_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Utask(:type)* ; // 0x150(0x08)
	struct FDelegate ; // 0x158(0x0c)
	char pad_164[0x4]; // 0x164(0x04)
	int64_t ; // 0x168(0x08)
	struct Unpc_component* ; // 0x170(0x08)
	struct FDelegate ; // 0x178(0x0c)
	struct Ftuple_L_R ; // 0x184(0x01)
	char pad_185[0x3]; // 0x185(0x03)
	struct FDelegate ; // 0x188(0x0c)
	enum class EVerseTrue ; // 0x194(0x01)
	char pad_195[0x3]; // 0x195(0x03)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	VerseStringProperty ; // 0x1a8(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$CrouchService_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$DispatchGoTo_L_Nnpc__component_M_Nping__info_R
// Size: 0x508 (Inherited: 0x120)
struct Utask_companion_ai$DispatchGoTo_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct Utask(:type)* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x1a0(0x40)
	int64_t ; // 0x1e0(0x08)
	OptionProperty ; // 0x1e8(0x39)
	char pad_221[0x3]; // 0x221(0x03)
	struct FDelegate ; // 0x224(0x0c)
	int64_t ; // 0x230(0x08)
	OptionProperty ; // 0x238(0x39)
	char pad_271[0x7]; // 0x271(0x07)
	struct Utask(:type)* ; // 0x278(0x08)
	struct FDelegate ; // 0x280(0x0c)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct Ftuple_Lnpc__component_M_Qthreat__info_R ; // 0x290(0x48)
	int64_t ; // 0x2d8(0x08)
	OptionProperty ; // 0x2e0(0x39)
	char pad_319[0x7]; // 0x319(0x07)
	struct Utask(:type)* ; // 0x320(0x08)
	struct FDelegate ; // 0x328(0x0c)
	char pad_334[0x4]; // 0x334(0x04)
	int64_t ; // 0x338(0x08)
	struct Fthreat_info ; // 0x340(0x38)
	OptionProperty ; // 0x378(0x39)
	char pad_3B1[0x7]; // 0x3b1(0x07)
	VerseDynamicProperty ; // 0x3b8(0x10)
	OptionProperty ; // 0x3c8(0x11)
	char pad_3D9[0x7]; // 0x3d9(0x07)
	VerseDynamicProperty ; // 0x3e0(0x10)
	VerseDynamicProperty ; // 0x3f0(0x10)
	struct Utask(:type)* ; // 0x400(0x08)
	struct FDelegate ; // 0x408(0x0c)
	char pad_414[0x4]; // 0x414(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x418(0x40)
	int64_t ; // 0x458(0x08)
	OptionProperty ; // 0x460(0x39)
	char pad_499[0x3]; // 0x499(0x03)
	struct FDelegate ; // 0x49c(0x0c)
	struct FDelegate ; // 0x4a8(0x0c)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mfloat_R ; // 0x4b8(0x30)
	enum class EVerseTrue ; // 0x4e8(0x01)
	char pad_4E9[0x3]; // 0x4e9(0x03)
	struct FDelegate ; // 0x4ec(0x0c)
	VerseStringProperty ; // 0x4f8(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$DispatchGoTo_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R
// Size: 0x2c1 (Inherited: 0x120)
struct Utask_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	OptionProperty ; // 0x168(0x02)
	enum class EVerseTrue ; // 0x16a(0x01)
	char pad_16B[0x1]; // 0x16b(0x01)
	struct FDelegate ; // 0x16c(0x0c)
	struct Ftuple_Lvector3_M_QParams_Nsphere__draw__params_R ; // 0x178(0x70)
	OptionProperty ; // 0x1e8(0x51)
	char pad_239[0x7]; // 0x239(0x07)
	struct Fsphere_draw_params ; // 0x240(0x50)
	struct Utask(:type)* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	int64_t ; // 0x2a8(0x08)
	enum class EVerseTrue ; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	struct FDelegate ; // 0x2b4(0x0c)
	struct Ftuple_L_R ; // 0x2c0(0x01)

	int64_t Update(); // Function VerseNPC.task_companion_ai$DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GameLoop_L_Nnpc__component_R
// Size: 0x430 (Inherited: 0x120)
struct Utask_companion_ai$GameLoop_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	VerseDynamicProperty ; // 0x130(0x10)
	OptionProperty ; // 0x140(0x11)
	char pad_151[0x7]; // 0x151(0x07)
	VerseDynamicProperty ; // 0x158(0x10)
	char  : 1; // 0x168(0x01)
	char pad_168_1 : 7; // 0x168(0x01)
	char pad_169[0x7]; // 0x169(0x07)
	struct Unpc_component* ; // 0x170(0x08)
	struct FDelegate ; // 0x178(0x0c)
	struct Ftuple_L_R ; // 0x184(0x01)
	char pad_185[0x3]; // 0x185(0x03)
	VerseDynamicProperty ; // 0x188(0x10)
	struct Unpc_component* ; // 0x198(0x08)
	struct Utask(:type)* ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	struct Ftuple_L_R ; // 0x1b4(0x01)
	char pad_1B5[0x3]; // 0x1b5(0x03)
	int64_t ; // 0x1b8(0x08)
	OptionProperty ; // 0x1c0(0x39)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	struct Fping_info ; // 0x200(0x38)
	OptionProperty ; // 0x238(0x39)
	enum class EVerseTrue ; // 0x271(0x01)
	char pad_272[0x2]; // 0x272(0x02)
	struct FDelegate ; // 0x274(0x0c)
	VerseStringProperty ; // 0x280(0x10)
	int64_t ; // 0x290(0x08)
	OptionProperty ; // 0x298(0x39)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct Unpc_component* ; // 0x2d8(0x08)
	struct Utask(:type)* ; // 0x2e0(0x08)
	struct FDelegate ; // 0x2e8(0x0c)
	struct Ftuple_L_R ; // 0x2f4(0x01)
	char pad_2F5[0x3]; // 0x2f5(0x03)
	int64_t ; // 0x2f8(0x08)
	struct Utask(:type)* ; // 0x300(0x08)
	struct FDelegate ; // 0x308(0x0c)
	char pad_314[0x4]; // 0x314(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x318(0x40)
	int64_t ; // 0x358(0x08)
	OptionProperty ; // 0x360(0x39)
	char pad_399[0x7]; // 0x399(0x07)
	struct Unpc_component* ; // 0x3a0(0x08)
	struct Utask(:type)* ; // 0x3a8(0x08)
	struct FDelegate ; // 0x3b0(0x0c)
	struct Ftuple_L_R ; // 0x3bc(0x01)
	char pad_3BD[0x3]; // 0x3bd(0x03)
	int64_t ; // 0x3c0(0x08)
	OptionProperty ; // 0x3c8(0x39)
	char pad_401[0x7]; // 0x401(0x07)
	struct Unpc_component* ; // 0x408(0x08)
	struct Utask(:type)* ; // 0x410(0x08)
	struct FDelegate ; // 0x418(0x0c)
	struct Ftuple_L_R ; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	int64_t ; // 0x428(0x08)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GameLoop_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GetNewObstacle_L_Nnpc__component_R
// Size: 0x209 (Inherited: 0x120)
struct Utask_companion_ai$GetNewObstacle_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x29)
	char pad_159[0x7]; // 0x159(0x07)
	OptionProperty ; // 0x160(0x29)
	char pad_189[0x7]; // 0x189(0x07)
	struct Unpc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	struct Ftuple_L_R ; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	int64_t ; // 0x1b0(0x08)
	struct Fobstacle_info ; // 0x1b8(0x28)
	OptionProperty ; // 0x1e0(0x29)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GetNewObstacle_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GetNewTargetPerception_L_Nnpc__component_M_N_Qthreat__info_R
// Size: 0x398 (Inherited: 0x120)
struct Utask_companion_ai$GetNewTargetPerception_L_Nnpc__component_M_N_Qthreat__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_M_Qthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x48)
	OptionProperty _RetVal; // 0x170(0x39)
	enum class EVerseTrue ; // 0x1a9(0x01)
	char pad_1AA[0x2]; // 0x1aa(0x02)
	struct FDelegate ; // 0x1ac(0x0c)
	VerseStringProperty ; // 0x1b8(0x10)
	struct Fthreat_info ; // 0x1c8(0x38)
	OptionProperty ; // 0x200(0x39)
	char pad_239[0x7]; // 0x239(0x07)
	OptionProperty ; // 0x240(0x39)
	char pad_279[0x7]; // 0x279(0x07)
	struct Unpc_component* ; // 0x280(0x08)
	struct Utask(:type)* ; // 0x288(0x08)
	struct FDelegate ; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	int64_t ; // 0x2a0(0x08)
	struct Fthreat_info ; // 0x2a8(0x38)
	OptionProperty ; // 0x2e0(0x39)
	char pad_319[0x7]; // 0x319(0x07)
	VerseDynamicProperty ; // 0x320(0x10)
	OptionProperty ; // 0x330(0x11)
	char pad_341[0x7]; // 0x341(0x07)
	VerseDynamicProperty ; // 0x348(0x10)
	VerseDynamicProperty ; // 0x358(0x10)
	struct FDelegate ; // 0x368(0x0c)
	enum class EVerseTrue ; // 0x374(0x01)
	char pad_375[0x3]; // 0x375(0x03)
	struct FDelegate ; // 0x378(0x0c)
	char pad_384[0x4]; // 0x384(0x04)
	VerseStringProperty ; // 0x388(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GetNewTargetPerception_L_Nnpc__component_M_N_Qthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GetNewThreat_L_Nnpc__component_R
// Size: 0x280 (Inherited: 0x120)
struct Utask_companion_ai$GetNewThreat_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x39)
	enum class EVerseTrue ; // 0x169(0x01)
	char pad_16A[0x2]; // 0x16a(0x02)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	OptionProperty ; // 0x188(0x39)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	struct Unpc_component* ; // 0x1c8(0x08)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	struct Ftuple_L_R ; // 0x1e4(0x01)
	char pad_1E5[0x3]; // 0x1e5(0x03)
	int64_t ; // 0x1e8(0x08)
	struct Fthreat_info ; // 0x1f0(0x38)
	OptionProperty ; // 0x228(0x39)
	enum class EVerseTrue ; // 0x261(0x01)
	char pad_262[0x2]; // 0x262(0x02)
	struct FDelegate ; // 0x264(0x0c)
	VerseStringProperty ; // 0x270(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GetNewThreat_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GetObstacle_L_Nnpc__component_R
// Size: 0x1c9 (Inherited: 0x120)
struct Utask_companion_ai$GetObstacle_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x29)
	char pad_159[0x7]; // 0x159(0x07)
	struct Fobstacle_info ; // 0x160(0x28)
	struct Unpc_component* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x29)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	struct FDelegate ; // 0x1bc(0x0c)
	struct Ftuple_L_R ; // 0x1c8(0x01)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GetObstacle_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GetThreat_L_Nnpc__component_R
// Size: 0x1f9 (Inherited: 0x120)
struct Utask_companion_ai$GetThreat_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x39)
	char pad_169[0x7]; // 0x169(0x07)
	struct Fthreat_info ; // 0x170(0x38)
	struct Unpc_component* ; // 0x1a8(0x08)
	OptionProperty ; // 0x1b0(0x39)
	char pad_1E9[0x3]; // 0x1e9(0x03)
	struct FDelegate ; // 0x1ec(0x0c)
	struct Ftuple_L_R ; // 0x1f8(0x01)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GetThreat_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GoToAndAttackTask_L_Nnpc__component_M_Nthreat__info_R
// Size: 0x228 (Inherited: 0x120)
struct Utask_companion_ai$GoToAndAttackTask_L_Nnpc__component_M_Nthreat__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	int64_t ; // 0x188(0x08)
	struct Utask(:type)* ; // 0x190(0x08)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	int64_t ; // 0x1a8(0x08)
	int64_t ; // 0x1b0(0x08)
	struct Unpc_component* ; // 0x1b8(0x08)
	struct Utask(:type)* ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	int64_t ; // 0x1d8(0x08)
	struct Unpc_component* ; // 0x1e0(0x08)
	struct Utask(:type)* ; // 0x1e8(0x08)
	struct FDelegate ; // 0x1f0(0x0c)
	struct Ftuple_L_R ; // 0x1fc(0x01)
	char pad_1FD[0x3]; // 0x1fd(0x03)
	int64_t ; // 0x200(0x08)
	enum class EVerseTrue ; // 0x208(0x01)
	char pad_209[0x3]; // 0x209(0x03)
	struct FDelegate ; // 0x20c(0x0c)
	VerseStringProperty ; // 0x218(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GoToAndAttackTask_L_Nnpc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$GoToPositionTask_L_Nnpc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R
// Size: 0x690 (Inherited: 0x120)
struct Utask_companion_ai$GoToPositionTask_L_Nnpc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x128(0x48)
	char _RetVal : 1; // 0x170(0x01)
	char pad_170_1 : 7; // 0x170(0x01)
	char pad_171[0x7]; // 0x171(0x07)
	struct Fnavigation_parameters ; // 0x178(0x10)
	enum class EVerseTrue ; // 0x188(0x01)
	char pad_189[0x3]; // 0x189(0x03)
	struct FDelegate ; // 0x18c(0x0c)
	VerseStringProperty ; // 0x198(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x1a8(0x10)
	struct FDelegate ; // 0x1b8(0x0c)
	char pad_1C4[0x4]; // 0x1c4(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x1c8(0x10)
	struct TArray<VerseStringProperty> ; // 0x1d8(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x1e8(0x20)
	VerseStringProperty ; // 0x208(0x10)
	VerseStringProperty ; // 0x218(0x10)
	struct FDelegate ; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	VerseStringProperty ; // 0x238(0x10)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	VerseStringProperty ; // 0x258(0x10)
	VerseStringProperty ; // 0x268(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x278(0x10)
	int64_t ; // 0x288(0x08)
	int64_t ; // 0x290(0x08)
	VerseStringProperty ; // 0x298(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2a8(0x10)
	VerseStringProperty ; // 0x2b8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2c8(0x10)
	int64_t ; // 0x2d8(0x08)
	int64_t ; // 0x2e0(0x08)
	char ; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	VerseDynamicProperty ; // 0x2f0(0x10)
	VerseStringProperty ; // 0x300(0x10)
	int64_t ; // 0x310(0x08)
	int64_t ; // 0x318(0x08)
	VerseDynamicProperty ; // 0x320(0x10)
	char ; // 0x330(0x01)
	OptionProperty ; // 0x331(0x02)
	char pad_333[0x5]; // 0x333(0x05)
	int64_t ; // 0x338(0x08)
	struct Utask(:type)* ; // 0x340(0x08)
	struct FDelegate ; // 0x348(0x0c)
	char pad_354[0x4]; // 0x354(0x04)
	int64_t ; // 0x358(0x08)
	enum class navigate_result ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	int64_t ; // 0x368(0x08)
	struct UEntity* ; // 0x370(0x08)
	OptionProperty ; // 0x378(0x08)
	enum class navigate_result ; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
	struct Unpc_component* ; // 0x388(0x08)
	struct Utask(:type)* ; // 0x390(0x08)
	struct FDelegate ; // 0x398(0x0c)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct Ftuple_Lentity_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x3a8(0x20)
	OptionProperty ; // 0x3c8(0x11)
	char pad_3D9[0x7]; // 0x3d9(0x07)
	int64_t ; // 0x3e0(0x08)
	enum class navigate_result ; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct Unpc_component* ; // 0x3f0(0x08)
	struct FDelegate ; // 0x3f8(0x0c)
	char pad_404[0x4]; // 0x404(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x408(0x30)
	OptionProperty ; // 0x438(0x11)
	char pad_449[0x7]; // 0x449(0x07)
	struct Utask(:type)* ; // 0x450(0x08)
	struct FDelegate ; // 0x458(0x0c)
	char pad_464[0x4]; // 0x464(0x04)
	struct Ftuple_Lnpc__component_M_Qentity_R ; // 0x468(0x10)
	int64_t ; // 0x478(0x08)
	VerseDynamicProperty ; // 0x480(0x10)
	OptionProperty ; // 0x490(0x11)
	char pad_4A1[0x7]; // 0x4a1(0x07)
	VerseDynamicProperty ; // 0x4a8(0x10)
	VerseDynamicProperty ; // 0x4b8(0x10)
	enum class EVerseTrue ; // 0x4c8(0x01)
	char pad_4C9[0x3]; // 0x4c9(0x03)
	struct FDelegate ; // 0x4cc(0x0c)
	VerseStringProperty ; // 0x4d8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x4e8(0x10)
	struct FDelegate ; // 0x4f8(0x0c)
	char pad_504[0x4]; // 0x504(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x508(0x10)
	struct TArray<VerseStringProperty> ; // 0x518(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x528(0x20)
	VerseStringProperty ; // 0x548(0x10)
	VerseStringProperty ; // 0x558(0x10)
	struct FDelegate ; // 0x568(0x0c)
	char pad_574[0x4]; // 0x574(0x04)
	VerseStringProperty ; // 0x578(0x10)
	struct FDelegate ; // 0x588(0x0c)
	char pad_594[0x4]; // 0x594(0x04)
	VerseStringProperty ; // 0x598(0x10)
	VerseStringProperty ; // 0x5a8(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x5b8(0x10)
	int64_t ; // 0x5c8(0x08)
	int64_t ; // 0x5d0(0x08)
	VerseStringProperty ; // 0x5d8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x5e8(0x10)
	VerseStringProperty ; // 0x5f8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x608(0x10)
	int64_t ; // 0x618(0x08)
	int64_t ; // 0x620(0x08)
	char ; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	VerseDynamicProperty ; // 0x630(0x10)
	VerseStringProperty ; // 0x640(0x10)
	int64_t ; // 0x650(0x08)
	int64_t ; // 0x658(0x08)
	VerseDynamicProperty ; // 0x660(0x10)
	char ; // 0x670(0x01)
	enum class EVerseTrue ; // 0x671(0x01)
	char pad_672[0x2]; // 0x672(0x02)
	struct FDelegate ; // 0x674(0x0c)
	VerseStringProperty ; // 0x680(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$GoToPositionTask_L_Nnpc__component_M_Nvector3_M_N_Qentity_M_Nlogic_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleBackToMeCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x2d0 (Inherited: 0x120)
struct Utask_companion_ai$HandleBackToMeCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct UEntity* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x08)
	char  : 1; // 0x198(0x01)
	char pad_198_1 : 7; // 0x198(0x01)
	char pad_199[0x7]; // 0x199(0x07)
	struct Utask(:type)* ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x1b8(0x48)
	struct Fvector3 ; // 0x200(0x18)
	OptionProperty ; // 0x218(0x11)
	char pad_229[0x7]; // 0x229(0x07)
	struct Fnavigation_parameters ; // 0x230(0x10)
	int64_t ; // 0x240(0x08)
	OptionProperty ; // 0x248(0x02)
	char pad_24A[0x6]; // 0x24a(0x06)
	int64_t ; // 0x250(0x08)
	struct Utask(:type)* ; // 0x258(0x08)
	struct FDelegate ; // 0x260(0x0c)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct Ftuple_Lentity_Mfloat_R ; // 0x270(0x10)
	int64_t ; // 0x280(0x08)
	struct Unpc_component* ; // 0x288(0x08)
	struct Utask(:type)* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	struct Ftuple_L_R ; // 0x2a4(0x01)
	char pad_2A5[0x3]; // 0x2a5(0x03)
	int64_t ; // 0x2a8(0x08)
	enum class EVerseTrue ; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	struct FDelegate ; // 0x2b4(0x0c)
	VerseStringProperty ; // 0x2c0(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleBackToMeCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleGoTo_L_Nnpc__component_M_Nping__info_R
// Size: 0x4b0 (Inherited: 0x120)
struct Utask_companion_ai$HandleGoTo_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	int64_t ; // 0x188(0x08)
	struct Utask(:type)* ; // 0x190(0x08)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct Ftuple_Lnpc__component_Mfloat_R ; // 0x1a8(0x10)
	int64_t ; // 0x1b8(0x08)
	char  : 1; // 0x1c0(0x01)
	char pad_1C0_1 : 7; // 0x1c0(0x01)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	VerseDynamicProperty ; // 0x1c8(0x10)
	OptionProperty ; // 0x1d8(0x11)
	char pad_1E9[0x7]; // 0x1e9(0x07)
	VerseDynamicProperty ; // 0x1f0(0x10)
	VerseDynamicProperty ; // 0x200(0x10)
	VerseDynamicProperty ; // 0x210(0x10)
	OptionProperty ; // 0x220(0x11)
	char pad_231[0x7]; // 0x231(0x07)
	VerseDynamicProperty ; // 0x238(0x10)
	VerseDynamicProperty ; // 0x248(0x10)
	VerseDynamicProperty ; // 0x258(0x10)
	OptionProperty ; // 0x268(0x11)
	char pad_279[0x7]; // 0x279(0x07)
	VerseDynamicProperty ; // 0x280(0x10)
	VerseDynamicProperty ; // 0x290(0x10)
	VerseDynamicProperty ; // 0x2a0(0x10)
	OptionProperty ; // 0x2b0(0x11)
	char pad_2C1[0x7]; // 0x2c1(0x07)
	VerseDynamicProperty ; // 0x2c8(0x10)
	VerseDynamicProperty ; // 0x2d8(0x10)
	char  : 1; // 0x2e8(0x01)
	char pad_2E8_1 : 7; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	struct Utask(:type)* ; // 0x2f0(0x08)
	struct FDelegate ; // 0x2f8(0x0c)
	char pad_304[0x4]; // 0x304(0x04)
	struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x308(0x48)
	OptionProperty ; // 0x350(0x11)
	char pad_361[0x7]; // 0x361(0x07)
	struct Fnavigation_parameters ; // 0x368(0x10)
	int64_t ; // 0x378(0x08)
	OptionProperty ; // 0x380(0x02)
	char  : 1; // 0x382(0x01)
	char pad_382_1 : 7; // 0x382(0x01)
	char pad_383[0x1]; // 0x383(0x01)
	struct FDelegate ; // 0x384(0x0c)
	struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x390(0x48)
	OptionProperty ; // 0x3d8(0x08)
	OptionProperty ; // 0x3e0(0x11)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct Fnavigation_parameters ; // 0x3f8(0x10)
	char  : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	struct FDelegate ; // 0x40c(0x0c)
	struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x418(0x48)
	OptionProperty ; // 0x460(0x08)
	OptionProperty ; // 0x468(0x11)
	char pad_479[0x7]; // 0x479(0x07)
	struct Fnavigation_parameters ; // 0x480(0x10)
	enum class EVerseTrue ; // 0x490(0x01)
	char pad_491[0x3]; // 0x491(0x03)
	struct FDelegate ; // 0x494(0x0c)
	VerseStringProperty ; // 0x4a0(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleGoTo_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleGoToCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x270 (Inherited: 0x120)
struct Utask_companion_ai$HandleGoToCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct UEntity* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x08)
	int64_t ; // 0x198(0x08)
	struct Utask(:type)* ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mentity_R ; // 0x1b8(0x30)
	int64_t ; // 0x1e8(0x08)
	struct Utask(:type)* ; // 0x1f0(0x08)
	struct FDelegate ; // 0x1f8(0x0c)
	char pad_204[0x4]; // 0x204(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x208(0x40)
	int64_t ; // 0x248(0x08)
	enum class EVerseTrue ; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FDelegate ; // 0x254(0x0c)
	VerseStringProperty ; // 0x260(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleGoToCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleHoldPositionCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x2b8 (Inherited: 0x120)
struct Utask_companion_ai$HandleHoldPositionCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct Fvector3 ; // 0x188(0x18)
	struct Uposition_component* ; // 0x1a0(0x08)
	OptionProperty ; // 0x1a8(0x08)
	struct Fvector3 ; // 0x1b0(0x18)
	struct Uposition_component* ; // 0x1c8(0x08)
	struct FDelegate ; // 0x1d0(0x0c)
	struct Ftuple_L_R ; // 0x1dc(0x01)
	char pad_1DD[0x3]; // 0x1dd(0x03)
	struct UEntity* ; // 0x1e0(0x08)
	OptionProperty ; // 0x1e8(0x08)
	int64_t ; // 0x1f0(0x08)
	struct Utask(:type)* ; // 0x1f8(0x08)
	struct FDelegate ; // 0x200(0x0c)
	char pad_20C[0x4]; // 0x20c(0x04)
	struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mentity_R ; // 0x210(0x30)
	int64_t ; // 0x240(0x08)
	struct Utask(:type)* ; // 0x248(0x08)
	struct FDelegate ; // 0x250(0x0c)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct Ftuple_Lnpc__component_Mvector3_R ; // 0x260(0x20)
	int64_t ; // 0x280(0x08)
	struct FDelegate ; // 0x288(0x0c)
	enum class EVerseTrue ; // 0x294(0x01)
	char pad_295[0x3]; // 0x295(0x03)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	VerseStringProperty ; // 0x2a8(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleHoldPositionCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleNPCCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x6b0 (Inherited: 0x120)
struct Utask_companion_ai$HandleNPCCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x188(0x10)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x1a8(0x10)
	struct TArray<VerseStringProperty> ; // 0x1b8(0x10)
	struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R ; // 0x1c8(0x40)
	VerseStringProperty ; // 0x208(0x10)
	VerseStringProperty ; // 0x218(0x10)
	struct FDelegate ; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	VerseStringProperty ; // 0x238(0x10)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	VerseStringProperty ; // 0x258(0x10)
	VerseStringProperty ; // 0x268(0x10)
	struct FDelegate ; // 0x278(0x0c)
	char pad_284[0x4]; // 0x284(0x04)
	VerseStringProperty ; // 0x288(0x10)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	VerseStringProperty ; // 0x2a8(0x10)
	VerseStringProperty ; // 0x2b8(0x10)
	VerseStringProperty ; // 0x2c8(0x10)
	VerseStringProperty ; // 0x2d8(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2e8(0x10)
	int64_t ; // 0x2f8(0x08)
	int64_t ; // 0x300(0x08)
	VerseStringProperty ; // 0x308(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x318(0x10)
	VerseStringProperty ; // 0x328(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x338(0x10)
	int64_t ; // 0x348(0x08)
	int64_t ; // 0x350(0x08)
	char ; // 0x358(0x01)
	char pad_359[0x7]; // 0x359(0x07)
	VerseDynamicProperty ; // 0x360(0x10)
	VerseStringProperty ; // 0x370(0x10)
	int64_t ; // 0x380(0x08)
	int64_t ; // 0x388(0x08)
	VerseDynamicProperty ; // 0x390(0x10)
	char ; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	VerseDynamicProperty ; // 0x3a8(0x10)
	OptionProperty ; // 0x3b8(0x11)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	VerseDynamicProperty ; // 0x3d0(0x10)
	VerseDynamicProperty ; // 0x3e0(0x10)
	struct Utask(:type)* ; // 0x3f0(0x08)
	struct FDelegate ; // 0x3f8(0x0c)
	char pad_404[0x4]; // 0x404(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x408(0x40)
	int64_t ; // 0x448(0x08)
	VerseDynamicProperty ; // 0x450(0x10)
	OptionProperty ; // 0x460(0x11)
	char pad_471[0x7]; // 0x471(0x07)
	VerseDynamicProperty ; // 0x478(0x10)
	VerseDynamicProperty ; // 0x488(0x10)
	struct FDelegate ; // 0x498(0x0c)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x4a8(0x40)
	VerseDynamicProperty ; // 0x4e8(0x10)
	OptionProperty ; // 0x4f8(0x11)
	char pad_509[0x7]; // 0x509(0x07)
	VerseDynamicProperty ; // 0x510(0x10)
	VerseDynamicProperty ; // 0x520(0x10)
	struct FDelegate ; // 0x530(0x0c)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x540(0x40)
	VerseDynamicProperty ; // 0x580(0x10)
	OptionProperty ; // 0x590(0x11)
	char pad_5A1[0x7]; // 0x5a1(0x07)
	VerseDynamicProperty ; // 0x5a8(0x10)
	VerseDynamicProperty ; // 0x5b8(0x10)
	struct FDelegate ; // 0x5c8(0x0c)
	char pad_5D4[0x4]; // 0x5d4(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x5d8(0x40)
	VerseDynamicProperty ; // 0x618(0x10)
	OptionProperty ; // 0x628(0x11)
	char pad_639[0x7]; // 0x639(0x07)
	VerseDynamicProperty ; // 0x640(0x10)
	VerseDynamicProperty ; // 0x650(0x10)
	struct Unpc_component* ; // 0x660(0x08)
	enum class EVerseTrue ; // 0x668(0x01)
	char pad_669[0x3]; // 0x669(0x03)
	struct FDelegate ; // 0x66c(0x0c)
	struct Unpc_component* ; // 0x678(0x08)
	struct FDelegate ; // 0x680(0x0c)
	struct Ftuple_L_R ; // 0x68c(0x01)
	enum class EVerseTrue ; // 0x68d(0x01)
	char pad_68E[0x2]; // 0x68e(0x02)
	struct FDelegate ; // 0x690(0x0c)
	char pad_69C[0x4]; // 0x69c(0x04)
	VerseStringProperty ; // 0x6a0(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleNPCCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleObstacleTask_L_Nnpc__component_M_N_Qentity_R
// Size: 0x4a0 (Inherited: 0x120)
struct Utask_companion_ai$HandleObstacleTask_L_Nnpc__component_M_N_Qentity_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_M_Qentity_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	enum class EVerseTrue ; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	struct FDelegate ; // 0x13c(0x0c)
	VerseStringProperty ; // 0x148(0x10)
	OptionProperty ; // 0x158(0x29)
	char pad_181[0x7]; // 0x181(0x07)
	struct Utask(:type)* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	int64_t ; // 0x1a0(0x08)
	int64_t ; // 0x1a8(0x08)
	struct Fobstacle_info ; // 0x1b0(0x28)
	OptionProperty ; // 0x1d8(0x29)
	enum class EVerseTrue ; // 0x201(0x01)
	char pad_202[0x2]; // 0x202(0x02)
	struct FDelegate ; // 0x204(0x0c)
	VerseStringProperty ; // 0x210(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x220(0x10)
	struct FDelegate ; // 0x230(0x0c)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x240(0x10)
	struct TArray<VerseStringProperty> ; // 0x250(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x260(0x20)
	VerseStringProperty ; // 0x280(0x10)
	VerseStringProperty ; // 0x290(0x10)
	struct FDelegate ; // 0x2a0(0x0c)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	VerseStringProperty ; // 0x2b0(0x10)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	VerseStringProperty ; // 0x2d0(0x10)
	VerseStringProperty ; // 0x2e0(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2f0(0x10)
	int64_t ; // 0x300(0x08)
	int64_t ; // 0x308(0x08)
	VerseStringProperty ; // 0x310(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x320(0x10)
	VerseStringProperty ; // 0x330(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x340(0x10)
	int64_t ; // 0x350(0x08)
	int64_t ; // 0x358(0x08)
	char ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	VerseDynamicProperty ; // 0x368(0x10)
	VerseStringProperty ; // 0x378(0x10)
	int64_t ; // 0x388(0x08)
	int64_t ; // 0x390(0x08)
	VerseDynamicProperty ; // 0x398(0x10)
	char ; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)
	struct UEntity* ; // 0x3b0(0x08)
	OptionProperty ; // 0x3b8(0x08)
	OptionProperty ; // 0x3c0(0x02)
	char  : 1; // 0x3c2(0x01)
	char pad_3C2_1 : 7; // 0x3c2(0x01)
	char pad_3C3[0x5]; // 0x3c3(0x05)
	struct UEntity* ; // 0x3c8(0x08)
	struct FDelegate ; // 0x3d0(0x0c)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct Utask(:type)* ; // 0x3e0(0x08)
	struct FDelegate ; // 0x3e8(0x0c)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	int64_t ; // 0x3f8(0x08)
	struct FDelegate ; // 0x400(0x0c)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct Unpc_component* ; // 0x410(0x08)
	struct FDelegate ; // 0x418(0x0c)
	struct FDelegate ; // 0x424(0x0c)
	OptionProperty ; // 0x430(0x29)
	char pad_459[0x7]; // 0x459(0x07)
	struct Utask(:type)* ; // 0x460(0x08)
	struct FDelegate ; // 0x468(0x0c)
	char pad_474[0x4]; // 0x474(0x04)
	int64_t ; // 0x478(0x08)
	enum class EVerseTrue ; // 0x480(0x01)
	char pad_481[0x3]; // 0x481(0x03)
	struct FDelegate ; // 0x484(0x0c)
	VerseStringProperty ; // 0x490(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleObstacleTask_L_Nnpc__component_M_N_Qentity_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleReviveCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x278 (Inherited: 0x120)
struct Utask_companion_ai$HandleReviveCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	char  : 1; // 0x188(0x01)
	char pad_188_1 : 7; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
	struct UEntity* ; // 0x190(0x08)
	OptionProperty ; // 0x198(0x08)
	char  : 1; // 0x1a0(0x01)
	char pad_1A0_1 : 7; // 0x1a0(0x01)
	char pad_1A1[0x7]; // 0x1a1(0x07)
	struct Utask(:type)* ; // 0x1a8(0x08)
	struct FDelegate ; // 0x1b0(0x0c)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct Ftuple_Lnpc__component_Mentity_R ; // 0x1c0(0x10)
	int64_t ; // 0x1d0(0x08)
	OptionProperty ; // 0x1d8(0x02)
	char pad_1DA[0x6]; // 0x1da(0x06)
	struct TArray<struct UEntity*> ; // 0x1e0(0x10)
	struct FDelegate ; // 0x1f0(0x0c)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	int64_t ; // 0x200(0x08)
	int64_t ; // 0x208(0x08)
	struct UEntity* ; // 0x210(0x08)
	char  : 1; // 0x218(0x01)
	char pad_218_1 : 7; // 0x218(0x01)
	char pad_219[0x3]; // 0x219(0x03)
	struct FDelegate ; // 0x21c(0x0c)
	struct Ftuple_Lnpc__component_Mentity_R ; // 0x228(0x10)
	OptionProperty ; // 0x238(0x02)
	OptionProperty ; // 0x23a(0x02)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct Unpc_component* ; // 0x240(0x08)
	enum class EVerseTrue ; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	struct FDelegate ; // 0x24c(0x0c)
	enum class EVerseTrue ; // 0x258(0x01)
	char pad_259[0x3]; // 0x259(0x03)
	struct FDelegate ; // 0x25c(0x0c)
	VerseStringProperty ; // 0x268(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleReviveCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HandleTarget_L_Nnpc__component_R
// Size: 0x6e0 (Inherited: 0x120)
struct Utask_companion_ai$HandleTarget_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	struct Fthreat_info ; // 0x130(0x38)
	struct Unpc_component* ; // 0x168(0x08)
	OptionProperty ; // 0x170(0x39)
	char pad_1A9[0x3]; // 0x1a9(0x03)
	struct FDelegate ; // 0x1ac(0x0c)
	struct Ftuple_L_R ; // 0x1b8(0x01)
	enum class EVerseTrue ; // 0x1b9(0x01)
	char pad_1BA[0x2]; // 0x1ba(0x02)
	struct FDelegate ; // 0x1bc(0x0c)
	VerseStringProperty ; // 0x1c8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x1d8(0x10)
	struct FDelegate ; // 0x1e8(0x0c)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x1f8(0x10)
	struct TArray<VerseStringProperty> ; // 0x208(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x218(0x20)
	VerseStringProperty ; // 0x238(0x10)
	VerseStringProperty ; // 0x248(0x10)
	struct FDelegate ; // 0x258(0x0c)
	char pad_264[0x4]; // 0x264(0x04)
	VerseStringProperty ; // 0x268(0x10)
	struct FDelegate ; // 0x278(0x0c)
	char pad_284[0x4]; // 0x284(0x04)
	VerseStringProperty ; // 0x288(0x10)
	VerseStringProperty ; // 0x298(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2a8(0x10)
	int64_t ; // 0x2b8(0x08)
	int64_t ; // 0x2c0(0x08)
	VerseStringProperty ; // 0x2c8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2d8(0x10)
	VerseStringProperty ; // 0x2e8(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x2f8(0x10)
	int64_t ; // 0x308(0x08)
	int64_t ; // 0x310(0x08)
	char ; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	VerseDynamicProperty ; // 0x320(0x10)
	VerseStringProperty ; // 0x330(0x10)
	int64_t ; // 0x340(0x08)
	int64_t ; // 0x348(0x08)
	VerseDynamicProperty ; // 0x350(0x10)
	char ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	int64_t ; // 0x368(0x08)
	struct Utask(:type)* ; // 0x370(0x08)
	struct FDelegate ; // 0x378(0x0c)
	char pad_384[0x4]; // 0x384(0x04)
	int64_t ; // 0x388(0x08)
	struct Utask(:type)* ; // 0x390(0x08)
	struct FDelegate ; // 0x398(0x0c)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct Ftuple_Lnpc__component_M_Qthreat__info_R ; // 0x3a8(0x48)
	OptionProperty ; // 0x3f0(0x39)
	char pad_429[0x7]; // 0x429(0x07)
	int64_t ; // 0x430(0x08)
	VerseDynamicProperty ; // 0x438(0x10)
	OptionProperty ; // 0x448(0x11)
	char pad_459[0x7]; // 0x459(0x07)
	VerseDynamicProperty ; // 0x460(0x10)
	VerseDynamicProperty ; // 0x470(0x10)
	enum class EVerseTrue ; // 0x480(0x01)
	char pad_481[0x3]; // 0x481(0x03)
	struct FDelegate ; // 0x484(0x0c)
	VerseStringProperty ; // 0x490(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x4a0(0x10)
	struct FDelegate ; // 0x4b0(0x0c)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x4c0(0x10)
	struct TArray<VerseStringProperty> ; // 0x4d0(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x4e0(0x20)
	VerseStringProperty ; // 0x500(0x10)
	VerseStringProperty ; // 0x510(0x10)
	struct FDelegate ; // 0x520(0x0c)
	char pad_52C[0x4]; // 0x52c(0x04)
	VerseStringProperty ; // 0x530(0x10)
	struct FDelegate ; // 0x540(0x0c)
	char pad_54C[0x4]; // 0x54c(0x04)
	VerseStringProperty ; // 0x550(0x10)
	VerseStringProperty ; // 0x560(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x570(0x10)
	int64_t ; // 0x580(0x08)
	int64_t ; // 0x588(0x08)
	VerseStringProperty ; // 0x590(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x5a0(0x10)
	VerseStringProperty ; // 0x5b0(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x5c0(0x10)
	int64_t ; // 0x5d0(0x08)
	int64_t ; // 0x5d8(0x08)
	char ; // 0x5e0(0x01)
	char pad_5E1[0x7]; // 0x5e1(0x07)
	VerseDynamicProperty ; // 0x5e8(0x10)
	VerseStringProperty ; // 0x5f8(0x10)
	int64_t ; // 0x608(0x08)
	int64_t ; // 0x610(0x08)
	VerseDynamicProperty ; // 0x618(0x10)
	char ; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct Utask(:type)* ; // 0x630(0x08)
	struct FDelegate ; // 0x638(0x0c)
	char pad_644[0x4]; // 0x644(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x648(0x40)
	int64_t ; // 0x688(0x08)
	int64_t ; // 0x690(0x08)
	struct Utask(:type)* ; // 0x698(0x08)
	struct FDelegate ; // 0x6a0(0x0c)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	int64_t ; // 0x6b0(0x08)
	struct Unpc_component* ; // 0x6b8(0x08)
	struct Utask(:type)* ; // 0x6c0(0x08)
	struct FDelegate ; // 0x6c8(0x0c)
	char pad_6D4[0x4]; // 0x6d4(0x04)
	int64_t ; // 0x6d8(0x08)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HandleTarget_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$HoldPositionCommand_L_Nnpc__component_M_Nvector3_R
// Size: 0x224 (Inherited: 0x120)
struct Utask_companion_ai$HoldPositionCommand_L_Nnpc__component_M_Nvector3_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mvector3_R __verse_0xB2CDDD72_Argument; // 0x128(0x20)
	struct Unpc_component* ; // 0x148(0x08)
	struct Utask(:type)* ; // 0x150(0x08)
	struct FDelegate ; // 0x158(0x0c)
	char pad_164[0x4]; // 0x164(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x168(0x30)
	OptionProperty ; // 0x198(0x11)
	char pad_1A9[0x7]; // 0x1a9(0x07)
	struct Fnavigation_parameters ; // 0x1b0(0x10)
	int64_t ; // 0x1c0(0x08)
	int64_t ; // 0x1c8(0x08)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	char pad_1E4[0x4]; // 0x1e4(0x04)
	int64_t ; // 0x1e8(0x08)
	int64_t ; // 0x1f0(0x08)
	struct Utask(:type)* ; // 0x1f8(0x08)
	struct FDelegate ; // 0x200(0x0c)
	char pad_20C[0x4]; // 0x20c(0x04)
	int64_t ; // 0x210(0x08)
	struct FDelegate ; // 0x218(0x0c)

	int64_t Update(); // Function VerseNPC.task_companion_ai$HoldPositionCommand_L_Nnpc__component_M_Nvector3_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$LookAroundTask_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nfloat_R
// Size: 0x2c0 (Inherited: 0x120)
struct Utask_companion_ai$LookAroundTask_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nfloat_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x128(0x30)
	struct Fvector3 ; // 0x158(0x18)
	double ; // 0x170(0x08)
	struct FDelegate ; // 0x178(0x0c)
	char pad_184[0x4]; // 0x184(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x188(0x10)
	double ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x1b0(0x10)
	double ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x1d8(0x10)
	int64_t ; // 0x1e8(0x08)
	struct Unpc_component* ; // 0x1f0(0x08)
	struct Utask(:type)* ; // 0x1f8(0x08)
	struct FDelegate ; // 0x200(0x0c)
	char pad_20C[0x4]; // 0x20c(0x04)
	struct Fvector3 ; // 0x210(0x18)
	struct FDelegate ; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x238(0x30)
	int64_t ; // 0x268(0x08)
	struct Unpc_component* ; // 0x270(0x08)
	struct Utask(:type)* ; // 0x278(0x08)
	struct FDelegate ; // 0x280(0x0c)
	char pad_28C[0x4]; // 0x28c(0x04)
	double ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x2a8(0x10)
	int64_t ; // 0x2b8(0x08)

	int64_t Update(); // Function VerseNPC.task_companion_ai$LookAroundTask_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$LookAtThreatTask_L_Nnpc__component_R
// Size: 0x330 (Inherited: 0x120)
struct Utask_companion_ai$LookAtThreatTask_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Fthreat_info ; // 0x150(0x38)
	struct Unpc_component* ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x39)
	char pad_1C9[0x3]; // 0x1c9(0x03)
	struct FDelegate ; // 0x1cc(0x0c)
	struct Ftuple_L_R ; // 0x1d8(0x01)
	char pad_1D9[0x7]; // 0x1d9(0x07)
	int64_t ; // 0x1e0(0x08)
	struct Utask(:type)* ; // 0x1e8(0x08)
	struct FDelegate ; // 0x1f0(0x0c)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	struct Ftuple_Lnpc__component_M_Qthreat__info_R ; // 0x200(0x48)
	OptionProperty ; // 0x248(0x39)
	char pad_281[0x7]; // 0x281(0x07)
	int64_t ; // 0x288(0x08)
	struct Utask(:type)* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	int64_t ; // 0x2a8(0x08)
	struct Unpc_component* ; // 0x2b0(0x08)
	struct Utask(:type)* ; // 0x2b8(0x08)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	int64_t ; // 0x2d0(0x08)
	struct Unpc_component* ; // 0x2d8(0x08)
	struct FDelegate ; // 0x2e0(0x0c)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct Utask(:type)* ; // 0x2f0(0x08)
	struct FDelegate ; // 0x2f8(0x0c)
	char pad_304[0x4]; // 0x304(0x04)
	int64_t ; // 0x308(0x08)
	enum class EVerseTrue ; // 0x310(0x01)
	char pad_311[0x3]; // 0x311(0x03)
	struct FDelegate ; // 0x314(0x0c)
	VerseStringProperty ; // 0x320(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$LookAtThreatTask_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$OnDamagedBy_L_Nnpc__component_R
// Size: 0x1d8 (Inherited: 0x120)
struct Utask_companion_ai$OnDamagedBy_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	struct Fdamage_info _RetVal; // 0x130(0x40)
	enum class EVerseTrue ; // 0x170(0x01)
	char pad_171[0x3]; // 0x171(0x03)
	struct FDelegate ; // 0x174(0x0c)
	VerseStringProperty ; // 0x180(0x10)
	struct Unpc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	struct Ftuple_L_R ; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	int64_t ; // 0x1b0(0x08)
	enum class EVerseTrue ; // 0x1b8(0x01)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	struct FDelegate ; // 0x1bc(0x0c)
	VerseStringProperty ; // 0x1c8(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$OnDamagedBy_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$ReviveCommand_L_Nnpc__component_M_Nentity_R
// Size: 0x310 (Inherited: 0x120)
struct Utask_companion_ai$ReviveCommand_L_Nnpc__component_M_Nentity_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mentity_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	char _RetVal : 1; // 0x138(0x01)
	char pad_138_1 : 7; // 0x138(0x01)
	enum class EVerseTrue ; // 0x139(0x01)
	char pad_13A[0x2]; // 0x13a(0x02)
	struct FDelegate ; // 0x13c(0x0c)
	VerseStringProperty ; // 0x148(0x10)
	OptionProperty ; // 0x158(0x08)
	struct UEntity* ; // 0x160(0x08)
	struct FDelegate ; // 0x168(0x0c)
	char pad_174[0x4]; // 0x174(0x04)
	struct Uhealth_component* ; // 0x178(0x08)
	OptionProperty ; // 0x180(0x08)
	OptionProperty ; // 0x188(0x08)
	OptionProperty ; // 0x190(0x02)
	char  : 1; // 0x192(0x01)
	char pad_192_1 : 7; // 0x192(0x01)
	char pad_193[0x5]; // 0x193(0x05)
	struct Uhealth_component* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	struct Ftuple_L_R ; // 0x1ac(0x01)
	enum class EVerseTrue ; // 0x1ad(0x01)
	char pad_1AE[0x2]; // 0x1ae(0x02)
	struct FDelegate ; // 0x1b0(0x0c)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	VerseStringProperty ; // 0x1c0(0x10)
	char  : 1; // 0x1d0(0x01)
	char pad_1D0_1 : 7; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	struct Utask(:type)* ; // 0x1d8(0x08)
	struct FDelegate ; // 0x1e0(0x0c)
	char pad_1EC[0x4]; // 0x1ec(0x04)
	struct Ftuple_Lnpc__component_Mvector3_M_Qentity_Mlogic_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x1f0(0x48)
	struct Fvector3 ; // 0x238(0x18)
	OptionProperty ; // 0x250(0x08)
	OptionProperty ; // 0x258(0x11)
	char pad_269[0x7]; // 0x269(0x07)
	struct Fnavigation_parameters ; // 0x270(0x10)
	int64_t ; // 0x280(0x08)
	OptionProperty ; // 0x288(0x02)
	enum class action_result ; // 0x28a(0x01)
	char pad_28B[0x5]; // 0x28b(0x05)
	struct Unpc_component* ; // 0x290(0x08)
	struct FDelegate ; // 0x298(0x0c)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	VerseDynamicProperty ; // 0x2a8(0x10)
	OptionProperty ; // 0x2b8(0x11)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	VerseDynamicProperty ; // 0x2d0(0x10)
	VerseDynamicProperty ; // 0x2e0(0x10)
	enum class EVerseTrue ; // 0x2f0(0x01)
	char pad_2F1[0x3]; // 0x2f1(0x03)
	struct FDelegate ; // 0x2f4(0x0c)
	VerseStringProperty ; // 0x300(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$ReviveCommand_L_Nnpc__component_M_Nentity_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$SetLeashPosition_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nentity_R
// Size: 0x410 (Inherited: 0x120)
struct Utask_companion_ai$SetLeashPosition_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nentity_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mvector3_Mfloat_Mentity_R __verse_0xB2CDDD72_Argument; // 0x128(0x30)
	enum class EVerseTrue ; // 0x158(0x01)
	char pad_159[0x3]; // 0x159(0x03)
	struct FDelegate ; // 0x15c(0x0c)
	VerseStringProperty ; // 0x168(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x178(0x10)
	struct FDelegate ; // 0x188(0x0c)
	char pad_194[0x4]; // 0x194(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x198(0x10)
	struct TArray<VerseStringProperty> ; // 0x1a8(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x1b8(0x20)
	VerseStringProperty ; // 0x1d8(0x10)
	VerseStringProperty ; // 0x1e8(0x10)
	struct FDelegate ; // 0x1f8(0x0c)
	char pad_204[0x4]; // 0x204(0x04)
	VerseStringProperty ; // 0x208(0x10)
	VerseStringProperty ; // 0x218(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x228(0x10)
	int64_t ; // 0x238(0x08)
	int64_t ; // 0x240(0x08)
	VerseStringProperty ; // 0x248(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x258(0x10)
	VerseStringProperty ; // 0x268(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x278(0x10)
	int64_t ; // 0x288(0x08)
	int64_t ; // 0x290(0x08)
	char ; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	VerseDynamicProperty ; // 0x2a0(0x10)
	VerseStringProperty ; // 0x2b0(0x10)
	int64_t ; // 0x2c0(0x08)
	int64_t ; // 0x2c8(0x08)
	VerseDynamicProperty ; // 0x2d0(0x10)
	char ; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)
	int64_t ; // 0x2e8(0x08)
	struct Utask(:type)* ; // 0x2f0(0x08)
	struct FDelegate ; // 0x2f8(0x0c)
	char pad_304[0x4]; // 0x304(0x04)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R ; // 0x308(0x40)
	struct FColor ; // 0x348(0x20)
	struct FDelegate ; // 0x368(0x0c)
	char pad_374[0x4]; // 0x374(0x04)
	int64_t ; // 0x378(0x08)
	struct Unpc_component* ; // 0x380(0x08)
	enum class EVerseTrue ; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	struct FDelegate ; // 0x38c(0x0c)
	struct Ftuple_Lvector3_Mfloat_R ; // 0x398(0x20)
	struct Utask(:type)* ; // 0x3b8(0x08)
	struct FDelegate ; // 0x3c0(0x0c)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	int64_t ; // 0x3d0(0x08)
	enum class EVerseTrue ; // 0x3d8(0x01)
	char pad_3D9[0x3]; // 0x3d9(0x03)
	struct FDelegate ; // 0x3dc(0x0c)
	VerseStringProperty ; // 0x3e8(0x10)
	struct Unpc_component* ; // 0x3f8(0x08)
	enum class EVerseTrue ; // 0x400(0x01)
	char pad_401[0x3]; // 0x401(0x03)
	struct FDelegate ; // 0x404(0x0c)

	int64_t Update(); // Function VerseNPC.task_companion_ai$SetLeashPosition_L_Nnpc__component_M_Nvector3_M_Nfloat_M_Nentity_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$ShootTargetService_L_Nnpc__component_M_Nfloat_R
// Size: 0x4e0 (Inherited: 0x120)
struct Utask_companion_ai$ShootTargetService_L_Nnpc__component_M_Nfloat_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	enum class EVerseTrue ; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	struct FDelegate ; // 0x13c(0x0c)
	VerseStringProperty ; // 0x148(0x10)
	struct Utask(:type)* ; // 0x158(0x08)
	struct FDelegate ; // 0x160(0x0c)
	char pad_16C[0x4]; // 0x16c(0x04)
	int64_t ; // 0x170(0x08)
	struct Fthreat_info ; // 0x178(0x38)
	struct Unpc_component* ; // 0x1b0(0x08)
	OptionProperty ; // 0x1b8(0x39)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	struct FDelegate ; // 0x1f4(0x0c)
	struct Ftuple_L_R ; // 0x200(0x01)
	char pad_201[0x7]; // 0x201(0x07)
	int64_t ; // 0x208(0x08)
	struct Utask(:type)* ; // 0x210(0x08)
	struct FDelegate ; // 0x218(0x0c)
	char pad_224[0x4]; // 0x224(0x04)
	struct Ftuple_Lnpc__component_M_Qthreat__info_R ; // 0x228(0x48)
	OptionProperty ; // 0x270(0x39)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	int64_t ; // 0x2b0(0x08)
	struct Utask(:type)* ; // 0x2b8(0x08)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	int64_t ; // 0x2d0(0x08)
	VerseDynamicProperty ; // 0x2d8(0x10)
	OptionProperty ; // 0x2e8(0x11)
	char pad_2F9[0x7]; // 0x2f9(0x07)
	VerseDynamicProperty ; // 0x300(0x10)
	VerseDynamicProperty ; // 0x310(0x10)
	struct Uposition_component* ; // 0x320(0x08)
	OptionProperty ; // 0x328(0x08)
	struct Fvector3 ; // 0x330(0x18)
	struct Unpc_component* ; // 0x348(0x08)
	OptionProperty ; // 0x350(0x19)
	char pad_369[0x3]; // 0x369(0x03)
	struct FDelegate ; // 0x36c(0x0c)
	struct Ftuple_L_R ; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	OptionProperty ; // 0x380(0x09)
	char pad_389[0x7]; // 0x389(0x07)
	double ; // 0x390(0x08)
	struct FDelegate ; // 0x398(0x0c)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x3a8(0x30)
	struct Fvector3 ; // 0x3d8(0x18)
	struct Uposition_component* ; // 0x3f0(0x08)
	struct FDelegate ; // 0x3f8(0x0c)
	struct Ftuple_L_R ; // 0x404(0x01)
	char pad_405[0x3]; // 0x405(0x03)
	OptionProperty ; // 0x408(0x09)
	char pad_411[0x7]; // 0x411(0x07)
	double ; // 0x418(0x08)
	struct FDelegate ; // 0x420(0x0c)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x430(0x30)
	enum class EVerseTrue ; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	struct FDelegate ; // 0x464(0x0c)
	VerseStringProperty ; // 0x470(0x10)
	struct Unpc_component* ; // 0x480(0x08)
	struct Utask(:type)* ; // 0x488(0x08)
	struct FDelegate ; // 0x490(0x0c)
	char pad_49C[0x4]; // 0x49c(0x04)
	int64_t ; // 0x4a0(0x08)
	struct FDelegate ; // 0x4a8(0x0c)
	struct FDelegate ; // 0x4b4(0x0c)
	enum class EVerseTrue ; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	struct FDelegate ; // 0x4c4(0x0c)
	VerseStringProperty ; // 0x4d0(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$ShootTargetService_L_Nnpc__component_M_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$SprintService_L_Nnpc__component_R
// Size: 0x198 (Inherited: 0x120)
struct Utask_companion_ai$SprintService_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Unpc_component* ; // 0x150(0x08)
	struct Utask(:type)* ; // 0x158(0x08)
	struct FDelegate ; // 0x160(0x0c)
	struct Ftuple_L_R ; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	int64_t ; // 0x170(0x08)
	enum class EVerseTrue ; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	struct FDelegate ; // 0x17c(0x0c)
	VerseStringProperty ; // 0x188(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$SprintService_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$TacticalSprintService_L_Nnpc__component_R
// Size: 0x198 (Inherited: 0x120)
struct Utask_companion_ai$TacticalSprintService_L_Nnpc__component_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Unpc_component* ; // 0x150(0x08)
	struct Utask(:type)* ; // 0x158(0x08)
	struct FDelegate ; // 0x160(0x0c)
	struct Ftuple_L_R ; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	int64_t ; // 0x170(0x08)
	enum class EVerseTrue ; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	struct FDelegate ; // 0x17c(0x0c)
	VerseStringProperty ; // 0x188(0x10)

	int64_t Update(); // Function VerseNPC.task_companion_ai$TacticalSprintService_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_companion_ai$WaitForEntityMovement_L_Nentity_M_Nfloat_R
// Size: 0x3d0 (Inherited: 0x120)
struct Utask_companion_ai$WaitForEntityMovement_L_Nentity_M_Nfloat_R : Utask(:type) {
	struct Ucompanion_ai* _Self; // 0x120(0x08)
	struct Ftuple_Lentity_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x128(0x10)
	OptionProperty ; // 0x138(0x08)
	struct UEntity* ; // 0x140(0x08)
	struct FDelegate ; // 0x148(0x0c)
	char pad_154[0x4]; // 0x154(0x04)
	struct Uposition_component* ; // 0x158(0x08)
	OptionProperty ; // 0x160(0x08)
	OptionProperty ; // 0x168(0x08)
	struct Fvector3 ; // 0x170(0x18)
	struct Uposition_component* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	struct Ftuple_L_R ; // 0x19c(0x01)
	char pad_19D[0x3]; // 0x19d(0x03)
	double ; // 0x1a0(0x08)
	struct FDelegate ; // 0x1a8(0x0c)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x1b8(0x30)
	struct Fvector3 ; // 0x1e8(0x18)
	struct Uposition_component* ; // 0x200(0x08)
	struct FDelegate ; // 0x208(0x0c)
	struct Ftuple_L_R ; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	OptionProperty ; // 0x218(0x09)
	enum class EVerseTrue ; // 0x221(0x01)
	char pad_222[0x2]; // 0x222(0x02)
	struct FDelegate ; // 0x224(0x0c)
	VerseStringProperty ; // 0x230(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x240(0x10)
	struct FDelegate ; // 0x250(0x0c)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x260(0x10)
	struct TArray<VerseStringProperty> ; // 0x270(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x280(0x20)
	VerseStringProperty ; // 0x2a0(0x10)
	VerseStringProperty ; // 0x2b0(0x10)
	struct FDelegate ; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	VerseStringProperty ; // 0x2d0(0x10)
	VerseStringProperty ; // 0x2e0(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2f0(0x10)
	int64_t ; // 0x300(0x08)
	int64_t ; // 0x308(0x08)
	VerseStringProperty ; // 0x310(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x320(0x10)
	VerseStringProperty ; // 0x330(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x340(0x10)
	int64_t ; // 0x350(0x08)
	int64_t ; // 0x358(0x08)
	char ; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)
	VerseDynamicProperty ; // 0x368(0x10)
	VerseStringProperty ; // 0x378(0x10)
	int64_t ; // 0x388(0x08)
	int64_t ; // 0x390(0x08)
	VerseDynamicProperty ; // 0x398(0x10)
	char ; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)
	struct Utask(:type)* ; // 0x3b0(0x08)
	struct FDelegate ; // 0x3b8(0x0c)
	char pad_3C4[0x4]; // 0x3c4(0x04)
	int64_t ; // 0x3c8(0x08)

	int64_t Update(); // Function VerseNPC.task_companion_ai$WaitForEntityMovement_L_Nentity_M_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_npc_component$AttackThreat_L_Nthreat__info_R
// Size: 0x161 (Inherited: 0x120)
struct Utask_npc_component$AttackThreat_L_Nthreat__info_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Fthreat_info __verse_0xB2CDDD72_Argument; // 0x128(0x38)
	enum class action_result _RetVal; // 0x160(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$AttackThreat_L_Nthreat__info_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb0e8
};

// VerseClass VerseNPC.task_npc_component$Crouch
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$Crouch : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$Crouch.Update // (Native|Public|HasOutParms) // @ game+0x6beb0f0
};

// VerseClass VerseNPC.task_npc_component$DestroyObstacle_L_Nentity_R
// Size: 0x131 (Inherited: 0x120)
struct Utask_npc_component$DestroyObstacle_L_Nentity_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct UEntity* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class action_result _RetVal; // 0x130(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$DestroyObstacle_L_Nentity_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb0f8
};

// VerseClass VerseNPC.task_npc_component$Jump
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$Jump : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$Jump.Update // (Native|Public|HasOutParms) // @ game+0x6beb108
};

// VerseClass VerseNPC.task_npc_component$LookAt_L_Nvector3_R
// Size: 0x140 (Inherited: 0x120)
struct Utask_npc_component$LookAt_L_Nvector3_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Fvector3 __verse_0xB2CDDD72_Argument; // 0x128(0x18)

	int64_t Update(); // Function VerseNPC.task_npc_component$LookAt_L_Nvector3_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb110
};

// VerseClass VerseNPC.task_npc_component$LootObject_L_Nloot__info_R
// Size: 0x151 (Inherited: 0x120)
struct Utask_npc_component$LootObject_L_Nloot__info_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Floot_info __verse_0xB2CDDD72_Argument; // 0x128(0x28)
	enum class action_result _RetVal; // 0x150(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$LootObject_L_Nloot__info_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb118
};

// VerseClass VerseNPC.task_npc_component$MoveInRangeToAttack
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$MoveInRangeToAttack : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$MoveInRangeToAttack.Update // (Native|Public|HasOutParms) // @ game+0x6beb120
};

// VerseClass VerseNPC.task_npc_component$NavigateTo_L_Nentity_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R
// Size: 0x149 (Inherited: 0x120)
struct Utask_npc_component$NavigateTo_L_Nentity_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_Lentity_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x128(0x20)
	enum class navigate_result _RetVal; // 0x148(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$NavigateTo_L_Nentity_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb128
};

// VerseClass VerseNPC.task_npc_component$NavigateTo_L_Nvector3_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R
// Size: 0x159 (Inherited: 0x120)
struct Utask_npc_component$NavigateTo_L_Nvector3_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x128(0x30)
	enum class navigate_result _RetVal; // 0x158(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$NavigateTo_L_Nvector3_M_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb130
};

// VerseClass VerseNPC.task_npc_component$OnBestObjectToLoot
// Size: 0x159 (Inherited: 0x120)
struct Utask_npc_component$OnBestObjectToLoot : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	OptionProperty _RetVal; // 0x130(0x29)

	int64_t Update(); // Function VerseNPC.task_npc_component$OnBestObjectToLoot.Update // (Native|Public|HasOutParms) // @ game+0x6beb138
};

// VerseClass VerseNPC.task_npc_component$OnBestThreatChanged
// Size: 0x169 (Inherited: 0x120)
struct Utask_npc_component$OnBestThreatChanged : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	OptionProperty _RetVal; // 0x130(0x39)

	int64_t Update(); // Function VerseNPC.task_npc_component$OnBestThreatChanged.Update // (Native|Public|HasOutParms) // @ game+0x6beb140
};

// VerseClass VerseNPC.task_npc_component$OnDamaged
// Size: 0x170 (Inherited: 0x120)
struct Utask_npc_component$OnDamaged : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct Fdamage_info _RetVal; // 0x130(0x40)

	int64_t Update(); // Function VerseNPC.task_npc_component$OnDamaged.Update // (Native|Public|HasOutParms) // @ game+0x6beb148
};

// VerseClass VerseNPC.task_npc_component$OnNPCCommand
// Size: 0x169 (Inherited: 0x120)
struct Utask_npc_component$OnNPCCommand : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	OptionProperty _RetVal; // 0x130(0x39)

	int64_t Update(); // Function VerseNPC.task_npc_component$OnNPCCommand.Update // (Native|Public|HasOutParms) // @ game+0x6beb150
};

// VerseClass VerseNPC.task_npc_component$OnObstacleChanged
// Size: 0x159 (Inherited: 0x120)
struct Utask_npc_component$OnObstacleChanged : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	OptionProperty _RetVal; // 0x130(0x29)

	int64_t Update(); // Function VerseNPC.task_npc_component$OnObstacleChanged.Update // (Native|Public|HasOutParms) // @ game+0x6beb158
};

// VerseClass VerseNPC.task_npc_component$OnThreatPerceptionChanged_L_Nthreat__info_R
// Size: 0x199 (Inherited: 0x120)
struct Utask_npc_component$OnThreatPerceptionChanged_L_Nthreat__info_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Fthreat_info __verse_0xB2CDDD72_Argument; // 0x128(0x38)
	OptionProperty _RetVal; // 0x160(0x39)

	int64_t Update(); // Function VerseNPC.task_npc_component$OnThreatPerceptionChanged_L_Nthreat__info_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb160
};

// VerseClass VerseNPC.task_npc_component$PatrolAround_L_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R
// Size: 0x13a (Inherited: 0x120)
struct Utask_npc_component$PatrolAround_L_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	OptionProperty __verse_0xB2CDDD72_Argument; // 0x128(0x11)
	enum class navigate_result _RetVal; // 0x139(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$PatrolAround_L_N_L_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb168
};

// VerseClass VerseNPC.task_npc_component$PlayEmote
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$PlayEmote : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$PlayEmote.Update // (Native|Public|HasOutParms) // @ game+0x6beb170
};

// VerseClass VerseNPC.task_npc_component$Revive_L_Nentity_R
// Size: 0x131 (Inherited: 0x120)
struct Utask_npc_component$Revive_L_Nentity_R : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct UEntity* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class action_result _RetVal; // 0x130(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$Revive_L_Nentity_R.Update // (Native|Public|HasOutParms) // @ game+0x6beb178
};

// VerseClass VerseNPC.task_npc_component$RunDefaultBehavior
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$RunDefaultBehavior : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$RunDefaultBehavior.Update // (Native|Public|HasOutParms) // @ game+0x6beb180
};

// VerseClass VerseNPC.task_npc_component$Slide
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$Slide : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$Slide.Update // (Native|Public|HasOutParms) // @ game+0x6beb188
};

// VerseClass VerseNPC.task_npc_component$Sprint
// Size: 0x129 (Inherited: 0x120)
struct Utask_npc_component$Sprint : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$Sprint.Update // (Native|Public|HasOutParms) // @ game+0x6beb190
};

// VerseClass VerseNPC.task_npc_component$TacticalSprint
// Size: 0x129 (Inherited: 0x120)
struct Utask_npc_component$TacticalSprint : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$TacticalSprint.Update // (Native|Public|HasOutParms) // @ game+0x6beb198
};

// VerseClass VerseNPC.task_npc_component$Walk
// Size: 0x12a (Inherited: 0x120)
struct Utask_npc_component$Walk : Utask(:type) {
	struct Unpc_component* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class action_result _RetVal; // 0x129(0x01)

	int64_t Update(); // Function VerseNPC.task_npc_component$Walk.Update // (Native|Public|HasOutParms) // @ game+0x6beb1a0
};

// VerseClass VerseNPC.task_script_npc_test$AttackThreat_L_Nnpc__component_M_Nthreat__info_R
// Size: 0x220 (Inherited: 0x120)
struct Utask_script_npc_test$AttackThreat_L_Nnpc__component_M_Nthreat__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	int64_t ; // 0x188(0x08)
	struct Unpc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	int64_t ; // 0x1b0(0x08)
	struct Unpc_component* ; // 0x1b8(0x08)
	struct Utask(:type)* ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	struct Ftuple_L_R ; // 0x1d4(0x01)
	char pad_1D5[0x3]; // 0x1d5(0x03)
	int64_t ; // 0x1d8(0x08)
	enum class EVerseTrue ; // 0x1e0(0x01)
	char pad_1E1[0x3]; // 0x1e1(0x03)
	struct FDelegate ; // 0x1e4(0x0c)
	VerseStringProperty ; // 0x1f0(0x10)
	enum class EVerseTrue ; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	struct FDelegate ; // 0x204(0x0c)
	VerseStringProperty ; // 0x210(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$AttackThreat_L_Nnpc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$FriendlyFollow_L_Nfloat_R
// Size: 0x5f0 (Inherited: 0x120)
struct Utask_script_npc_test$FriendlyFollow_L_Nfloat_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	double __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	struct Unpc_component* ; // 0x150(0x08)
	OptionProperty ; // 0x158(0x08)
	OptionProperty ; // 0x160(0x39)
	char pad_199[0x7]; // 0x199(0x07)
	struct Unpc_component* ; // 0x1a0(0x08)
	struct Utask(:type)* ; // 0x1a8(0x08)
	struct FDelegate ; // 0x1b0(0x0c)
	struct Ftuple_L_R ; // 0x1bc(0x01)
	char pad_1BD[0x3]; // 0x1bd(0x03)
	int64_t ; // 0x1c0(0x08)
	struct Fthreat_info ; // 0x1c8(0x38)
	OptionProperty ; // 0x200(0x39)
	char pad_239[0x7]; // 0x239(0x07)
	struct Unpc_component* ; // 0x240(0x08)
	enum class EVerseTrue ; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	struct FDelegate ; // 0x24c(0x0c)
	enum class navigate_result ; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)
	struct Unpc_component* ; // 0x260(0x08)
	struct FDelegate ; // 0x268(0x0c)
	char pad_274[0x4]; // 0x274(0x04)
	struct Ftuple_Lentity_M_QNavigationParameters_Nnavigation__parameters_R ; // 0x278(0x20)
	OptionProperty ; // 0x298(0x11)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct Fnavigation_parameters ; // 0x2b0(0x10)
	enum class EVerseTrue ; // 0x2c0(0x01)
	char pad_2C1[0x3]; // 0x2c1(0x03)
	struct FDelegate ; // 0x2c4(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x2d0(0x18)
	VerseStringProperty ; // 0x2e8(0x10)
	enum class EVerseTrue ; // 0x2f8(0x01)
	char pad_2F9[0x3]; // 0x2f9(0x03)
	struct FDelegate ; // 0x2fc(0x0c)
	VerseStringProperty ; // 0x308(0x10)
	struct Unpc_component* ; // 0x318(0x08)
	struct FDelegate ; // 0x320(0x0c)
	char pad_32C[0x4]; // 0x32c(0x04)
	OptionProperty ; // 0x330(0x19)
	char pad_349[0x3]; // 0x349(0x03)
	struct FDelegate ; // 0x34c(0x0c)
	struct Uposition_component* ; // 0x358(0x08)
	OptionProperty ; // 0x360(0x08)
	struct Fvector3 ; // 0x368(0x18)
	OptionProperty ; // 0x380(0x19)
	char pad_399[0x7]; // 0x399(0x07)
	double ; // 0x3a0(0x08)
	struct FDelegate ; // 0x3a8(0x0c)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x3b8(0x30)
	struct Fvector3 ; // 0x3e8(0x18)
	struct Uposition_component* ; // 0x400(0x08)
	struct FDelegate ; // 0x408(0x0c)
	struct Ftuple_L_R ; // 0x414(0x01)
	enum class EVerseTrue ; // 0x415(0x01)
	char pad_416[0x2]; // 0x416(0x02)
	struct FDelegate ; // 0x418(0x0c)
	char pad_424[0x4]; // 0x424(0x04)
	VerseStringProperty ; // 0x428(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x438(0x10)
	struct FDelegate ; // 0x448(0x0c)
	char pad_454[0x4]; // 0x454(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x458(0x10)
	struct TArray<VerseStringProperty> ; // 0x468(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x478(0x20)
	VerseStringProperty ; // 0x498(0x10)
	VerseStringProperty ; // 0x4a8(0x10)
	struct FDelegate ; // 0x4b8(0x0c)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	VerseStringProperty ; // 0x4c8(0x10)
	VerseStringProperty ; // 0x4d8(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x4e8(0x10)
	int64_t ; // 0x4f8(0x08)
	int64_t ; // 0x500(0x08)
	VerseStringProperty ; // 0x508(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x518(0x10)
	VerseStringProperty ; // 0x528(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x538(0x10)
	int64_t ; // 0x548(0x08)
	int64_t ; // 0x550(0x08)
	char ; // 0x558(0x01)
	char pad_559[0x7]; // 0x559(0x07)
	VerseDynamicProperty ; // 0x560(0x10)
	VerseStringProperty ; // 0x570(0x10)
	int64_t ; // 0x580(0x08)
	int64_t ; // 0x588(0x08)
	VerseDynamicProperty ; // 0x590(0x10)
	char ; // 0x5a0(0x01)
	char pad_5A1[0x7]; // 0x5a1(0x07)
	OptionProperty ; // 0x5a8(0x09)
	enum class EVerseTrue ; // 0x5b1(0x01)
	char pad_5B2[0x2]; // 0x5b2(0x02)
	struct FDelegate ; // 0x5b4(0x0c)
	VerseStringProperty ; // 0x5c0(0x10)
	enum class EVerseTrue ; // 0x5d0(0x01)
	char pad_5D1[0x3]; // 0x5d1(0x03)
	struct FDelegate ; // 0x5d4(0x0c)
	VerseStringProperty ; // 0x5e0(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$FriendlyFollow_L_Nfloat_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$GameLoop
// Size: 0x898 (Inherited: 0x120)
struct Utask_script_npc_test$GameLoop : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct Unpc_component* ; // 0x130(0x08)
	OptionProperty ; // 0x138(0x08)
	enum class EVerseTrue ; // 0x140(0x01)
	char pad_141[0x3]; // 0x141(0x03)
	struct FDelegate ; // 0x144(0x0c)
	VerseStringProperty ; // 0x150(0x10)
	enum class EVerseTrue ; // 0x160(0x01)
	char pad_161[0x3]; // 0x161(0x03)
	struct FDelegate ; // 0x164(0x0c)
	VerseStringProperty ; // 0x170(0x10)
	struct Fthreat_info ; // 0x180(0x38)
	OptionProperty ; // 0x1b8(0x39)
	char pad_1F1[0x7]; // 0x1f1(0x07)
	int64_t ; // 0x1f8(0x08)
	OptionProperty ; // 0x200(0x39)
	char pad_239[0x7]; // 0x239(0x07)
	struct Utask(:type)* ; // 0x240(0x08)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	int64_t ; // 0x258(0x08)
	OptionProperty ; // 0x260(0x39)
	char pad_299[0x7]; // 0x299(0x07)
	struct Utask(:type)* ; // 0x2a0(0x08)
	struct FDelegate ; // 0x2a8(0x0c)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x2b8(0x40)
	int64_t ; // 0x2f8(0x08)
	struct Utask(:type)* ; // 0x300(0x08)
	struct FDelegate ; // 0x308(0x0c)
	char pad_314[0x4]; // 0x314(0x04)
	int64_t ; // 0x318(0x08)
	struct Utask(:type)* ; // 0x320(0x08)
	struct FDelegate ; // 0x328(0x0c)
	char pad_334[0x4]; // 0x334(0x04)
	int64_t ; // 0x338(0x08)
	struct Utask(:type)* ; // 0x340(0x08)
	struct FDelegate ; // 0x348(0x0c)
	char pad_354[0x4]; // 0x354(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x358(0x40)
	int64_t ; // 0x398(0x08)
	struct Fping_info ; // 0x3a0(0x38)
	OptionProperty ; // 0x3d8(0x39)
	char pad_411[0x7]; // 0x411(0x07)
	OptionProperty ; // 0x418(0x39)
	char pad_451[0x7]; // 0x451(0x07)
	struct Utask(:type)* ; // 0x458(0x08)
	struct FDelegate ; // 0x460(0x0c)
	char pad_46C[0x4]; // 0x46c(0x04)
	int64_t ; // 0x470(0x08)
	OptionProperty ; // 0x478(0x39)
	char pad_4B1[0x7]; // 0x4b1(0x07)
	struct Utask(:type)* ; // 0x4b8(0x08)
	struct FDelegate ; // 0x4c0(0x0c)
	char pad_4CC[0x4]; // 0x4cc(0x04)
	int64_t ; // 0x4d0(0x08)
	struct Utask(:type)* ; // 0x4d8(0x08)
	struct FDelegate ; // 0x4e0(0x0c)
	char pad_4EC[0x4]; // 0x4ec(0x04)
	int64_t ; // 0x4f0(0x08)
	struct Utask(:type)* ; // 0x4f8(0x08)
	struct FDelegate ; // 0x500(0x0c)
	char pad_50C[0x4]; // 0x50c(0x04)
	struct Ftuple_Lnpc__component_Mping__info_R ; // 0x510(0x40)
	int64_t ; // 0x550(0x08)
	struct Floot_info ; // 0x558(0x28)
	OptionProperty ; // 0x580(0x29)
	char pad_5A9[0x7]; // 0x5a9(0x07)
	OptionProperty ; // 0x5b0(0x39)
	char pad_5E9[0x7]; // 0x5e9(0x07)
	struct Utask(:type)* ; // 0x5f0(0x08)
	struct FDelegate ; // 0x5f8(0x0c)
	char pad_604[0x4]; // 0x604(0x04)
	int64_t ; // 0x608(0x08)
	OptionProperty ; // 0x610(0x39)
	char pad_649[0x7]; // 0x649(0x07)
	struct Utask(:type)* ; // 0x650(0x08)
	struct FDelegate ; // 0x658(0x0c)
	char pad_664[0x4]; // 0x664(0x04)
	int64_t ; // 0x668(0x08)
	OptionProperty ; // 0x670(0x29)
	char pad_699[0x7]; // 0x699(0x07)
	struct Utask(:type)* ; // 0x6a0(0x08)
	struct FDelegate ; // 0x6a8(0x0c)
	char pad_6B4[0x4]; // 0x6b4(0x04)
	int64_t ; // 0x6b8(0x08)
	struct Utask(:type)* ; // 0x6c0(0x08)
	struct FDelegate ; // 0x6c8(0x0c)
	char pad_6D4[0x4]; // 0x6d4(0x04)
	struct Ftuple_Lnpc__component_Mloot__info_R ; // 0x6d8(0x30)
	int64_t ; // 0x708(0x08)
	OptionProperty ; // 0x710(0x39)
	char pad_749[0x7]; // 0x749(0x07)
	struct Utask(:type)* ; // 0x750(0x08)
	struct FDelegate ; // 0x758(0x0c)
	char pad_764[0x4]; // 0x764(0x04)
	int64_t ; // 0x768(0x08)
	OptionProperty ; // 0x770(0x39)
	char pad_7A9[0x7]; // 0x7a9(0x07)
	struct Utask(:type)* ; // 0x7b0(0x08)
	struct FDelegate ; // 0x7b8(0x0c)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	int64_t ; // 0x7c8(0x08)
	OptionProperty ; // 0x7d0(0x29)
	char pad_7F9[0x7]; // 0x7f9(0x07)
	struct Utask(:type)* ; // 0x800(0x08)
	struct FDelegate ; // 0x808(0x0c)
	char pad_814[0x4]; // 0x814(0x04)
	int64_t ; // 0x818(0x08)
	struct Utask(:type)* ; // 0x820(0x08)
	struct FDelegate ; // 0x828(0x0c)
	struct Ftuple_L_R ; // 0x834(0x01)
	char pad_835[0x3]; // 0x835(0x03)
	int64_t ; // 0x838(0x08)
	enum class EVerseTrue ; // 0x840(0x01)
	char pad_841[0x3]; // 0x841(0x03)
	struct FDelegate ; // 0x844(0x0c)
	VerseStringProperty ; // 0x850(0x10)
	struct FVerseIntRange ; // 0x860(0x10)
	int64_t ; // 0x870(0x08)
	struct Utask(:type)* ; // 0x878(0x08)
	struct FDelegate ; // 0x880(0x0c)
	struct Ftuple_L_R ; // 0x88c(0x01)
	char pad_88D[0x3]; // 0x88d(0x03)
	int64_t ; // 0x890(0x08)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$GameLoop.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$HandleHideCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x270 (Inherited: 0x120)
struct Utask_script_npc_test$HandleHideCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	enum class navigate_result ; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
	struct Unpc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x1b0(0x30)
	OptionProperty ; // 0x1e0(0x11)
	char pad_1F1[0x7]; // 0x1f1(0x07)
	int64_t ; // 0x1f8(0x08)
	struct Unpc_component* ; // 0x200(0x08)
	struct FDelegate ; // 0x208(0x0c)
	struct Ftuple_L_R ; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	OptionProperty ; // 0x218(0x39)
	enum class EVerseTrue ; // 0x251(0x01)
	char pad_252[0x2]; // 0x252(0x02)
	struct FDelegate ; // 0x254(0x0c)
	VerseStringProperty ; // 0x260(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$HandleHideCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$HandleLoot_L_Nnpc__component_M_Nloot__info_R
// Size: 0x228 (Inherited: 0x120)
struct Utask_script_npc_test$HandleLoot_L_Nnpc__component_M_Nloot__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mloot__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x30)
	enum class EVerseTrue ; // 0x158(0x01)
	char pad_159[0x3]; // 0x159(0x03)
	struct FDelegate ; // 0x15c(0x0c)
	VerseStringProperty ; // 0x168(0x10)
	enum class action_result ; // 0x178(0x01)
	char pad_179[0x7]; // 0x179(0x07)
	struct Unpc_component* ; // 0x180(0x08)
	struct Utask(:type)* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	int64_t ; // 0x1a0(0x08)
	enum class EVerseTrue ; // 0x1a8(0x01)
	char pad_1A9[0x3]; // 0x1a9(0x03)
	struct FDelegate ; // 0x1ac(0x0c)
	struct Ftuple_L_Kchar_Maction__result_R ; // 0x1b8(0x18)
	VerseStringProperty ; // 0x1d0(0x10)
	OptionProperty ; // 0x1e0(0x29)
	enum class EVerseTrue ; // 0x209(0x01)
	char pad_20A[0x2]; // 0x20a(0x02)
	struct FDelegate ; // 0x20c(0x0c)
	VerseStringProperty ; // 0x218(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$HandleLoot_L_Nnpc__component_M_Nloot__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$HandlePingCommand_L_Nnpc__component_M_Nping__info_R
// Size: 0x280 (Inherited: 0x120)
struct Utask_script_npc_test$HandlePingCommand_L_Nnpc__component_M_Nping__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mping__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	enum class navigate_result ; // 0x178(0x01)
	char pad_179[0x7]; // 0x179(0x07)
	struct Unpc_component* ; // 0x180(0x08)
	struct Utask(:type)* ; // 0x188(0x08)
	struct FDelegate ; // 0x190(0x0c)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x1a0(0x30)
	OptionProperty ; // 0x1d0(0x11)
	char pad_1E1[0x7]; // 0x1e1(0x07)
	int64_t ; // 0x1e8(0x08)
	enum class EVerseTrue ; // 0x1f0(0x01)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	struct FDelegate ; // 0x1f4(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x200(0x18)
	VerseStringProperty ; // 0x218(0x10)
	OptionProperty ; // 0x228(0x39)
	enum class EVerseTrue ; // 0x261(0x01)
	char pad_262[0x2]; // 0x262(0x02)
	struct FDelegate ; // 0x264(0x0c)
	VerseStringProperty ; // 0x270(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$HandlePingCommand_L_Nnpc__component_M_Nping__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$HandleThreat_L_Nnpc__component_M_Nthreat__info_R
// Size: 0x390 (Inherited: 0x120)
struct Utask_script_npc_test$HandleThreat_L_Nnpc__component_M_Nthreat__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	VerseDynamicProperty ; // 0x188(0x10)
	OptionProperty ; // 0x198(0x11)
	char pad_1A9[0x7]; // 0x1a9(0x07)
	VerseDynamicProperty ; // 0x1b0(0x10)
	VerseDynamicProperty ; // 0x1c0(0x10)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	char pad_1E4[0x4]; // 0x1e4(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x1e8(0x40)
	int64_t ; // 0x228(0x08)
	VerseDynamicProperty ; // 0x230(0x10)
	OptionProperty ; // 0x240(0x11)
	char pad_251[0x7]; // 0x251(0x07)
	VerseDynamicProperty ; // 0x258(0x10)
	VerseDynamicProperty ; // 0x268(0x10)
	struct FDelegate ; // 0x278(0x0c)
	char pad_284[0x4]; // 0x284(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x288(0x40)
	struct FDelegate ; // 0x2c8(0x0c)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct Ftuple_Lnpc__component_Mthreat__info_R ; // 0x2d8(0x40)
	enum class EVerseTrue ; // 0x318(0x01)
	char pad_319[0x3]; // 0x319(0x03)
	struct FDelegate ; // 0x31c(0x0c)
	VerseStringProperty ; // 0x328(0x10)
	OptionProperty ; // 0x338(0x39)
	enum class EVerseTrue ; // 0x371(0x01)
	char pad_372[0x2]; // 0x372(0x02)
	struct FDelegate ; // 0x374(0x0c)
	VerseStringProperty ; // 0x380(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$HandleThreat_L_Nnpc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$InvestigateThreat_L_Nnpc__component_M_Nthreat__info_R
// Size: 0x570 (Inherited: 0x120)
struct Utask_script_npc_test$InvestigateThreat_L_Nnpc__component_M_Nthreat__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	enum class EVerseTrue ; // 0x188(0x01)
	char pad_189[0x3]; // 0x189(0x03)
	struct FDelegate ; // 0x18c(0x0c)
	VerseStringProperty ; // 0x198(0x10)
	int64_t ; // 0x1a8(0x08)
	struct Unpc_component* ; // 0x1b0(0x08)
	struct Utask(:type)* ; // 0x1b8(0x08)
	struct FDelegate ; // 0x1c0(0x0c)
	char pad_1CC[0x4]; // 0x1cc(0x04)
	int64_t ; // 0x1d0(0x08)
	struct Unpc_component* ; // 0x1d8(0x08)
	struct Utask(:type)* ; // 0x1e0(0x08)
	struct FDelegate ; // 0x1e8(0x0c)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x1f8(0x30)
	OptionProperty ; // 0x228(0x11)
	char pad_239[0x7]; // 0x239(0x07)
	int64_t ; // 0x240(0x08)
	struct FVerseIntRange ; // 0x248(0x10)
	int64_t ; // 0x258(0x08)
	enum class EVerseTrue ; // 0x260(0x01)
	char pad_261[0x3]; // 0x261(0x03)
	struct FDelegate ; // 0x264(0x0c)
	VerseStringProperty ; // 0x270(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x280(0x10)
	struct FDelegate ; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x2a0(0x10)
	struct TArray<VerseStringProperty> ; // 0x2b0(0x10)
	struct Ftuple_L_Kchar_M_Kchar_R ; // 0x2c0(0x20)
	VerseStringProperty ; // 0x2e0(0x10)
	VerseStringProperty ; // 0x2f0(0x10)
	struct FDelegate ; // 0x300(0x0c)
	char pad_30C[0x4]; // 0x30c(0x04)
	VerseStringProperty ; // 0x310(0x10)
	VerseStringProperty ; // 0x320(0x10)
	struct TArray<struct TArray<VerseDynamicProperty>> ; // 0x330(0x10)
	int64_t ; // 0x340(0x08)
	int64_t ; // 0x348(0x08)
	VerseStringProperty ; // 0x350(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x360(0x10)
	VerseStringProperty ; // 0x370(0x10)
	struct TArray<VerseDynamicProperty> ; // 0x380(0x10)
	int64_t ; // 0x390(0x08)
	int64_t ; // 0x398(0x08)
	char ; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	VerseDynamicProperty ; // 0x3a8(0x10)
	VerseStringProperty ; // 0x3b8(0x10)
	int64_t ; // 0x3c8(0x08)
	int64_t ; // 0x3d0(0x08)
	VerseDynamicProperty ; // 0x3d8(0x10)
	char ; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct Fvector3 ; // 0x3f0(0x18)
	double ; // 0x408(0x08)
	struct FDelegate ; // 0x410(0x0c)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x420(0x10)
	double ; // 0x430(0x08)
	struct FDelegate ; // 0x438(0x0c)
	char pad_444[0x4]; // 0x444(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x448(0x10)
	double ; // 0x458(0x08)
	struct FDelegate ; // 0x460(0x0c)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x470(0x10)
	double ; // 0x480(0x08)
	struct FDelegate ; // 0x488(0x0c)
	char pad_494[0x4]; // 0x494(0x04)
	struct Ftuple_Lfloat_Mfloat_R ; // 0x498(0x10)
	struct Unpc_component* ; // 0x4a8(0x08)
	struct Utask(:type)* ; // 0x4b0(0x08)
	struct FDelegate ; // 0x4b8(0x0c)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct Fvector3 ; // 0x4c8(0x18)
	struct FDelegate ; // 0x4e0(0x0c)
	char pad_4EC[0x4]; // 0x4ec(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x4f0(0x30)
	int64_t ; // 0x520(0x08)
	struct Unpc_component* ; // 0x528(0x08)
	struct Utask(:type)* ; // 0x530(0x08)
	struct FDelegate ; // 0x538(0x0c)
	char pad_544[0x4]; // 0x544(0x04)
	int64_t ; // 0x548(0x08)
	enum class EVerseTrue ; // 0x550(0x01)
	char pad_551[0x3]; // 0x551(0x03)
	struct FDelegate ; // 0x554(0x0c)
	VerseStringProperty ; // 0x560(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$InvestigateThreat_L_Nnpc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$LookAtThreat_L_Nnpc__component_M_Nthreat__info_R
// Size: 0x200 (Inherited: 0x120)
struct Utask_script_npc_test$LookAtThreat_L_Nnpc__component_M_Nthreat__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	enum class EVerseTrue ; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	int64_t ; // 0x188(0x08)
	struct Unpc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	int64_t ; // 0x1b0(0x08)
	struct Unpc_component* ; // 0x1b8(0x08)
	struct Utask(:type)* ; // 0x1c0(0x08)
	struct FDelegate ; // 0x1c8(0x0c)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	int64_t ; // 0x1d8(0x08)
	enum class EVerseTrue ; // 0x1e0(0x01)
	char pad_1E1[0x3]; // 0x1e1(0x03)
	struct FDelegate ; // 0x1e4(0x0c)
	VerseStringProperty ; // 0x1f0(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$LookAtThreat_L_Nnpc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$MonitorNewLoot_L_Nnpc__component_R
// Size: 0x1a0 (Inherited: 0x120)
struct Utask_script_npc_test$MonitorNewLoot_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	OptionProperty ; // 0x150(0x29)
	char pad_179[0x7]; // 0x179(0x07)
	struct Utask(:type)* ; // 0x180(0x08)
	struct FDelegate ; // 0x188(0x0c)
	char pad_194[0x4]; // 0x194(0x04)
	int64_t ; // 0x198(0x08)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$MonitorNewLoot_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$MonitorNewPingcommand_L_Nnpc__component_R
// Size: 0x190 (Inherited: 0x120)
struct Utask_script_npc_test$MonitorNewPingcommand_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty ; // 0x130(0x39)
	char pad_169[0x7]; // 0x169(0x07)
	struct Utask(:type)* ; // 0x170(0x08)
	struct FDelegate ; // 0x178(0x0c)
	char pad_184[0x4]; // 0x184(0x04)
	int64_t ; // 0x188(0x08)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$MonitorNewPingcommand_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$MonitorNewThreat_L_Nnpc__component_R
// Size: 0x1b0 (Inherited: 0x120)
struct Utask_script_npc_test$MonitorNewThreat_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	enum class EVerseTrue ; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	struct FDelegate ; // 0x134(0x0c)
	VerseStringProperty ; // 0x140(0x10)
	OptionProperty ; // 0x150(0x39)
	char pad_189[0x7]; // 0x189(0x07)
	struct Utask(:type)* ; // 0x190(0x08)
	struct FDelegate ; // 0x198(0x0c)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	int64_t ; // 0x1a8(0x08)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$MonitorNewThreat_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$OnDamagedBy_L_Nnpc__component_R
// Size: 0x1d8 (Inherited: 0x120)
struct Utask_script_npc_test$OnDamagedBy_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	struct Fdamage_info _RetVal; // 0x130(0x40)
	enum class EVerseTrue ; // 0x170(0x01)
	char pad_171[0x3]; // 0x171(0x03)
	struct FDelegate ; // 0x174(0x0c)
	VerseStringProperty ; // 0x180(0x10)
	struct Unpc_component* ; // 0x190(0x08)
	struct Utask(:type)* ; // 0x198(0x08)
	struct FDelegate ; // 0x1a0(0x0c)
	struct Ftuple_L_R ; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	int64_t ; // 0x1b0(0x08)
	enum class EVerseTrue ; // 0x1b8(0x01)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	struct FDelegate ; // 0x1bc(0x0c)
	VerseStringProperty ; // 0x1c8(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$OnDamagedBy_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$OnNewLoot_L_Nnpc__component_R
// Size: 0x260 (Inherited: 0x120)
struct Utask_script_npc_test$OnNewLoot_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x29)
	enum class EVerseTrue ; // 0x159(0x01)
	char pad_15A[0x2]; // 0x15a(0x02)
	struct FDelegate ; // 0x15c(0x0c)
	VerseStringProperty ; // 0x168(0x10)
	OptionProperty ; // 0x178(0x29)
	char pad_1A1[0x7]; // 0x1a1(0x07)
	struct Unpc_component* ; // 0x1a8(0x08)
	struct Utask(:type)* ; // 0x1b0(0x08)
	struct FDelegate ; // 0x1b8(0x0c)
	struct Ftuple_L_R ; // 0x1c4(0x01)
	char pad_1C5[0x3]; // 0x1c5(0x03)
	int64_t ; // 0x1c8(0x08)
	struct Floot_info ; // 0x1d0(0x28)
	OptionProperty ; // 0x1f8(0x29)
	enum class EVerseTrue ; // 0x221(0x01)
	char pad_222[0x2]; // 0x222(0x02)
	struct FDelegate ; // 0x224(0x0c)
	VerseStringProperty ; // 0x230(0x10)
	enum class EVerseTrue ; // 0x240(0x01)
	char pad_241[0x3]; // 0x241(0x03)
	struct FDelegate ; // 0x244(0x0c)
	VerseStringProperty ; // 0x250(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$OnNewLoot_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$OnNewPingCommand_L_Nnpc__component_R
// Size: 0x339 (Inherited: 0x120)
struct Utask_script_npc_test$OnNewPingCommand_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x39)
	enum class EVerseTrue ; // 0x169(0x01)
	char pad_16A[0x2]; // 0x16a(0x02)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	OptionProperty ; // 0x188(0x39)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	struct Unpc_component* ; // 0x1c8(0x08)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	struct Ftuple_L_R ; // 0x1e4(0x01)
	char pad_1E5[0x3]; // 0x1e5(0x03)
	int64_t ; // 0x1e8(0x08)
	struct Fping_info ; // 0x1f0(0x38)
	OptionProperty ; // 0x228(0x39)
	char pad_261[0x7]; // 0x261(0x07)
	VerseDynamicProperty ; // 0x268(0x10)
	OptionProperty ; // 0x278(0x11)
	char pad_289[0x7]; // 0x289(0x07)
	VerseDynamicProperty ; // 0x290(0x10)
	VerseDynamicProperty ; // 0x2a0(0x10)
	struct Unpc_component* ; // 0x2b0(0x08)
	enum class EVerseTrue ; // 0x2b8(0x01)
	char pad_2B9[0x3]; // 0x2b9(0x03)
	struct FDelegate ; // 0x2bc(0x0c)
	struct Ftuple_Lvector3_Mfloat_R ; // 0x2c8(0x20)
	struct Unpc_component* ; // 0x2e8(0x08)
	enum class EVerseTrue ; // 0x2f0(0x01)
	char pad_2F1[0x3]; // 0x2f1(0x03)
	struct FDelegate ; // 0x2f4(0x0c)
	struct Ftuple_L_R ; // 0x300(0x01)
	enum class EVerseTrue ; // 0x301(0x01)
	char pad_302[0x2]; // 0x302(0x02)
	struct FDelegate ; // 0x304(0x0c)
	VerseStringProperty ; // 0x310(0x10)
	struct Unpc_component* ; // 0x320(0x08)
	enum class EVerseTrue ; // 0x328(0x01)
	char pad_329[0x3]; // 0x329(0x03)
	struct FDelegate ; // 0x32c(0x0c)
	struct Ftuple_L_R ; // 0x338(0x01)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$OnNewPingCommand_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$OnNewTargetPerception_L_Nnpc__component_M_Nthreat__info_R
// Size: 0x328 (Inherited: 0x120)
struct Utask_script_npc_test$OnNewTargetPerception_L_Nnpc__component_M_Nthreat__info_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_Lnpc__component_Mthreat__info_R __verse_0xB2CDDD72_Argument; // 0x128(0x40)
	OptionProperty _RetVal; // 0x168(0x39)
	enum class EVerseTrue ; // 0x1a1(0x01)
	char pad_1A2[0x2]; // 0x1a2(0x02)
	struct FDelegate ; // 0x1a4(0x0c)
	VerseStringProperty ; // 0x1b0(0x10)
	OptionProperty ; // 0x1c0(0x39)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	struct Unpc_component* ; // 0x200(0x08)
	struct Utask(:type)* ; // 0x208(0x08)
	struct FDelegate ; // 0x210(0x0c)
	char pad_21C[0x4]; // 0x21c(0x04)
	int64_t ; // 0x220(0x08)
	struct Fthreat_info ; // 0x228(0x38)
	OptionProperty ; // 0x260(0x39)
	char pad_299[0x7]; // 0x299(0x07)
	VerseDynamicProperty ; // 0x2a0(0x10)
	OptionProperty ; // 0x2b0(0x11)
	char pad_2C1[0x7]; // 0x2c1(0x07)
	VerseDynamicProperty ; // 0x2c8(0x10)
	VerseDynamicProperty ; // 0x2d8(0x10)
	enum class EVerseTrue ; // 0x2e8(0x01)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	struct FDelegate ; // 0x2ec(0x0c)
	VerseStringProperty ; // 0x2f8(0x10)
	enum class EVerseTrue ; // 0x308(0x01)
	char pad_309[0x3]; // 0x309(0x03)
	struct FDelegate ; // 0x30c(0x0c)
	VerseStringProperty ; // 0x318(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$OnNewTargetPerception_L_Nnpc__component_M_Nthreat__info_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$OnNewThreat_L_Nnpc__component_R
// Size: 0x2b0 (Inherited: 0x120)
struct Utask_script_npc_test$OnNewThreat_L_Nnpc__component_R : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Unpc_component* __verse_0xB2CDDD72_Argument; // 0x128(0x08)
	OptionProperty _RetVal; // 0x130(0x39)
	enum class EVerseTrue ; // 0x169(0x01)
	char pad_16A[0x2]; // 0x16a(0x02)
	struct FDelegate ; // 0x16c(0x0c)
	VerseStringProperty ; // 0x178(0x10)
	OptionProperty ; // 0x188(0x39)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	struct Unpc_component* ; // 0x1c8(0x08)
	struct Utask(:type)* ; // 0x1d0(0x08)
	struct FDelegate ; // 0x1d8(0x0c)
	struct Ftuple_L_R ; // 0x1e4(0x01)
	char pad_1E5[0x3]; // 0x1e5(0x03)
	int64_t ; // 0x1e8(0x08)
	struct Fthreat_info ; // 0x1f0(0x38)
	OptionProperty ; // 0x228(0x39)
	enum class EVerseTrue ; // 0x261(0x01)
	char pad_262[0x2]; // 0x262(0x02)
	struct FDelegate ; // 0x264(0x0c)
	enum class EVerseTrue ; // 0x270(0x01)
	char pad_271[0x3]; // 0x271(0x03)
	struct FDelegate ; // 0x274(0x0c)
	VerseStringProperty ; // 0x280(0x10)
	enum class EVerseTrue ; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	struct FDelegate ; // 0x294(0x0c)
	VerseStringProperty ; // 0x2a0(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$OnNewThreat_L_Nnpc__component_R.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$PatrolOnSquare
// Size: 0x620 (Inherited: 0x120)
struct Utask_script_npc_test$PatrolOnSquare : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class EVerseTrue ; // 0x129(0x01)
	char pad_12A[0x2]; // 0x12a(0x02)
	struct FDelegate ; // 0x12c(0x0c)
	VerseStringProperty ; // 0x138(0x10)
	struct Uposition_component* ; // 0x148(0x08)
	OptionProperty ; // 0x150(0x08)
	struct Unpc_component* ; // 0x158(0x08)
	OptionProperty ; // 0x160(0x08)
	struct Fvector3 ; // 0x168(0x18)
	struct Uposition_component* ; // 0x180(0x08)
	struct FDelegate ; // 0x188(0x0c)
	struct Ftuple_L_R ; // 0x194(0x01)
	char pad_195[0x3]; // 0x195(0x03)
	struct Fvector3 ; // 0x198(0x18)
	struct FDelegate ; // 0x1b0(0x0c)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x1c0(0x30)
	struct Fvector3 ; // 0x1f0(0x18)
	enum class EVerseTrue ; // 0x208(0x01)
	char pad_209[0x3]; // 0x209(0x03)
	struct FDelegate ; // 0x20c(0x0c)
	VerseStringProperty ; // 0x218(0x10)
	enum class navigate_result ; // 0x228(0x01)
	char pad_229[0x7]; // 0x229(0x07)
	struct Unpc_component* ; // 0x230(0x08)
	struct Utask(:type)* ; // 0x238(0x08)
	struct FDelegate ; // 0x240(0x0c)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x250(0x30)
	OptionProperty ; // 0x280(0x11)
	char pad_291[0x7]; // 0x291(0x07)
	int64_t ; // 0x298(0x08)
	enum class EVerseTrue ; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct FDelegate ; // 0x2a4(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x2b0(0x18)
	VerseStringProperty ; // 0x2c8(0x10)
	struct Fvector3 ; // 0x2d8(0x18)
	struct FDelegate ; // 0x2f0(0x0c)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x300(0x30)
	struct Fvector3 ; // 0x330(0x18)
	enum class EVerseTrue ; // 0x348(0x01)
	char pad_349[0x3]; // 0x349(0x03)
	struct FDelegate ; // 0x34c(0x0c)
	VerseStringProperty ; // 0x358(0x10)
	enum class navigate_result ; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct Unpc_component* ; // 0x370(0x08)
	struct FDelegate ; // 0x378(0x0c)
	char pad_384[0x4]; // 0x384(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x388(0x30)
	OptionProperty ; // 0x3b8(0x11)
	enum class EVerseTrue ; // 0x3c9(0x01)
	char pad_3CA[0x2]; // 0x3ca(0x02)
	struct FDelegate ; // 0x3cc(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x3d8(0x18)
	VerseStringProperty ; // 0x3f0(0x10)
	struct Fvector3 ; // 0x400(0x18)
	struct FDelegate ; // 0x418(0x0c)
	char pad_424[0x4]; // 0x424(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x428(0x30)
	struct Fvector3 ; // 0x458(0x18)
	enum class EVerseTrue ; // 0x470(0x01)
	char pad_471[0x3]; // 0x471(0x03)
	struct FDelegate ; // 0x474(0x0c)
	VerseStringProperty ; // 0x480(0x10)
	enum class navigate_result ; // 0x490(0x01)
	char pad_491[0x7]; // 0x491(0x07)
	struct Unpc_component* ; // 0x498(0x08)
	struct FDelegate ; // 0x4a0(0x0c)
	char pad_4AC[0x4]; // 0x4ac(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x4b0(0x30)
	OptionProperty ; // 0x4e0(0x11)
	enum class EVerseTrue ; // 0x4f1(0x01)
	char pad_4F2[0x2]; // 0x4f2(0x02)
	struct FDelegate ; // 0x4f4(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x500(0x18)
	VerseStringProperty ; // 0x518(0x10)
	enum class EVerseTrue ; // 0x528(0x01)
	char pad_529[0x3]; // 0x529(0x03)
	struct FDelegate ; // 0x52c(0x0c)
	VerseStringProperty ; // 0x538(0x10)
	enum class navigate_result ; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct Unpc_component* ; // 0x550(0x08)
	struct FDelegate ; // 0x558(0x0c)
	char pad_564[0x4]; // 0x564(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x568(0x30)
	OptionProperty ; // 0x598(0x11)
	enum class EVerseTrue ; // 0x5a9(0x01)
	char pad_5AA[0x2]; // 0x5aa(0x02)
	struct FDelegate ; // 0x5ac(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x5b8(0x18)
	VerseStringProperty ; // 0x5d0(0x10)
	enum class EVerseTrue ; // 0x5e0(0x01)
	char pad_5E1[0x3]; // 0x5e1(0x03)
	struct FDelegate ; // 0x5e4(0x0c)
	VerseStringProperty ; // 0x5f0(0x10)
	enum class EVerseTrue ; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	struct FDelegate ; // 0x604(0x0c)
	VerseStringProperty ; // 0x610(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$PatrolOnSquare.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.task_script_npc_test$WanderAround
// Size: 0x7e8 (Inherited: 0x120)
struct Utask_script_npc_test$WanderAround : Utask(:type) {
	struct Uscript_npc_test* _Self; // 0x120(0x08)
	struct Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0x128(0x01)
	enum class EVerseTrue ; // 0x129(0x01)
	char pad_12A[0x2]; // 0x12a(0x02)
	struct FDelegate ; // 0x12c(0x0c)
	VerseStringProperty ; // 0x138(0x10)
	struct Uposition_component* ; // 0x148(0x08)
	OptionProperty ; // 0x150(0x08)
	struct Unpc_component* ; // 0x158(0x08)
	OptionProperty ; // 0x160(0x08)
	struct Fvector3 ; // 0x168(0x18)
	struct Uposition_component* ; // 0x180(0x08)
	struct FDelegate ; // 0x188(0x0c)
	struct Ftuple_L_R ; // 0x194(0x01)
	char pad_195[0x3]; // 0x195(0x03)
	struct Fvector3 ; // 0x198(0x18)
	struct FDelegate ; // 0x1b0(0x0c)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x1c0(0x30)
	struct Fvector3 ; // 0x1f0(0x18)
	int64_t ; // 0x208(0x08)
	enum class EVerseTrue ; // 0x210(0x01)
	char pad_211[0x3]; // 0x211(0x03)
	struct FDelegate ; // 0x214(0x0c)
	VerseStringProperty ; // 0x220(0x10)
	enum class navigate_result ; // 0x230(0x01)
	char pad_231[0x7]; // 0x231(0x07)
	struct Unpc_component* ; // 0x238(0x08)
	struct Utask(:type)* ; // 0x240(0x08)
	struct FDelegate ; // 0x248(0x0c)
	char pad_254[0x4]; // 0x254(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x258(0x30)
	OptionProperty ; // 0x288(0x11)
	char pad_299[0x7]; // 0x299(0x07)
	int64_t ; // 0x2a0(0x08)
	enum class EVerseTrue ; // 0x2a8(0x01)
	char pad_2A9[0x3]; // 0x2a9(0x03)
	struct FDelegate ; // 0x2ac(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x2b8(0x18)
	VerseStringProperty ; // 0x2d0(0x10)
	struct Utask(:type)* ; // 0x2e0(0x08)
	struct FDelegate ; // 0x2e8(0x0c)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	int64_t ; // 0x2f8(0x08)
	enum class EVerseTrue ; // 0x300(0x01)
	char pad_301[0x3]; // 0x301(0x03)
	struct FDelegate ; // 0x304(0x0c)
	VerseStringProperty ; // 0x310(0x10)
	struct Unpc_component* ; // 0x320(0x08)
	struct FDelegate ; // 0x328(0x0c)
	struct Ftuple_L_R ; // 0x334(0x01)
	char pad_335[0x3]; // 0x335(0x03)
	struct Fvector3 ; // 0x338(0x18)
	struct FDelegate ; // 0x350(0x0c)
	char pad_35C[0x4]; // 0x35c(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x360(0x30)
	struct Fvector3 ; // 0x390(0x18)
	enum class EVerseTrue ; // 0x3a8(0x01)
	char pad_3A9[0x3]; // 0x3a9(0x03)
	struct FDelegate ; // 0x3ac(0x0c)
	VerseStringProperty ; // 0x3b8(0x10)
	enum class EVerseTrue ; // 0x3c8(0x01)
	char pad_3C9[0x3]; // 0x3c9(0x03)
	struct FDelegate ; // 0x3cc(0x0c)
	VerseStringProperty ; // 0x3d8(0x10)
	enum class navigate_result ; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct Unpc_component* ; // 0x3f0(0x08)
	struct Utask(:type)* ; // 0x3f8(0x08)
	struct FDelegate ; // 0x400(0x0c)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x410(0x30)
	OptionProperty ; // 0x440(0x11)
	char pad_451[0x7]; // 0x451(0x07)
	int64_t ; // 0x458(0x08)
	enum class EVerseTrue ; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	struct FDelegate ; // 0x464(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x470(0x18)
	VerseStringProperty ; // 0x488(0x10)
	struct Unpc_component* ; // 0x498(0x08)
	struct Utask(:type)* ; // 0x4a0(0x08)
	struct FDelegate ; // 0x4a8(0x0c)
	struct Ftuple_L_R ; // 0x4b4(0x01)
	char pad_4B5[0x3]; // 0x4b5(0x03)
	int64_t ; // 0x4b8(0x08)
	enum class EVerseTrue ; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	struct FDelegate ; // 0x4c4(0x0c)
	VerseStringProperty ; // 0x4d0(0x10)
	struct Unpc_component* ; // 0x4e0(0x08)
	struct Utask(:type)* ; // 0x4e8(0x08)
	struct FDelegate ; // 0x4f0(0x0c)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	int64_t ; // 0x500(0x08)
	struct Fvector3 ; // 0x508(0x18)
	struct FDelegate ; // 0x520(0x0c)
	char pad_52C[0x4]; // 0x52c(0x04)
	struct Ftuple_Lvector3_Mvector3_R ; // 0x530(0x30)
	struct Fvector3 ; // 0x560(0x18)
	enum class EVerseTrue ; // 0x578(0x01)
	char pad_579[0x3]; // 0x579(0x03)
	struct FDelegate ; // 0x57c(0x0c)
	VerseStringProperty ; // 0x588(0x10)
	enum class navigate_result ; // 0x598(0x01)
	char pad_599[0x7]; // 0x599(0x07)
	struct Unpc_component* ; // 0x5a0(0x08)
	struct Utask(:type)* ; // 0x5a8(0x08)
	struct FDelegate ; // 0x5b0(0x0c)
	char pad_5BC[0x4]; // 0x5bc(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x5c0(0x30)
	OptionProperty ; // 0x5f0(0x11)
	char pad_601[0x7]; // 0x601(0x07)
	int64_t ; // 0x608(0x08)
	enum class EVerseTrue ; // 0x610(0x01)
	char pad_611[0x3]; // 0x611(0x03)
	struct FDelegate ; // 0x614(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x620(0x18)
	VerseStringProperty ; // 0x638(0x10)
	struct Utask(:type)* ; // 0x648(0x08)
	struct FDelegate ; // 0x650(0x0c)
	char pad_65C[0x4]; // 0x65c(0x04)
	int64_t ; // 0x660(0x08)
	enum class EVerseTrue ; // 0x668(0x01)
	char pad_669[0x3]; // 0x669(0x03)
	struct FDelegate ; // 0x66c(0x0c)
	VerseStringProperty ; // 0x678(0x10)
	struct Unpc_component* ; // 0x688(0x08)
	struct FDelegate ; // 0x690(0x0c)
	struct Ftuple_L_R ; // 0x69c(0x01)
	enum class EVerseTrue ; // 0x69d(0x01)
	char pad_69E[0x2]; // 0x69e(0x02)
	struct FDelegate ; // 0x6a0(0x0c)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	VerseStringProperty ; // 0x6b0(0x10)
	enum class navigate_result ; // 0x6c0(0x01)
	char pad_6C1[0x7]; // 0x6c1(0x07)
	struct Unpc_component* ; // 0x6c8(0x08)
	struct FDelegate ; // 0x6d0(0x0c)
	char pad_6DC[0x4]; // 0x6dc(0x04)
	struct Ftuple_Lvector3_M_QNavigationParameters_Nnavigation__parameters_20_3d_20_2e_2e_2e_R ; // 0x6e0(0x30)
	OptionProperty ; // 0x710(0x11)
	enum class EVerseTrue ; // 0x721(0x01)
	char pad_722[0x2]; // 0x722(0x02)
	struct FDelegate ; // 0x724(0x0c)
	struct Ftuple_L_Kchar_Mnavigate__result_R ; // 0x730(0x18)
	VerseStringProperty ; // 0x748(0x10)
	enum class EVerseTrue ; // 0x758(0x01)
	char pad_759[0x3]; // 0x759(0x03)
	struct FDelegate ; // 0x75c(0x0c)
	VerseStringProperty ; // 0x768(0x10)
	struct Unpc_component* ; // 0x778(0x08)
	struct Utask(:type)* ; // 0x780(0x08)
	struct FDelegate ; // 0x788(0x0c)
	char pad_794[0x4]; // 0x794(0x04)
	int64_t ; // 0x798(0x08)
	struct Unpc_component* ; // 0x7a0(0x08)
	struct Utask(:type)* ; // 0x7a8(0x08)
	struct FDelegate ; // 0x7b0(0x0c)
	struct Ftuple_L_R ; // 0x7bc(0x01)
	char pad_7BD[0x3]; // 0x7bd(0x03)
	int64_t ; // 0x7c0(0x08)
	enum class EVerseTrue ; // 0x7c8(0x01)
	char pad_7C9[0x3]; // 0x7c9(0x03)
	struct FDelegate ; // 0x7cc(0x0c)
	VerseStringProperty ; // 0x7d8(0x10)

	int64_t Update(); // Function VerseNPC.task_script_npc_test$WanderAround.Update // (Public|HasOutParms) // @ game+0xda071c
};

// VerseClass VerseNPC.VerseNPC
// Size: 0x28 (Inherited: 0x28)
struct UVerseNPC : UObject {

	VerseStringProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_N_RToString_L_Nloot__type_R(enum class loot_type __verse_0xB2CDDD72_Argument); // Function VerseNPC.VerseNPC._L_2fFortnite_2ecom_2fAI_2fVerseNPC_N_RToString_L_Nloot__type_R // (Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xda071c
	VerseStringProperty _L_2fFortnite_2ecom_2fAI_2fVerseNPC_N_RToString_L_Nthreat__status_R(enum class threat_status __verse_0xB2CDDD72_Argument); // Function VerseNPC.VerseNPC._L_2fFortnite_2ecom_2fAI_2fVerseNPC_N_RToString_L_Nthreat__status_R // (Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xda071c
