// AnimBlueprintGeneratedClass WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C
// Size: 0x563c (Inherited: 0xa90)
struct UWolfRidingPlayerLayerAnimBP_C : UFortVehicleLayerAnimInstance_Riding {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa90(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xa98(0xa8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xb40(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xb48(0x08)
	struct FAnimNode_Root ; // 0xb50(0x20)
	struct FAnimNode_LinkedInputPose ; // 0xb70(0xc0)
	struct FAnimNode_ModifyBone ; // 0xc30(0x128)
	struct FAnimNode_ModifyBone ; // 0xd58(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0xe80(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0xea0(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0xec0(0x68)
	struct FAnimNode_ApplyAdditive ; // 0xf28(0xc8)
	struct FAnimNode_Root ; // 0xff0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x1010(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x10d0(0xc0)
	struct FAnimNode_SaveCachedPose ; // 0x1190(0x100)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1290(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x12b0(0x20)
	struct FAnimNode_BlendListByBool ; // 0x12d0(0x48)
	struct FAnimNode_ModifyBone ; // 0x1318(0x128)
	struct FAnimNode_ModifyBone ; // 0x1440(0x128)
	struct FAnimNode_ModifyBone ; // 0x1568(0x128)
	struct FAnimNode_ModifyBone ; // 0x1690(0x128)
	struct FAnimNode_TransitionResult ; // 0x17b8(0x28)
	struct FAnimNode_TransitionResult ; // 0x17e0(0x28)
	struct FAnimNode_TransitionResult ; // 0x1808(0x28)
	struct FAnimNode_TransitionResult ; // 0x1830(0x28)
	struct FAnimNode_TransitionResult ; // 0x1858(0x28)
	struct FAnimNode_TransitionResult ; // 0x1880(0x28)
	struct FAnimNode_TransitionResult ; // 0x18a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x18d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x18f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1920(0x28)
	struct FAnimNode_TransitionResult ; // 0x1948(0x28)
	struct FAnimNode_TransitionResult ; // 0x1970(0x28)
	struct FAnimNode_TransitionResult ; // 0x1998(0x28)
	struct FAnimNode_TransitionResult ; // 0x19c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x19e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a10(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a38(0x28)
	struct FAnimNode_TransitionResult ; // 0x1a60(0x28)
	struct FAnimNode_SequencePlayer ; // 0x1a88(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1ac8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1b08(0x48)
	struct FAnimNode_StateResult ; // 0x1b50(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1b70(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1bb0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1bf0(0x48)
	struct FAnimNode_StateResult ; // 0x1c38(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1c58(0x40)
	struct FAnimNode_SequencePlayer ; // 0x1c98(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1cd8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1d20(0x40)
	struct FAnimNode_BlendListByBool ; // 0x1d60(0x48)
	struct FAnimNode_StateResult ; // 0x1da8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1dc8(0x40)
	struct FAnimNode_StateResult ; // 0x1e08(0x20)
	struct FAnimNode_SequencePlayer ; // 0x1e28(0x40)
	struct FAnimNode_BlendSpacePlayer ; // 0x1e68(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x1ed0(0xc8)
	struct FAnimNode_BlendListByBool ; // 0x1f98(0x48)
	struct FAnimNode_SequencePlayer ; // 0x1fe0(0x40)
	struct FAnimNode_StateResult ; // 0x2020(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2040(0x40)
	struct FAnimNode_StateResult ; // 0x2080(0x20)
	struct FAnimNode_TransitionResult ; // 0x20a0(0x28)
	struct FAnimNode_TransitionResult ; // 0x20c8(0x28)
	struct FAnimNode_TransitionResult ; // 0x20f0(0x28)
	struct FAnimNode_TransitionResult ; // 0x2118(0x28)
	struct FAnimNode_TransitionResult ; // 0x2140(0x28)
	struct FAnimNode_TransitionResult ; // 0x2168(0x28)
	struct FAnimNode_TransitionResult ; // 0x2190(0x28)
	struct FAnimNode_TransitionResult ; // 0x21b8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x21e0(0x40)
	struct FAnimNode_StateResult ; // 0x2220(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2240(0x40)
	struct FAnimNode_StateResult ; // 0x2280(0x20)
	struct FAnimNode_SequencePlayer ; // 0x22a0(0x40)
	struct FAnimNode_StateResult ; // 0x22e0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2300(0x40)
	struct FAnimNode_StateResult ; // 0x2340(0x20)
	struct FAnimNode_TransitionResult ; // 0x2360(0x28)
	struct FAnimNode_StateMachine ; // 0x2388(0xc8)
	struct FAnimNode_StateResult ; // 0x2450(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2470(0x40)
	struct FAnimNode_StateResult ; // 0x24b0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x24d0(0x40)
	struct FAnimNode_StateResult ; // 0x2510(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2530(0x40)
	struct FAnimNode_StateResult ; // 0x2570(0x20)
	struct FAnimNode_TransitionResult ; // 0x2590(0x28)
	struct FAnimNode_StateMachine ; // 0x25b8(0xc8)
	struct FAnimNode_StateResult ; // 0x2680(0x20)
	struct FAnimNode_SequencePlayer ; // 0x26a0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x26e0(0x48)
	struct FAnimNode_TransitionResult ; // 0x2728(0x28)
	struct FAnimNode_TransitionResult ; // 0x2750(0x28)
	struct FAnimNode_SequencePlayer ; // 0x2778(0x40)
	struct FAnimNode_StateResult ; // 0x27b8(0x20)
	struct FAnimNode_RefPose ; // 0x27d8(0x10)
	struct FAnimNode_StateResult ; // 0x27e8(0x20)
	struct FAnimNode_StateMachine ; // 0x2808(0xc8)
	struct FAnimNode_ApplyAdditive ; // 0x28d0(0xc8)
	struct FAnimNode_SequencePlayer ; // 0x2998(0x40)
	struct FAnimNode_BlendListByBool ; // 0x29d8(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x2a20(0x68)
	struct FAnimNode_ApplyAdditive ; // 0x2a88(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x2b50(0x68)
	struct FAnimNode_StateResult ; // 0x2bb8(0x20)
	struct FAnimNode_SequencePlayer ; // 0x2bd8(0x40)
	struct FAnimNode_StateResult ; // 0x2c18(0x20)
	struct FAnimNode_StateMachine ; // 0x2c38(0xc8)
	struct FAnimNode_LayeredBoneBlend ; // 0x2d00(0xe0)
	struct FAnimNode_UseCachedPose ; // 0x2de0(0x28)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x2e08(0x100)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x2f08(0x110)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3018(0xe0)
	struct FAnimNode_TransitionResult ; // 0x30f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3120(0x28)
	struct FAnimNode_TransitionResult ; // 0x3148(0x28)
	struct FAnimNode_UseCachedPose ; // 0x3170(0x28)
	struct FAnimNode_StateResult ; // 0x3198(0x20)
	struct FAnimNode_BlendSpacePlayer ; // 0x31b8(0x68)
	struct FAnimNode_StateResult ; // 0x3220(0x20)
	struct FAnimNode_UseCachedPose ; // 0x3240(0x28)
	struct FAnimNode_StateResult ; // 0x3268(0x20)
	struct FAnimNode_StateMachine ; // 0x3288(0xc8)
	struct FAnimNode_SaveCachedPose ; // 0x3350(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3450(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3478(0x100)
	struct FAnimNode_UseCachedPose ; // 0x3578(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x35a0(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive ; // 0x35c8(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace ; // 0x3698(0x110)
	struct FAnimNode_TransitionResult ; // 0x37a8(0x28)
	struct FAnimNode_TransitionResult ; // 0x37d0(0x28)
	struct FAnimNode_TransitionResult ; // 0x37f8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3820(0x28)
	struct FAnimNode_TransitionResult ; // 0x3848(0x28)
	struct FAnimNode_TransitionResult ; // 0x3870(0x28)
	struct FAnimNode_TransitionResult ; // 0x3898(0x28)
	struct FAnimNode_TransitionResult ; // 0x38c0(0x28)
	struct FAnimNode_TransitionResult ; // 0x38e8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3910(0x28)
	struct FAnimNode_TransitionResult ; // 0x3938(0x28)
	struct FAnimNode_TransitionResult ; // 0x3960(0x28)
	struct FAnimNode_TransitionResult ; // 0x3988(0x28)
	struct FAnimNode_TransitionResult ; // 0x39b0(0x28)
	struct FAnimNode_TransitionResult ; // 0x39d8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3a00(0x28)
	struct FAnimNode_TransitionResult ; // 0x3a28(0x28)
	struct FAnimNode_TransitionResult ; // 0x3a50(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3a78(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3ab8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3af8(0x48)
	struct FAnimNode_StateResult ; // 0x3b40(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3b60(0x40)
	struct FAnimNode_SequencePlayer ; // 0x3ba0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3be0(0x48)
	struct FAnimNode_StateResult ; // 0x3c28(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3c48(0x40)
	struct FAnimNode_StateResult ; // 0x3c88(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3ca8(0x40)
	struct FAnimNode_BlendListByBool ; // 0x3ce8(0x48)
	struct FAnimNode_SequencePlayer ; // 0x3d30(0x40)
	struct FAnimNode_StateResult ; // 0x3d70(0x20)
	struct FAnimNode_TransitionResult ; // 0x3d90(0x28)
	struct FAnimNode_TransitionResult ; // 0x3db8(0x28)
	struct FAnimNode_TransitionResult ; // 0x3de0(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e08(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e30(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e58(0x28)
	struct FAnimNode_TransitionResult ; // 0x3e80(0x28)
	struct FAnimNode_TransitionResult ; // 0x3ea8(0x28)
	struct FAnimNode_SequencePlayer ; // 0x3ed0(0x40)
	struct FAnimNode_StateResult ; // 0x3f10(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3f30(0x40)
	struct FAnimNode_StateResult ; // 0x3f70(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3f90(0x40)
	struct FAnimNode_StateResult ; // 0x3fd0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x3ff0(0x40)
	struct FAnimNode_StateResult ; // 0x4030(0x20)
	struct FAnimNode_TransitionResult ; // 0x4050(0x28)
	struct FAnimNode_StateMachine ; // 0x4078(0xc8)
	struct FAnimNode_StateResult ; // 0x4140(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4160(0x40)
	struct FAnimNode_StateResult ; // 0x41a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x41c0(0x40)
	struct FAnimNode_StateResult ; // 0x4200(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4220(0x40)
	struct FAnimNode_StateResult ; // 0x4260(0x20)
	struct FAnimNode_TransitionResult ; // 0x4280(0x28)
	struct FAnimNode_StateMachine ; // 0x42a8(0xc8)
	struct FAnimNode_StateResult ; // 0x4370(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4390(0x40)
	struct FAnimNode_StateResult ; // 0x43d0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x43f0(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4430(0x40)
	struct FAnimNode_SequencePlayer ; // 0x4470(0x40)
	struct FAnimNode_BlendListByBool ; // 0x44b0(0x48)
	struct FAnimNode_BlendListByBool ; // 0x44f8(0x48)
	struct FAnimNode_StateResult ; // 0x4540(0x20)
	struct FAnimNode_SequencePlayer ; // 0x4560(0x40)
	struct FAnimNode_StateResult ; // 0x45a0(0x20)
	struct FAnimNode_SequencePlayer ; // 0x45c0(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4600(0x48)
	struct FAnimNode_SequencePlayer ; // 0x4648(0x40)
	struct FAnimNode_BlendListByBool ; // 0x4688(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x46d0(0x68)
	struct FAnimNode_StateResult ; // 0x4738(0x20)
	struct FAnimNode_StateMachine ; // 0x4758(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4820(0x128)
	struct FAnimNode_ApplyAdditive ; // 0x4948(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4a10(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4a78(0xc8)
	struct FAnimNode_BlendSpacePlayer ; // 0x4b40(0x68)
	struct FAnimNode_RefPose ; // 0x4ba8(0x10)
	struct FAnimNode_BlendListByBool ; // 0x4bb8(0x48)
	struct FAnimNode_BlendListByBool ; // 0x4c00(0x48)
	struct FAnimNode_BlendSpacePlayer ; // 0x4c48(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4cb0(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4d18(0x48)
	struct FAnimNode_StateResult ; // 0x4d60(0x20)
	struct FAnimNode_StateMachine ; // 0x4d80(0xc8)
	struct FAnimNode_TransitionResult ; // 0x4e48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4e70(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e98(0x40)
	struct FAnimNode_StateResult ; // 0x4ed8(0x20)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4ef8(0x10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4f08(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4f28(0xc8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x4ff0(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x50c0(0x110)
	struct FAnimNode_Root ; // 0x51d0(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x51f0(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x52b0(0xc0)
	struct FAnimNode_Root ; // 0x5370(0x20)
	struct FAnimNode_LinkedInputPose ; // 0x5390(0xc0)
	struct FAnimNode_LinkedInputPose ; // 0x5450(0xc0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5510(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x55d0(0x20)
	bool State Rule Moving Idle; // 0x55f0(0x01)
	bool State Rule Idle Moving; // 0x55f1(0x01)
	bool Is Jumping; // 0x55f2(0x01)
	bool State Rule Fall Idle; // 0x55f3(0x01)
	bool Is Falling; // 0x55f4(0x01)
	bool State Rule Fall Moving; // 0x55f5(0x01)
	bool State Rule Jump Land Moving; // 0x55f6(0x01)
	bool Is Surface Swimming; // 0x55f7(0x01)
	bool State Rule Swim Idle Swim Loco; // 0x55f8(0x01)
	char pad_55F9[0x7]; // 0x55f9(0x07)
	double BodyRoll; // 0x5600(0x08)
	double WolfSpeed2D; // 0x5608(0x08)
	bool Is Boosting; // 0x5610(0x01)
	bool Play Land Additive; // 0x5611(0x01)
	bool Is Moving Backwards; // 0x5612(0x01)
	bool Should Play Stop Backwards; // 0x5613(0x01)
	bool Is Turning in Place; // 0x5614(0x01)
	char pad_5615[0x3]; // 0x5615(0x03)
	double Turn in Place Angle Delta; // 0x5618(0x08)
	bool Was Turning Right; // 0x5620(0x01)
	char pad_5621[0x7]; // 0x5621(0x07)
	double Turn in Place Rotation Speed; // 0x5628(0x08)
	double Backwards Play Rate; // 0x5630(0x08)
	float SlopeRoll; // 0x5638(0x04)

	void VehicleFinalPoseOverride(struct FPoseLink InFinalPose, struct FPoseLink& VehicleFinalPoseOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleFinalPoseOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink InPoseUpperAndLowerCachePose, struct FPoseLink& VehicleFullBodyOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink& VehicleLowerBodyOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink& VehicleSplitBodyOverride); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda071c
	void AnimGraph(struct FPoseLink& AnimGraph); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void GetMainAnimBPData_Wolf(struct UObject* AnimInstance); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.GetMainAnimBPData_Wolf // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_0A1EFC344EF1A6E586A54FAEC4F5F766(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_0A1EFC344EF1A6E586A54FAEC4F5F766 // (BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_4EDCD4F04E8D5963547EB2BE1F10FA2D(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_SequencePlayer_4EDCD4F04E8D5963547EB2BE1F10FA2D // (BlueprintEvent) // @ game+0xda071c
	void EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D7C43EB141CFE2929E3D23914954FA93(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_WolfRidingPlayerLayerAnimBP_AnimGraphNode_BlendListByBool_D7C43EB141CFE2929E3D23914954FA93 // (BlueprintEvent) // @ game+0xda071c
	void BlueprintCollectRidableAnimBPData(struct UAnimInstance* RidableAnimInstance); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.BlueprintCollectRidableAnimBPData // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void UpdateBoostPlayRate(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.UpdateBoostPlayRate // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void PlaceHandIKTargets(); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.PlaceHandIKTargets // (Event|Protected|BlueprintEvent) // @ game+0xda071c
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda071c
	void ExecuteUbergraph_WolfRidingPlayerLayerAnimBP(int32_t EntryPoint); // Function WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.ExecuteUbergraph_WolfRidingPlayerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xda071c
};

